-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 30, 2026 at 06:11 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `company_inventory`
--

-- --------------------------------------------------------

--
-- Table structure for table `announcements`
--

CREATE TABLE `announcements` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `announcement_date` date NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `company_holidays`
--

CREATE TABLE `company_holidays` (
  `id` int(11) NOT NULL,
  `holiday_date` date NOT NULL,
  `holiday_name` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `company_holidays`
--

INSERT INTO `company_holidays` (`id`, `holiday_date`, `holiday_name`, `created_at`) VALUES
(1, '2026-05-01', 'วันแรงงานแห่งชาติ', '2026-04-21 01:46:12'),
(2, '2026-06-03', 'วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าฯ พระบรมราชินี', '2026-04-21 01:47:52'),
(3, '2026-07-28', 'วันเฉลิมพระชนมพรรษา พระบาทสมเด็จพระปรเมนทรรามาธิบดีศรีสินทรมหาวชิราลงกรณพระวชิรเกล้าเจ้าอยู่หัว (รัชกาลที่ 10)', '2026-04-21 01:52:07'),
(4, '2026-08-12', 'วันแม่แห่งชาติ', '2026-04-21 01:52:50'),
(5, '2026-10-13', 'วันนวมินทรมหาราช', '2026-04-21 01:54:00'),
(6, '2026-10-23', 'วันปิยมหาราช', '2026-04-21 01:54:45'),
(7, '2026-12-05', 'วันพ่อแห่งชาติ', '2026-04-21 01:55:30'),
(8, '2026-12-31', 'วันปีใหม่', '2026-04-21 01:55:50'),
(9, '2026-01-01', 'วันปีใหม่', '2026-04-21 02:00:45'),
(10, '2026-02-17', 'วันตรุษจีน', '2026-04-21 02:01:30'),
(11, '2026-03-03', 'วันมาฆบูชา', '2026-04-21 02:02:16'),
(12, '2026-04-13', 'วันสงกรานต์', '2026-04-21 02:02:59'),
(13, '2026-04-14', 'วันสงกรานต์', '2026-04-21 02:03:06'),
(14, '2026-04-15', 'วันสงกรานต์', '2026-04-21 02:03:10');

-- --------------------------------------------------------

--
-- Table structure for table `credit_requests`
--

CREATE TABLE `credit_requests` (
  `id` int(11) NOT NULL,
  `customer_id` int(11) NOT NULL,
  `requested_limit` decimal(15,2) NOT NULL,
  `reason` text DEFAULT NULL,
  `status` varchar(50) DEFAULT 'Pending',
  `requested_by` varchar(100) DEFAULT NULL,
  `approved_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `customers`
--

CREATE TABLE `customers` (
  `id` int(11) NOT NULL,
  `cus_name` varchar(255) NOT NULL,
  `cus_address` text DEFAULT NULL,
  `cus_tel` varchar(50) DEFAULT NULL,
  `cus_tax_id` varchar(20) DEFAULT NULL,
  `credit_limit` decimal(15,2) DEFAULT 0.00,
  `credit_term` int(11) DEFAULT 0 COMMENT 'จำนวนวันให้เครดิต',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `delivery_orders`
--

CREATE TABLE `delivery_orders` (
  `id` int(11) NOT NULL,
  `do_no` varchar(50) NOT NULL,
  `sale_id` int(11) NOT NULL,
  `driver_name` varchar(150) NOT NULL,
  `license_plate` varchar(50) NOT NULL,
  `delivery_date` date NOT NULL,
  `status` varchar(50) DEFAULT 'Scheduled',
  `remark` text DEFAULT NULL,
  `created_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `employees`
--

CREATE TABLE `employees` (
  `emp_id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `role` varchar(20) NOT NULL,
  `dept` varchar(100) NOT NULL,
  `shift_id` int(11) DEFAULT NULL,
  `base_salary` decimal(10,2) NOT NULL DEFAULT 0.00,
  `status` varchar(20) NOT NULL DEFAULT 'Active',
  `bank_account` varchar(20) DEFAULT NULL,
  `salary` decimal(10,2) DEFAULT 0.00
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `employees`
--

INSERT INTO `employees` (`emp_id`, `userid`, `password`, `username`, `role`, `dept`, `shift_id`, `base_salary`, `status`, `bank_account`, `salary`) VALUES
(1, 'admin', '$2y$10$Q8WtPORd.DukYtumnCqsTeds742J5ObzH3lZkrD8AoLAfBH8RuWD6', '', 'ADMIN', '', NULL, 0.00, 'Active', NULL, 0.00),
(4, '69021262', '$2y$10$kWEkE78LDh11d3Iy3Uvnue8D6wFv.RcNKCVoj5peAyFo4ksDqG72m', 'นายสุทธิเดช สุนทรโภคิน', 'USER', 'แผนกคอมพิวเตอร์', NULL, 0.00, 'Active', '', 0.00),
(5, '3403026', '3403026', 'นายวินัย พิลึก', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(6, '3803191', '3803191', 'นายสาคร เสามั่น', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(7, '4002269', '4002269', 'นายเพ็ญรุ่ง มั่นช่วยวงศ์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(8, '4201298', '4201298', 'นายไกรวุฒิ บัวบาน', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(9, '4201299', '4201299', 'นายกติยะ เสามั่น', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(10, '4301332', '4301332', 'นายกมล สิทธิพล', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(11, '4602369', '4602369', 'นายประชัน สุวรรณพันธ์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(12, '5307531', '5307531', 'นายประทีป อ่อนโชน', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(13, '5401539', '5401539', 'นายอนุรักษ์ อ่วมอินทร์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(14, '5402542', '5402542', 'นายสุเพชร์ แขกแพ', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(15, '5403547', '5403547', 'นายทองไทย ไขแสงจันทร์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(16, '5406557', '5406557', 'นายสาธิต บุญรอด', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(17, '5408564', '5408564', 'นายเอกพงษ์ อาจคงหาญ', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(18, '5503579', '5503579', 'นายสุธาเทพ คำสาย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(19, '5503581', '5503581', 'นายฉลอง หว่างกลาง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(20, '5607648', '5607648', 'นายสิริพงษ์ พงษ์ประเสริฐ', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(21, '5710726', '5710726', 'นายอิทธิพงษ์ ก๋งแก้ว', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(22, '5804755', '5804755', 'นายจักรกฤช สืบสาย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(23, '5805762', '5805762', 'นายนิรุฒ ศรีคร้าม', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(24, '5806782', '5806782', 'นายสาโรช สืบสาย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(25, '5806784', '5806784', 'นายรัชพล ราภาศิริ', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(26, '5807798', '5807798', 'นายสุทธิรักษ์ รอบรู้', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(27, '5808811', '5808811', 'นายธนา สิงหะภูกาม', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(28, '5811847', '5811847', 'นายสุนทร บุญประโคน', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(29, '5902863', '$2y$10$t7Yd0cOu1B5chNB/PGbkv.m2ed8YrQCVR8qWmMaZpJ2drrs1R6cFG', 'นายราชัญ เลื่อนลอย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(30, '5903870', '5903870', 'นายพิสิฏฐ์ กรุดไทย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(31, '6001937', '6001937', 'นายอัษฎา ผลพิบูลย์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(32, '6006970', '6006970', 'นายทรงพล จรูญชนม์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(33, '6009996', '6009996', 'นายทรงศักดิ์ คล้ายคลึง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(34, '62091073', '62091073', 'นายธวัชชัย ละอองศรี', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(35, '63031093', '63031093', 'นายอนุสรณ์ เจ๊กรวย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(36, '64061139', '64061139', 'นายจิรศักดิ์ บัวฝรั่ง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(37, '65061164', '65061164', 'นายสุรชัย ฟักหอม', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(38, '67021214', '67021214', 'นายทรัพย์อนันต์ แซ่เฮ้ง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(39, '68021242', '68021242', 'นายคมกฤษ รอชัยกุล', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(40, '68031243', '68031243', 'นายศราวุฒ สิงห์สกุล', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(41, '68031244', '68031244', 'นายนัฐวัฒน์ เมืองนก', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(42, '68091252', '68091252', 'นายบรรเทิง ปั้นเกี้ยว', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(43, '69021261', '69021261', 'นายณัฐวรรธน์ อินยัง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(44, '69031265', '69031265', 'นายนพรัตน์ ทองบุญเย็น', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(45, '3811228', '3811228', 'นายปิติ กรุณามัยพันธ์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(46, '3903237', '3903237', 'นายกรชัยวัส พานแก้ว', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(47, '4001261', '4001261', 'นายจารึก นามนิล', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(48, '4001263', '4001263', 'นายสังเวียน บุญรอด', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(49, '4001267', '4001267', 'นาย เฉลิมชนม์ ทองยศ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(50, '4004273', '4004273', 'นายวิยดา วัฒนจรูญโรจน์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(51, '4301333', '4301333', 'นายแดง ค่ำคูณ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(52, '4602371', '4602371', 'นายพิเชษฐ เนตรพะเนาว์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(53, '4802408', '4802408', 'นายสกลเดช ศรีปิตา', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(54, '4804412', '4804412', 'นายอดิเรก คำภีร์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(55, '4902441', '4902441', 'นายทักษิณ ศรีคุ้ม', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(56, '5205504', '5205504', 'นายอภิชาติ วันดี', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(57, '5207511', '5207511', 'นายธีระพงษ์ นิ่มอนงค์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(58, '5402543', '5402543', 'นายวินัย จูพล', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(59, '5403549', '5403549', 'นายนิคม เขื่อนสันเที๊ยะ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(60, '5510612', '5510612', 'นายจริญ ดิสผล', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(61, '5604631', '5604631', 'นายอำพล จำง่าย', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(62, '5612665', '5612665', 'นายระวี อ่างคำ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(63, '5703684', '5703684', 'นายวสันต์ ใหญ่ยงค์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(64, '5707709', '5707709', 'นายตฤณ ศรีจันทร์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(65, '5802742', '$2y$10$xg6dTUXip4QUsJloJwBUeeLrM9ar7LlQ3jABDwk4wu..A8KN7yeXi', 'นายถาวร จูพล', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(66, '5807803', '5807803', 'นายจิราภาส ดวงใจ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(67, '5902858', '5902858', 'นายสมโภชน์ เชี่ยวชาญ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(68, '6002943', '6002943', 'นายธีรพงศ์ ประยงค์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(69, '6005966', '6005966', 'นายนที คำเอก', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(70, '60111004', '60111004', 'นายสุรชัย สิมตะมะ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(71, '61061032', '61061032', 'นายลิขิต ศรีคร้าม', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(72, '62071067', '62071067', 'นายวราวุฒิ บุตรเขียว', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(73, '63101113', '63101113', 'นายสมพงษ์ วงษ์ละคร', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(74, '64111149', '64111149', 'นายศราวุฒิ นาคสิทธิพันธุ์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(75, '65031158', '65031158', 'นายพิพัฒน์ แสงสุริยา', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(76, '65081172', '65081172', 'นายเจียง ขานยา', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(77, '67021217', '67021217', 'นายสิทธิศักดิ์ เกตุพุก', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(78, '68011239', '68011239', 'นายถนัด พิมพ์กลาง', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(79, '69011259', '69011259', 'นายหนูนา สิงห์นันต์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(80, '3505115', '3505115', 'นายปรีชา นาคสิทธิพันธุ์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(81, '3601127', '3601127', 'นายวิโรจน์ สิงหา', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(82, '4205313', '4205313', 'นายฉลาด ราชวงษ์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(83, '4604377', '$2y$10$DYjP04AVdxIcUS9haXgFbu.2ZmrsWcs6DYnZp.Z1n.82HAk5.uFSS', 'นายเสรี สุวาวัลย์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(84, '4909472', '4909472', 'นายนพดล สังข์ภิรมย์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(85, '5907900', '5907900', 'นายชัยวัฒน์ จิปอมจา', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(86, '61041026', '61041026', 'นายสายชล สกุลดี', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(87, '65101179', '65101179', 'นายทวีศักดิ์ คะหาญ', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(88, '66041194', '66041194', 'นายไชยรัตน์ แจ้งสว่าง', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(89, '67021218', '67021218', 'นายมณฑล ล่วงลือ', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(90, '67081232', '67081232', 'นายชูเดช อนุรักษ์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(91, '68101253', '68101253', 'นายวชิรวิทย์ ยิ้มพราย', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(92, '68111257', '68111257', 'นายประสิทธิ์ พันธ์ศรี', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(93, '3702158', '3702158', 'นายกังวาน ภูริเดชา', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(94, '5901854', '$2y$10$BzW57fH89TxkyxwCze7ZNOIrv0zOLiQdYJ2Cba9hXJenJm268j3ge', 'นายศิวะพล สันทาลุนัย', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(95, '62111081', '62111081', 'นายจักรกฤษณ์ อินทรโชติ', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(96, '65091177', '65091177', 'นายณัฐวุฒิ ปั้นจันทร์', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(97, '69021263', '69021263', 'นายพุฒิเมธ ชมวงษ์', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(98, '3707173', '3707173', 'นางสาวชลธิชา ชัดใจ', 'USER', 'ฝ่ายวิชาการ', NULL, 0.00, 'Active', NULL, 0.00),
(99, '4004274', '$2y$10$61VgoMulX5nkRshaqmJbxOoOM8JwfS2WIOuZ0iA1QtvVHAJmCSdLK', 'นางจันทร์จิรา อินทรา', 'USER', 'ฝ่ายวิชาการ', NULL, 0.00, 'Active', NULL, 0.00),
(100, '5306524', '5306524', 'นายเชี่ยวชาญ เพ็ชรนิล', 'USER', 'ฝ่ายวิชาการ', NULL, 0.00, 'Active', NULL, 0.00),
(101, '3404029', '3404029', 'นายสุจิน จันทร์เกตุ', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(102, '3501073', '3501073', 'นายมานะ จันทร์ตรี', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(103, '3709181', '3709181', 'นายโสภณ แสงซอน', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(104, '3709182', '3709182', 'นายสถาพร ร้อยแก้ว', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(105, '3804199', '3804199', 'นายวิรัตน์ อุ่นธง', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(106, '3804203', '3804203', 'นายประสิทธิ์ ถุงพุดซา', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(107, '5702673', '$2y$10$IR7CZnaNCOVwwmTKROtsR.DaiLS1a9t1pxOVzU4kjnRMxwYr9HpYC', 'นางสาวศิวพร เฉยดี', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(108, '5702674', '5702674', 'นางสาวสิริพิชชา แก้วกุล', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(109, '5706695', '5706695', 'นายนิราช จันทร์สุวรรณ', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(110, '5706705', '5706705', 'นายอำนาจ ภักดีนิมิตร', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(111, '5903868', '5903868', 'นายจำนงค์ ชูศรีจันทร์', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(112, '5909917', '5909917', 'นายณัฐิวุฒิ กาฬภักดี', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(113, '6004955', '6004955', 'นายณัฐสิทธิ์ อุตมกูล', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(114, '6006969', '6006969', 'นายพงศ์ศิริ รอดมนเฑียร', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(115, '63081105', '63081105', 'นายณัฐวุฒิ เพียรสุขเหลือ', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(116, '63111116', '63111116', 'นายชาคร จันทร์แก้ว', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(117, '65021156', '65021156', 'นายเมธี ภูกัน', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(118, '3609151', '3609151', 'นายอิสเรศ ไตรยวงศ์', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(119, '4210324', '4210324', 'นายอนุวัฒน์ บุญธรรม', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(120, '4912475', '4912475', 'นายคูณ พานนนท์', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(121, '5306525', '$2y$10$HPWtlin8gOzcdg3y41GBs.yjZbWOg3oPpyCJGjNPzq4c78aWJN3Ji', 'นายธรรมรัตน์ แมลงภู่', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(122, '5907896', '5907896', 'นายชาญชัย ไหลหาโคตร', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(123, '62081070', '62081070', 'นายนนทรัตน์ แช่มรวย', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(124, '66061200', '66061200', 'นายสิทธิศักดิ์ อ่อนคำมา', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(125, '68061248', '68061248', 'นายษรชัย โคตฆ์สม', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(126, '69031264', '69031264', 'นายชายนนท์ ใจเที่ยงธรรม', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(127, '3402024', '3402024', 'นางสาววรรณวิมล รุ่งโรจน์พานิช', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(128, '3501072', '3501072', 'นางปิยะวรรณ โป๊พัว', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(129, '3505102', '3505102', 'นางกฤษฎี ยังโหมด', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(130, '3705166', '3705166', 'นางสาวนันทยา แดงศรี', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(131, '3901235', '$2y$10$OGRISQgjvYSpnqRBVA9/c.ZlJJmGMEBdJSIHWs586/SLYgthhk/T6', 'นางสิริลักษณ์ เม่นสุวรรณ์', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(132, '4504352', '4504352', 'นางอารีลักษณ์ บุญธรรม', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(133, '4512367', '4512367', 'นางสาวกาญจนา จรูญชนม์', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(134, '6009994', '6009994', 'นางสาวชลธิชา ปั้นรูป', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(135, '3404034', '3404034', 'นายโชติ กสิวัฒน์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(136, '3409055', '3409055', 'นายบงกาญจน์ กาญจนกิจโสภณ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(137, '3907255', '3907255', 'นางยุพเยาว์ ม่วงแจ่ม', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(138, '4501346', '4501346', 'นายธานี เจนคุรุกิจ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(139, '4508359', '4508359', 'นายสุรศักดิ์ บูรณศิรินทร์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(140, '4904449', '4904449', 'นายเชิดศักดิ์ มางิ้ว', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(141, '5510611', '$2y$10$e27au925P2qKo9tjnHk26.DAY7rHF4nR4S6YWQl7axGzucN3lnLGu', 'นางสาวมิตชิตา สิทธิเจริญ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(142, '5806767', '5806767', 'นายศาสตรา นาคาโอก้า', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(143, '5907897', '5907897', 'นายวชิรเมษฐ์ โชติศิวัชโตบุญ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(144, '61071037', '61071037', 'นายวราสิทธิ์ อบรม', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(145, '62051049', '62051049', 'นางสาวศิรินทิพย์ วงษ์กรวด', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(146, '63011083', '63011083', 'นายนฤทธิ์ อุดมวงค์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(147, '63031091', '63031091', 'นายภูมินทร์ ชูเทียน', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(148, '64011126', '64011126', 'นางสาวณัฐวรรณ คงกระพัน', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(149, '64021130', '64021130', 'นางสาวพรไพลิน ทองนวล', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(150, '64051138', '64051138', 'นางสาวณัฐกานต์ นิลชัย', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(151, '65121185', '65121185', 'นายรัฐพงศ์ จันทวาลย์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(152, '67011213', '67011213', 'นางสาวอริสรา สุดตา', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(153, '67031221', '67031221', 'นายธนาดล ศรีโนนสูง', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(154, '68071249', '68071249', 'นายอภิสิทธิ์ สุขเสาร์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(155, '68071250', '68071250', 'นายสิทธิชัย เทวโรจน์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(156, '68111256', '68111256', 'นายชัยวัฒน์ จันทรสมบัติ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(157, '3308014', '3308014', 'นางสาวสุดา ตติยวงศ์', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(158, '3709184', '3709184', 'นายรัตนชัย ธูปกระแจะ', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(159, '3710185', '3710185', 'นางรพีพรรณ คงดั่น', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(160, '4002270', '4002270', 'นางมณีรัตน์ คงทน', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(161, '5005484', '5005484', 'นางกรรณิการ์ ช่างคิด', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(162, '5802749', '$2y$10$y5WsZ4F2p7iGkOcjkL.nxumG8HzfPeSGHjJrbUT7U3nD/i.yj4R4y', 'นางจุฑามาส สนธิรอด', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(163, '5806771', '5806771', 'นายอนันตชัย ศักดิ์ชัยเจริญกุล', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(164, '3801125', '3801125', 'นางสาว ภรพัส คล้ายคลึง', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(165, '3905247', '3905247', 'นางสาวสายหยุด จันทร์ปาน', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(166, '3908256', '$2y$10$zirxAuyKjUcv/pRiOZIjvuKMkzfCw1xRufzhGF4S1GbqFzVWZPY5O', 'นางอรุณี แยบกระโทก', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(167, '4004272', '4004272', 'นางนงคราญ เรียนรอบกิจ', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(168, '4407345', '4407345', 'นางนันทพร ลังการ์พินธุ์', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(169, '4705394', '4705394', 'นางสาวนภาพร หริญบูรณานนท์', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(170, '5411571', '5411571', 'นางสาวกรรณิกา วงศ์อุตร', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(171, '5609652', '5609652', 'นางสาวจันทร์เพ็ญ เกิดผล', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(172, '3502082', '3502082', 'นางสาวพวงเพ็ญ ชมทะเล', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(173, '3504087', '3504087', 'นายสุรินทร์ เลิศสมสกุลชัย', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(174, '3604146', '3604146', 'นางสาวจุฑามาศ แก้วหาวงศ์', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(175, '3804198', '3804198', 'นางสาวสุวรรณี ฉิ่งทอง', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(176, '3809222', '3809222', 'นางจารุพร ฉมังหัตถพงศ์', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(177, '3905245', '$2y$10$txwdSLwY0J4vys/ZV1AmaOIGzyQ/st6lsuaiewXjMeIQdZtLnBwri', 'นางสาวบุญนาค วุฒิธาดา', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(178, '4306335', '4306335', 'นายสุนทร นิลสันเทียะ', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(179, '5006485', '5006485', 'นางสรรสิริ วันดี', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(180, '5701668', '5701668', 'นางสาวณัฐพัชร์ กนิษฐา', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(181, '65011153', '65011153', 'นางสาวกิดติญาภัท ดวงใจ', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(182, '3401017', '$2y$10$B2QlhNMvK1vxiyQaITieA.Y0.jY3EQQmwHc42WvJbVMYcF67lpRsi', 'นางสาววราภรณ์ มารศรี', 'USER', 'ฝ่ายการเงิน', NULL, 0.00, 'Active', NULL, 0.00),
(183, '3505106', '3505106', 'นางสาวธัญพร สุรินทร์', 'USER', 'ฝ่ายการเงิน', NULL, 0.00, 'Active', NULL, 0.00),
(184, '3502084', '$2y$10$RrY3s2VvgViksx/XUDvt5Ocf/BrnBaY9ocUhZ/8eeolTIkCMAo3o.', 'นายสุขสันติ กล่ำแดง', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(185, '3805204', '$2y$10$JuoGrSYbIYNTNB22djLvM.S9ixUst9FuM7ss/oAThDf8hV.PnfTxC', 'นางพูลสุข อินทรโชติ', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(186, '4201296', '4201296', 'นายบุญมี ทะนาไธสง', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(187, '61021015', '61021015', 'นายสมยศ เม่นสุวรรณ์', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(188, '61071041', '61071041', 'นายมานพ ศรีวารี', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(189, '62031048', '62031048', 'นายอภิชิต เต็มตาวงษ์', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(190, '63021087', '63021087', 'นางสาวสุนีย์ หอมกระโทก', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(191, '64011122', '64011122', 'นายแจ้ง สืบวงษ์', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(192, '64011127', '64011127', 'นายศิวดล ทองสว่าง', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(193, '65091176', '65091176', 'นายกรด เวียนเปะ', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(194, '66041193', '66041193', 'นางสาวพิชญาพัชญ์ อู๋ปั๋น', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(195, '68101255', '68101255', 'นายพนารักษ์ สิมมาลา', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(196, '68111258', '68111258', 'นายนพรัตน์ ปลอดภัย', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(197, '4709397', '$2y$10$h3fxmuM0f0Y2C7BGnzpAYOXhxkkM2VRFV8deWRBHXfIF3SpSNyfvC', 'นายสุทธิชัย ศักดิ์ชัยเจริญกุล', 'USER', 'ฝ่ายงานวางแผน', NULL, 0.00, 'Active', NULL, 0.00),
(198, '3707172', '3707172', 'นายคมสันต์ ศิริโสภณ', 'USER', 'แผนกคอมพิวเตอร์', NULL, 0.00, 'Active', NULL, 0.00),
(199, '3411061', '$2y$10$c.eqG02RRHUtoHnaNWpSWe5JfyYOJPZmewpCN.BZYUXn37lia0js6', 'นางสมพร สองจันทร์', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(200, '3611155', '3611155', 'นางสาวกุศล คงเหล่', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(201, '3907252', '3907252', 'นางวันเพ็ญ โพธิ์พันธุ์', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(202, '3907254', '3907254', 'นางสุมาลี ทะนาไธสง', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(203, '4008283', '4008283', 'นางเรณู เพไร', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(204, '3601132', '3601132', 'นายจำลอง จุมจวง', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(205, '3601140', '3601140', 'นายอำนวย จักษุกัน', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(206, '4205315', '4205315', 'นายสถาพร มินตาไพสิฐ', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(207, '4402341', '4402341', 'นายมานพ พานแก้ว', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(208, '5106494', '5106494', 'นายธนพงศ์ ยิ้มใหญ่หลวง', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(209, '5107497', '5107497', 'นายน้อม ใจดี', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(210, '5410569', '5410569', 'นายวิโรจน์ ชมแค', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(211, '5503582', '5503582', 'นายยอดชาย ฟุ้งสุวรรณ', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(212, '5511619', '5511619', 'นายสมบูรณ์ โตเจริญวิวัฒน์', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(213, '5604629', '5604629', 'นายฉัตรชัย เพ็ชรเรือง', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(214, '5802748', '5802748', 'นายปราโมทย์ นุชอุดม', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(215, '5804751', '5804751', 'นายสมบัติ กลิ่นกลัด', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(216, '62061053', '62061053', 'นายวิชญ์พล เพ็ชรเรือง', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(217, '63111120', '63111120', 'นายทองเทพ น้อยไทรวัน', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(218, '66061199', '66061199', 'นายรัชพล โสประดิษฐ์', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(219, '67051224', '67051224', 'นายศรัณย์ อาษา', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(220, '67111235', '67111235', 'นายมนตรี อาจสาลี', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(221, '3601138', '3601138', 'นายวิเชียร ภูผา', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(222, '3707170', '3707170', 'นายมนตรี นรบุตร', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(223, '3806209', '3806209', 'นายวิเชียร สุริยา', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(224, '4301331', '4301331', 'นายถนอม ไม้เลิศ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(225, '4602373', '4602373', 'นายรุ่ง ทองคำ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(226, '4802409', '4802409', 'นายอนุศิษฎ์ บุตรดางาม', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(227, '4907463', '4907463', 'นายธนาพร ทักษ์อรุณกุล', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(228, '4907466', '4907466', 'นายจารึก โมราชาติ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(229, '5309536', '5309536', 'นายขวัญชัย อุปเงิน', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(230, '5505586', '5505586', 'นายเดือน ทองสิงห์', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(231, '5505587', '5505587', 'นายรุ่งสิริ สัตย์ซื่อ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(232, '5705694', '5705694', 'นายยอดชาย เฉลิมหมู่', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(233, '5710725', '5710725', 'นายองอาจ ไชยลังกา', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(234, '5805761', '5805761', 'นายพงษ์ศิริ ปานดี', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(235, '5807797', '5807797', 'นายวชิระ ศรีพุฒ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(236, '5811848', '5811848', 'นายวิชาญ กาละมัญดี', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(237, '5907903', '5907903', 'นายจิรานุวัฒน์ แมลงภู่', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(238, '5907909', '5907909', 'นายไกรษร บุญดี', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(239, '65011152', '65011152', 'นายเสน่ห์ จักษุกัน', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(240, '65021155', '65021155', 'นายอนุพงษ์ อ่วมอินทร์', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(241, '65051159', '65051159', 'นายธนพัฒน์ อาดสะลาด', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(242, '65061163', '65061163', 'นายนที พานแก้ว', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(243, '65061166', '65061166', 'นายทิวา เกิดเสวี', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(244, '65061167', '65061167', 'นายศิวกรณ์ ยี่หวา', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(245, '66021191', '66021191', 'นายศรชัย กิมฮวย', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(246, '66091207', '66091207', 'นายนันทิพัฒน์ พันธ์น้อย', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(247, '67011212', '67011212', 'นายศุภสิน เอกภาคสวัสดิ์', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(248, '3901229', '3901229', 'นายไตรรัตน์ นาวารัตน์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(249, '3901234', '3901234', 'นายอรรถสิทธิ์ สวนทรัพย์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(250, '3904242', '3904242', 'นายสมศักดิ์ โพธิ์พันธุ์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(251, '4001266', '4001266', 'นายพยนต์ อยู่สินไชย', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(252, '4301328', '4301328', 'นายไพฑูรย์ ฟักสุข', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(253, '4808425', '4808425', 'นายรัตนชัย โสมวงษ์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(254, '5002480', '5002480', 'นายสมพร แก้วเกษ', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(255, '5101490', '5101490', 'นายออมทรัพย์ คุณโฑ', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(256, '5304516', '5304516', 'นายธนาดล จวงเจิม', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(257, '5604630', '5604630', 'นายสิทธิชัย ยี่สุ่นแป้น', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(258, '5706701', '5706701', 'นายวรวุฒิ ทาบุญ', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(259, '5801739', '5801739', 'นายพัชระวรรธน์ แก้วหาวงศ์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(260, '5804758', '5804758', 'นายชูโชค ธัญทรงธรรม', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(261, '5807793', '5807793', 'นายศิวพงษ์ สมศรี', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(262, '5810835', '5810835', 'นายสมเกียรติ มิเอม', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(263, '5812849', '5812849', 'นายกฤตลักษณ์ สาทะเล', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(264, '5907911', '5907911', 'นายดลธรรม ศรีเพชร', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(265, '5910929', '5910929', 'นายวรุฒ ฝั้นหลี', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(266, '6004961', '6004961', 'นายโสภณ รอดกลิ่น', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(267, '61021017', '61021017', 'นายภูเบศน์ อินทร์นุ่มพันธ์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(268, '61021018', '61021018', 'นายสมศักดิ์ ใจกล้า', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(269, '61021019', '61021019', 'นายฉัตรชัย ตรีหิรัญ', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(270, '64031135', '64031135', 'นายราชิน ฟักทิม', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(271, '65071169', '65071169', 'นายสรายุทธ แสงพราว', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(272, '68011240', '68011240', 'นายประเทือง เฉยดี', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(273, '3505114', '3505114', 'นายพลกฤษณ์ ประเสริฐธรรม', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(274, '4810429', '4810429', 'นายอนุรัตน์ จุ้ยพันธุ์', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(275, '5405556', '5405556', 'นายนทีธร สนธิรอต', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(276, '5406560', '5406560', 'นายสนั่น เกษรา', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(277, '5710724', '5710724', 'นายธงชัย ทองมา', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(278, '5808818', '5808818', 'นายวิโรจน์ บุญเพ็ชร', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(279, '5904881', '5904881', 'นายชัยวัฒน์ ศรีเพชร', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(280, '61031025', '61031025', 'นายประพันธ์ หอมพรมมา', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(281, '64011129', '64011129', 'นายจิรวัฒน์ วงษบุญมาก', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(282, '3505110', '3505110', 'นายชัยยะสิทธิ์ ฉลองบุญ', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(283, '3705161', '3705161', 'นายทนงศักดิ์ ม่วงแจ่ม', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(284, '5605636', '5605636', 'นายสุทธิพงศ์ ทิพย์พิชัย', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(285, '5702672', '5702672', 'นายอินทร์ธร การุญ', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(286, '5710721', '5710721', 'นายธนาวุฒิ คะหาญ', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(287, '65101180', '65101180', 'นายธีรภัทร พลสรรค์', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(288, '3405040', '3405040', 'นายมลเฑียร ปั้นจันทร์', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(289, '3601130', '3601130', 'นายบุญธรรม พัดทอง', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(290, '5703679', '5703679', 'นางสาวทัศณีย์ อุ่นธง', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(291, '5706697', '5706697', 'นายธาดา บัวจันอัด', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(292, '5708712', '5708712', 'นายวีระ ทรดี', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(293, '5803750', '5803750', 'นายรุ่งฟ้า รื่นโพธิ์วงษ์', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(294, '63031092', '63031092', 'นายจรัล เติมสิน', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(295, '64111150', '64111150', 'นางสาวอำไพพรรณ หรั่งศรี', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(296, '65021157', '65021157', 'นางสาวบุญยัง ภูสิงห์', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(297, '69011260', '69011260', 'นายวีรภัทร โพธิ์นิล', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00);

-- --------------------------------------------------------

--
-- Table structure for table `formulas`
--

CREATE TABLE `formulas` (
  `id` int(11) NOT NULL,
  `product_id` int(11) DEFAULT NULL,
  `formula_name` varchar(255) NOT NULL DEFAULT 'สูตรมาตรฐาน',
  `ingredient_id` int(11) DEFAULT NULL,
  `quantity_required` decimal(10,3) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `inventory_lots`
--

CREATE TABLE `inventory_lots` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `wh_id` int(11) NOT NULL DEFAULT 0,
  `lot_no` varchar(100) NOT NULL,
  `mfg_date` date NOT NULL,
  `exp_date` date NOT NULL,
  `qty` decimal(15,2) NOT NULL,
  `status` varchar(50) DEFAULT 'Active',
  `remark` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `leave_quotas`
--

CREATE TABLE `leave_quotas` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `year` int(11) NOT NULL,
  `sick_max` int(11) DEFAULT 30 COMMENT 'ลาป่วย',
  `personal_other_max` int(11) DEFAULT 7 COMMENT 'ลากิจรวมลาอื่นๆ',
  `vacation_max` int(11) DEFAULT 6 COMMENT 'พักร้อน',
  `maternity_max` int(11) DEFAULT 120 COMMENT 'ลาคลอด'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `leave_quotas`
--

INSERT INTO `leave_quotas` (`id`, `userid`, `year`, `sick_max`, `personal_other_max`, `vacation_max`, `maternity_max`) VALUES
(1, 'admin', 2026, 30, 7, 6, 120),
(2, '69021262', 2026, 30, 7, 6, 120),
(3, '3403026', 2026, 30, 7, 6, 120),
(4, '3803191', 2026, 30, 7, 6, 120),
(5, '4002269', 2026, 30, 7, 6, 120),
(6, '4201298', 2026, 30, 7, 6, 120),
(7, '4201299', 2026, 30, 7, 6, 120),
(8, '4301332', 2026, 30, 7, 6, 120),
(9, '4602369', 2026, 30, 7, 6, 120),
(10, '5307531', 2026, 30, 7, 6, 120),
(11, '5401539', 2026, 30, 7, 6, 120),
(12, '5402542', 2026, 30, 7, 6, 120),
(13, '5403547', 2026, 30, 7, 6, 120),
(14, '5406557', 2026, 30, 7, 6, 120),
(15, '5408564', 2026, 30, 7, 6, 120),
(16, '5503579', 2026, 30, 7, 6, 120),
(17, '5503581', 2026, 30, 7, 6, 120),
(18, '5607648', 2026, 30, 7, 6, 120),
(19, '5710726', 2026, 30, 7, 6, 120),
(20, '5804755', 2026, 30, 7, 6, 120),
(21, '5805762', 2026, 30, 7, 6, 120),
(22, '5806782', 2026, 30, 7, 6, 120),
(23, '5806784', 2026, 30, 7, 6, 120),
(24, '5807798', 2026, 30, 7, 6, 120),
(25, '5808811', 2026, 30, 7, 6, 120),
(26, '5811847', 2026, 30, 7, 6, 120),
(27, '5902863', 2026, 30, 7, 6, 120),
(28, '5903870', 2026, 30, 7, 6, 120),
(29, '6001937', 2026, 30, 7, 6, 120),
(30, '6006970', 2026, 30, 7, 6, 120),
(31, '6009996', 2026, 30, 7, 6, 120),
(32, '62091073', 2026, 30, 7, 6, 120),
(33, '63031093', 2026, 30, 7, 6, 120),
(34, '64061139', 2026, 30, 7, 6, 120),
(35, '65061164', 2026, 30, 7, 6, 120),
(36, '67021214', 2026, 30, 7, 6, 120),
(37, '68021242', 2026, 30, 7, 6, 120),
(38, '68031243', 2026, 30, 7, 6, 120),
(39, '68031244', 2026, 30, 7, 6, 120),
(40, '68091252', 2026, 30, 7, 6, 120),
(41, '69021261', 2026, 30, 7, 6, 120),
(42, '69031265', 2026, 30, 7, 6, 120),
(43, '3811228', 2026, 30, 7, 6, 120),
(44, '3903237', 2026, 30, 7, 6, 120),
(45, '4001261', 2026, 30, 7, 6, 120),
(46, '4001263', 2026, 30, 7, 6, 120),
(47, '4001267', 2026, 30, 7, 6, 120),
(48, '4004273', 2026, 30, 7, 6, 120),
(49, '4301333', 2026, 30, 7, 6, 120),
(50, '4602371', 2026, 30, 7, 6, 120),
(51, '4802408', 2026, 30, 7, 6, 120),
(52, '4804412', 2026, 30, 7, 6, 120),
(53, '4902441', 2026, 30, 7, 6, 120),
(54, '5205504', 2026, 30, 7, 6, 120),
(55, '5207511', 2026, 30, 7, 6, 120),
(56, '5402543', 2026, 30, 7, 6, 120),
(57, '5403549', 2026, 30, 7, 6, 120),
(58, '5510612', 2026, 30, 7, 6, 120),
(59, '5604631', 2026, 30, 7, 6, 120),
(60, '5612665', 2026, 30, 7, 6, 120),
(61, '5703684', 2026, 30, 7, 6, 120),
(62, '5707709', 2026, 30, 7, 6, 120),
(63, '5802742', 2026, 30, 7, 6, 120),
(64, '5807803', 2026, 30, 7, 6, 120),
(65, '5902858', 2026, 30, 7, 6, 120),
(66, '6002943', 2026, 30, 7, 6, 120),
(67, '6005966', 2026, 30, 7, 6, 120),
(68, '60111004', 2026, 30, 7, 6, 120),
(69, '61061032', 2026, 30, 7, 6, 120),
(70, '62071067', 2026, 30, 7, 6, 120),
(71, '63101113', 2026, 30, 7, 6, 120),
(72, '64111149', 2026, 30, 7, 6, 120),
(73, '65031158', 2026, 30, 7, 6, 120),
(74, '65081172', 2026, 30, 7, 6, 120),
(75, '67021217', 2026, 30, 7, 6, 120),
(76, '68011239', 2026, 30, 7, 6, 120),
(77, '69011259', 2026, 30, 7, 6, 120),
(78, '3505115', 2026, 30, 7, 6, 120),
(79, '3601127', 2026, 30, 7, 6, 120),
(80, '4205313', 2026, 30, 7, 6, 120),
(81, '4604377', 2026, 30, 7, 6, 120),
(82, '4909472', 2026, 30, 7, 6, 120),
(83, '5907900', 2026, 30, 7, 6, 120),
(84, '61041026', 2026, 30, 7, 6, 120),
(85, '65101179', 2026, 30, 7, 6, 120),
(86, '66041194', 2026, 30, 7, 6, 120),
(87, '67021218', 2026, 30, 7, 6, 120),
(88, '67081232', 2026, 30, 7, 6, 120),
(89, '68101253', 2026, 30, 7, 6, 120),
(90, '68111257', 2026, 30, 7, 6, 120),
(91, '3702158', 2026, 30, 7, 6, 120),
(92, '5901854', 2026, 30, 7, 6, 120),
(93, '62111081', 2026, 30, 7, 6, 120),
(94, '65091177', 2026, 30, 7, 6, 120),
(95, '69021263', 2026, 30, 7, 6, 120),
(96, '3707173', 2026, 30, 7, 6, 120),
(97, '4004274', 2026, 30, 7, 6, 120),
(98, '5306524', 2026, 30, 7, 6, 120),
(99, '3404029', 2026, 30, 7, 6, 120),
(100, '3501073', 2026, 30, 7, 6, 120),
(101, '3709181', 2026, 30, 7, 6, 120),
(102, '3709182', 2026, 30, 7, 6, 120),
(103, '3804199', 2026, 30, 7, 6, 120),
(104, '3804203', 2026, 30, 7, 6, 120),
(105, '5702673', 2026, 30, 7, 6, 120),
(106, '5702674', 2026, 30, 7, 6, 120),
(107, '5706695', 2026, 30, 7, 6, 120),
(108, '5706705', 2026, 30, 7, 6, 120),
(109, '5903868', 2026, 30, 7, 6, 120),
(110, '5909917', 2026, 30, 7, 6, 120),
(111, '6004955', 2026, 30, 7, 6, 120),
(112, '6006969', 2026, 30, 7, 6, 120),
(113, '63081105', 2026, 30, 7, 6, 120),
(114, '63111116', 2026, 30, 7, 6, 120),
(115, '65021156', 2026, 30, 7, 6, 120),
(116, '3609151', 2026, 30, 7, 6, 120),
(117, '4210324', 2026, 30, 7, 6, 120),
(118, '4912475', 2026, 30, 7, 6, 120),
(119, '5306525', 2026, 30, 7, 6, 120),
(120, '5907896', 2026, 30, 7, 6, 120),
(121, '62081070', 2026, 30, 7, 6, 120),
(122, '66061200', 2026, 30, 7, 6, 120),
(123, '68061248', 2026, 30, 7, 6, 120),
(124, '69031264', 2026, 30, 7, 6, 120),
(125, '3402024', 2026, 30, 7, 6, 120),
(126, '3501072', 2026, 30, 7, 6, 120),
(127, '3505102', 2026, 30, 7, 6, 120),
(128, '3705166', 2026, 30, 7, 6, 120),
(129, '3901235', 2026, 30, 7, 6, 120),
(130, '4504352', 2026, 30, 7, 6, 120),
(131, '4512367', 2026, 30, 7, 6, 120),
(132, '6009994', 2026, 30, 7, 6, 120),
(133, '3404034', 2026, 30, 7, 6, 120),
(134, '3409055', 2026, 30, 7, 6, 120),
(135, '3907255', 2026, 30, 7, 6, 120),
(136, '4501346', 2026, 30, 7, 6, 120),
(137, '4508359', 2026, 30, 7, 6, 120),
(138, '4904449', 2026, 30, 7, 6, 120),
(139, '5510611', 2026, 30, 7, 6, 120),
(140, '5806767', 2026, 30, 7, 6, 120),
(141, '5907897', 2026, 30, 7, 6, 120),
(142, '61071037', 2026, 30, 7, 6, 120),
(143, '62051049', 2026, 30, 7, 6, 120),
(144, '63011083', 2026, 30, 7, 6, 120),
(145, '63031091', 2026, 30, 7, 6, 120),
(146, '64011126', 2026, 30, 7, 6, 120),
(147, '64021130', 2026, 30, 7, 6, 120),
(148, '64051138', 2026, 30, 7, 6, 120),
(149, '65121185', 2026, 30, 7, 6, 120),
(150, '67011213', 2026, 30, 7, 6, 120),
(151, '67031221', 2026, 30, 7, 6, 120),
(152, '68071249', 2026, 30, 7, 6, 120),
(153, '68071250', 2026, 30, 7, 6, 120),
(154, '68111256', 2026, 30, 7, 6, 120),
(155, '3308014', 2026, 30, 7, 6, 120),
(156, '3709184', 2026, 30, 7, 6, 120),
(157, '3710185', 2026, 30, 7, 6, 120),
(158, '4002270', 2026, 30, 7, 6, 120),
(159, '5005484', 2026, 30, 7, 6, 120),
(160, '5802749', 2026, 30, 7, 6, 120),
(161, '5806771', 2026, 30, 7, 6, 120),
(162, '3801125', 2026, 30, 7, 6, 120),
(163, '3905247', 2026, 30, 7, 6, 120),
(164, '3908256', 2026, 30, 7, 6, 120),
(165, '4004272', 2026, 30, 7, 6, 120),
(166, '4407345', 2026, 30, 7, 6, 120),
(167, '4705394', 2026, 30, 7, 6, 120),
(168, '5411571', 2026, 30, 7, 6, 120),
(169, '5609652', 2026, 30, 7, 6, 120),
(170, '3502082', 2026, 30, 7, 6, 120),
(171, '3504087', 2026, 30, 7, 6, 120),
(172, '3604146', 2026, 30, 7, 6, 120),
(173, '3804198', 2026, 30, 7, 6, 120),
(174, '3809222', 2026, 30, 7, 6, 120),
(175, '3905245', 2026, 30, 7, 6, 120),
(176, '4306335', 2026, 30, 7, 6, 120),
(177, '5006485', 2026, 30, 7, 6, 120),
(178, '5701668', 2026, 30, 7, 6, 120),
(179, '65011153', 2026, 30, 7, 6, 120),
(180, '3401017', 2026, 30, 7, 6, 120),
(181, '3505106', 2026, 30, 7, 6, 120),
(182, '3502084', 2026, 30, 7, 6, 120),
(183, '3805204', 2026, 30, 7, 6, 120),
(184, '4201296', 2026, 30, 7, 6, 120),
(185, '61021015', 2026, 30, 7, 6, 120),
(186, '61071041', 2026, 30, 7, 6, 120),
(187, '62031048', 2026, 30, 7, 6, 120),
(188, '63021087', 2026, 30, 7, 6, 120),
(189, '64011122', 2026, 30, 7, 6, 120),
(190, '64011127', 2026, 30, 7, 6, 120),
(191, '65091176', 2026, 30, 7, 6, 120),
(192, '66041193', 2026, 30, 7, 6, 120),
(193, '68101255', 2026, 30, 7, 6, 120),
(194, '68111258', 2026, 30, 7, 6, 120),
(195, '4709397', 2026, 30, 7, 6, 120),
(196, '3707172', 2026, 30, 7, 6, 120),
(197, '3411061', 2026, 30, 7, 6, 120),
(198, '3611155', 2026, 30, 7, 6, 120),
(199, '3907252', 2026, 30, 7, 6, 120),
(200, '3907254', 2026, 30, 7, 6, 120),
(201, '4008283', 2026, 30, 7, 6, 120),
(202, '3601132', 2026, 30, 7, 6, 120),
(203, '3601140', 2026, 30, 7, 6, 120),
(204, '4205315', 2026, 30, 7, 6, 120),
(205, '4402341', 2026, 30, 7, 6, 120),
(206, '5106494', 2026, 30, 7, 6, 120),
(207, '5107497', 2026, 30, 7, 6, 120),
(208, '5410569', 2026, 30, 7, 6, 120),
(209, '5503582', 2026, 30, 7, 6, 120),
(210, '5511619', 2026, 30, 7, 6, 120),
(211, '5604629', 2026, 30, 7, 6, 120),
(212, '5802748', 2026, 30, 7, 6, 120),
(213, '5804751', 2026, 30, 7, 6, 120),
(214, '62061053', 2026, 30, 7, 6, 120),
(215, '63111120', 2026, 30, 7, 6, 120),
(216, '66061199', 2026, 30, 7, 6, 120),
(217, '67051224', 2026, 30, 7, 6, 120),
(218, '67111235', 2026, 30, 7, 6, 120),
(219, '3601138', 2026, 30, 7, 6, 120),
(220, '3707170', 2026, 30, 7, 6, 120),
(221, '3806209', 2026, 30, 7, 6, 120),
(222, '4301331', 2026, 30, 7, 6, 120),
(223, '4602373', 2026, 30, 7, 6, 120),
(224, '4802409', 2026, 30, 7, 6, 120),
(225, '4907463', 2026, 30, 7, 6, 120),
(226, '4907466', 2026, 30, 7, 6, 120),
(227, '5309536', 2026, 30, 7, 6, 120),
(228, '5505586', 2026, 30, 7, 6, 120),
(229, '5505587', 2026, 30, 7, 6, 120),
(230, '5705694', 2026, 30, 7, 6, 120),
(231, '5710725', 2026, 30, 7, 6, 120),
(232, '5805761', 2026, 30, 7, 6, 120),
(233, '5807797', 2026, 30, 7, 6, 120),
(234, '5811848', 2026, 30, 7, 6, 120),
(235, '5907903', 2026, 30, 7, 6, 120),
(236, '5907909', 2026, 30, 7, 6, 120),
(237, '65011152', 2026, 30, 7, 6, 120),
(238, '65021155', 2026, 30, 7, 6, 120),
(239, '65051159', 2026, 30, 7, 6, 120),
(240, '65061163', 2026, 30, 7, 6, 120),
(241, '65061166', 2026, 30, 7, 6, 120),
(242, '65061167', 2026, 30, 7, 6, 120),
(243, '66021191', 2026, 30, 7, 6, 120),
(244, '66091207', 2026, 30, 7, 6, 120),
(245, '67011212', 2026, 30, 7, 6, 120),
(246, '3901229', 2026, 30, 7, 6, 120),
(247, '3901234', 2026, 30, 7, 6, 120),
(248, '3904242', 2026, 30, 7, 6, 120),
(249, '4001266', 2026, 30, 7, 6, 120),
(250, '4301328', 2026, 30, 7, 6, 120),
(251, '4808425', 2026, 30, 7, 6, 120),
(252, '5002480', 2026, 30, 7, 6, 120),
(253, '5101490', 2026, 30, 7, 6, 120),
(254, '5304516', 2026, 30, 7, 6, 120),
(255, '5604630', 2026, 30, 7, 6, 120),
(256, '5706701', 2026, 30, 7, 6, 120),
(257, '5801739', 2026, 30, 7, 6, 120),
(258, '5804758', 2026, 30, 7, 6, 120),
(259, '5807793', 2026, 30, 7, 6, 120),
(260, '5810835', 2026, 30, 7, 6, 120),
(261, '5812849', 2026, 30, 7, 6, 120),
(262, '5907911', 2026, 30, 7, 6, 120),
(263, '5910929', 2026, 30, 7, 6, 120),
(264, '6004961', 2026, 30, 7, 6, 120),
(265, '61021017', 2026, 30, 7, 6, 120),
(266, '61021018', 2026, 30, 7, 6, 120),
(267, '61021019', 2026, 30, 7, 6, 120),
(268, '64031135', 2026, 30, 7, 6, 120),
(269, '65071169', 2026, 30, 7, 6, 120),
(270, '68011240', 2026, 30, 7, 6, 120),
(271, '3505114', 2026, 30, 7, 6, 120),
(272, '4810429', 2026, 30, 7, 6, 120),
(273, '5405556', 2026, 30, 7, 6, 120),
(274, '5406560', 2026, 30, 7, 6, 120),
(275, '5710724', 2026, 30, 7, 6, 120),
(276, '5808818', 2026, 30, 7, 6, 120),
(277, '5904881', 2026, 30, 7, 6, 120),
(278, '61031025', 2026, 30, 7, 6, 120),
(279, '64011129', 2026, 30, 7, 6, 120),
(280, '3505110', 2026, 30, 7, 6, 120),
(281, '3705161', 2026, 30, 7, 6, 120),
(282, '5605636', 2026, 30, 7, 6, 120),
(283, '5702672', 2026, 30, 7, 6, 120),
(284, '5710721', 2026, 30, 7, 6, 120),
(285, '65101180', 2026, 30, 7, 6, 120),
(286, '3405040', 2026, 30, 7, 6, 120),
(287, '3601130', 2026, 30, 7, 6, 120),
(288, '5703679', 2026, 30, 7, 6, 120),
(289, '5706697', 2026, 30, 7, 6, 120),
(290, '5708712', 2026, 30, 7, 6, 120),
(291, '5803750', 2026, 30, 7, 6, 120),
(292, '63031092', 2026, 30, 7, 6, 120),
(293, '64111150', 2026, 30, 7, 6, 120),
(294, '65021157', 2026, 30, 7, 6, 120),
(295, '69011260', 2026, 30, 7, 6, 120);

-- --------------------------------------------------------

--
-- Table structure for table `leave_records`
--

CREATE TABLE `leave_records` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `start_date` date NOT NULL COMMENT 'วันที่เริ่มลา',
  `end_date` date NOT NULL COMMENT 'วันสิ้นสุดการลา',
  `leave_type` varchar(50) NOT NULL,
  `d` int(11) DEFAULT 0,
  `h` int(11) DEFAULT 0,
  `m` int(11) DEFAULT 0,
  `t` int(11) DEFAULT 0,
  `recorder` varchar(100) DEFAULT NULL,
  `status` enum('Pending','Manager_Approved','Approved','Rejected') NOT NULL DEFAULT 'Pending',
  `created_at` datetime DEFAULT current_timestamp(),
  `reason` text DEFAULT NULL COMMENT 'เหตุผลการลา',
  `attachment` varchar(255) DEFAULT NULL COMMENT 'ไฟล์แนบรูปภาพ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `maintenance_parts_issue`
--

CREATE TABLE `maintenance_parts_issue` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `wh_id` int(11) NOT NULL DEFAULT 0,
  `qty` decimal(10,2) NOT NULL,
  `maintenance_id` int(11) DEFAULT NULL,
  `machine_name` varchar(255) NOT NULL,
  `reason` text DEFAULT NULL,
  `withdrawn_by` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `maintenance_requests`
--

CREATE TABLE `maintenance_requests` (
  `id` int(11) NOT NULL,
  `machine_name` varchar(255) NOT NULL,
  `issue_description` text NOT NULL,
  `priority` enum('Low','Medium','High','Urgent') DEFAULT 'Medium',
  `status` enum('Pending','In_Progress','Completed','Cancelled') DEFAULT 'Pending',
  `requester_name` varchar(100) NOT NULL,
  `userid` varchar(50) DEFAULT NULL,
  `technician_name` varchar(100) DEFAULT NULL,
  `remark` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ot_records`
--

CREATE TABLE `ot_records` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `ot_date` date NOT NULL,
  `ot_1_h` int(11) DEFAULT 0,
  `ot_1_m` int(11) DEFAULT 0,
  `ot_15_h` int(11) DEFAULT 0,
  `ot_15_m` int(11) DEFAULT 0,
  `ot_3_h` int(11) DEFAULT 0,
  `ot_3_m` int(11) DEFAULT 0,
  `shift_fee` int(11) DEFAULT 0,
  `diligence_fee` int(11) DEFAULT 0,
  `recorder` varchar(100) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `status` enum('Pending','Manager_Approved','Approved','Rejected') DEFAULT 'Pending'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `part_issues`
--

CREATE TABLE `part_issues` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `qty` decimal(15,2) NOT NULL,
  `machine_name` varchar(255) NOT NULL,
  `reason` text DEFAULT NULL,
  `issued_by` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payroll_records`
--

CREATE TABLE `payroll_records` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `pay_month` varchar(2) NOT NULL,
  `pay_year` varchar(4) NOT NULL,
  `base_salary` decimal(10,2) DEFAULT 0.00,
  `ot_pay` decimal(10,2) DEFAULT 0.00,
  `leave_deduction` decimal(10,2) DEFAULT 0.00,
  `net_salary` decimal(10,2) DEFAULT 0.00,
  `status` enum('Pending','Paid') DEFAULT 'Pending',
  `processed_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `processed_by` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `pm_schedules`
--

CREATE TABLE `pm_schedules` (
  `id` int(11) NOT NULL,
  `machine_name` varchar(255) NOT NULL,
  `pm_task` text NOT NULL,
  `frequency_days` int(11) NOT NULL,
  `last_pm_date` date NOT NULL,
  `next_pm_date` date NOT NULL,
  `created_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `po_items`
--

CREATE TABLE `po_items` (
  `id` int(11) NOT NULL,
  `po_id` int(11) DEFAULT NULL,
  `item_id` int(11) DEFAULT NULL,
  `quantity` decimal(10,2) DEFAULT NULL,
  `unit_price` decimal(10,2) DEFAULT NULL,
  `status` varchar(50) DEFAULT 'Pending'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `production_orders`
--

CREATE TABLE `production_orders` (
  `id` int(11) NOT NULL,
  `order_no` varchar(50) NOT NULL,
  `product_id` int(11) NOT NULL,
  `formula_name` varchar(255) NOT NULL,
  `target_qty` decimal(10,2) NOT NULL,
  `unit` varchar(50) DEFAULT 'ตัน',
  `production_line` varchar(100) NOT NULL,
  `start_date` date NOT NULL,
  `due_date` date NOT NULL,
  `status` varchar(50) DEFAULT 'Pending',
  `created_by` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `p_code` varchar(20) NOT NULL,
  `p_name` varchar(100) NOT NULL,
  `p_type` varchar(50) NOT NULL,
  `p_unit` varchar(50) NOT NULL DEFAULT 'หน่วย',
  `p_qty` decimal(12,2) NOT NULL DEFAULT 0.00,
  `p_min` decimal(12,2) NOT NULL DEFAULT 0.00,
  `shelf_life_days` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product_costs`
--

CREATE TABLE `product_costs` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `production_order_id` int(11) NOT NULL,
  `total_cost` decimal(15,2) NOT NULL DEFAULT 0.00,
  `cost_per_unit` decimal(15,2) NOT NULL DEFAULT 0.00,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product_formulas`
--

CREATE TABLE `product_formulas` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `formula_name` varchar(255) NOT NULL,
  `created_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `purchase_orders`
--

CREATE TABLE `purchase_orders` (
  `po_id` int(11) NOT NULL,
  `supplier_name` varchar(255) DEFAULT NULL,
  `expected_delivery_date` date DEFAULT NULL,
  `status` varchar(50) DEFAULT 'Pending',
  `payment_status` varchar(50) DEFAULT 'Unpaid',
  `payment_date` date DEFAULT NULL,
  `payment_ref` varchar(100) DEFAULT NULL,
  `payment_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `purchase_requests`
--

CREATE TABLE `purchase_requests` (
  `id` int(11) NOT NULL,
  `pr_no` varchar(50) NOT NULL,
  `item_name` varchar(255) NOT NULL,
  `qty` decimal(10,2) NOT NULL,
  `unit` varchar(50) NOT NULL,
  `reason` text DEFAULT NULL,
  `request_by` varchar(100) NOT NULL,
  `request_dept` varchar(100) NOT NULL,
  `status` varchar(50) DEFAULT 'Pending',
  `approved_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `qa_inbound_logs`
--

CREATE TABLE `qa_inbound_logs` (
  `id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `product_id` int(11) NOT NULL,
  `moisture` decimal(5,2) NOT NULL,
  `visual_check` varchar(50) NOT NULL,
  `qa_status` varchar(50) NOT NULL,
  `remark` text DEFAULT NULL,
  `inspector_name` varchar(100) NOT NULL,
  `inspected_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `qa_inbound_logs`
--

INSERT INTO `qa_inbound_logs` (`id`, `lot_no`, `product_id`, `moisture`, `visual_check`, `qa_status`, `remark`, `inspector_name`, `inspected_at`) VALUES
(1, 'REC-20260428-0011-1137', 1137, 7.50, 'ปกติ (ผ่านเกณฑ์)', 'Approved', '25%', '', '2026-04-28 01:47:10'),
(2, 'REC-20260428-0012-143', 143, 50.00, 'พบเชื้อรา/ชื้นเกิน', 'Rejected', '', '', '2026-04-28 01:58:37'),
(3, 'REC-20260428-0013-1124', 1124, 999.99, 'ปกติ (ผ่านเกณฑ์)', 'Rejected', 'เล็กน้อย', '', '2026-04-28 02:01:02'),
(4, 'REC-20260428-0014-30', 30, 60.00, 'พบเชื้อรา/ชื้นเกิน', 'Rejected', 'ชื้นจัด', '', '2026-04-28 02:19:46'),
(5, 'REC-20260428-0015-1337', 1337, 1.00, 'ปกติ (ผ่านเกณฑ์)', 'Approved', 'ผ่าน', '', '2026-04-28 02:22:55'),
(6, 'REC-20260428-0016-702', 702, 50.00, 'พบเชื้อรา/ชื้นเกิน', 'Rejected', 'ชิ้น', '', '2026-04-28 06:09:20');

-- --------------------------------------------------------

--
-- Table structure for table `qa_inspections`
--

CREATE TABLE `qa_inspections` (
  `qa_id` int(11) NOT NULL,
  `ref_doc` varchar(50) NOT NULL COMMENT 'เลขอ้างอิง เช่น PO-00001 หรือ ทะเบียนรถ',
  `product_id` int(11) NOT NULL COMMENT 'รหัสวัตถุดิบ',
  `moisture_percent` decimal(5,2) NOT NULL COMMENT 'เปอร์เซ็นต์ความชื้น',
  `visual_check` enum('Pass','Fail') NOT NULL COMMENT 'การตรวจกายภาพ',
  `remark` text DEFAULT NULL COMMENT 'หมายเหตุเพิ่มเติม',
  `final_result` enum('Approved','Rejected') NOT NULL COMMENT 'ผลการตัดสิน',
  `inspector` varchar(100) NOT NULL COMMENT 'ผู้ตรวจสอบ',
  `inspected_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `qa_outbound_logs`
--

CREATE TABLE `qa_outbound_logs` (
  `id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `moisture` decimal(5,2) NOT NULL,
  `protein` decimal(5,2) NOT NULL,
  `appearance` varchar(50) NOT NULL,
  `qa_status` varchar(50) NOT NULL,
  `remark` text DEFAULT NULL,
  `inspector_name` varchar(100) NOT NULL,
  `inspected_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `qa_records`
--

CREATE TABLE `qa_records` (
  `id` int(11) NOT NULL,
  `lot_id` int(11) NOT NULL,
  `qa_type` varchar(50) NOT NULL COMMENT 'Inbound or Outbound',
  `status` varchar(50) NOT NULL,
  `remark` text DEFAULT NULL,
  `inspected_by` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sales_items`
--

CREATE TABLE `sales_items` (
  `id` int(11) NOT NULL,
  `sale_id` int(11) DEFAULT NULL,
  `product_id` int(11) DEFAULT NULL,
  `quantity` decimal(10,2) DEFAULT NULL,
  `unit_price` decimal(10,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sales_orders`
--

CREATE TABLE `sales_orders` (
  `sale_id` int(11) NOT NULL,
  `customer_name` varchar(255) DEFAULT NULL,
  `sale_date` date DEFAULT NULL,
  `total_amount` decimal(12,2) DEFAULT 0.00,
  `created_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `cus_id` int(11) DEFAULT NULL,
  `payment_status` enum('Unpaid','Paid','Credit') DEFAULT 'Unpaid',
  `delivery_status` varchar(50) NOT NULL DEFAULT 'Pending',
  `due_date` date DEFAULT NULL,
  `scale_no` varchar(50) DEFAULT NULL COMMENT 'เลขที่ใบตาชั่ง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sales_returns`
--

CREATE TABLE `sales_returns` (
  `id` int(11) NOT NULL,
  `sale_id` int(11) NOT NULL,
  `cus_id` int(11) NOT NULL,
  `return_date` date NOT NULL,
  `total_refund` decimal(15,2) NOT NULL DEFAULT 0.00,
  `reason` text DEFAULT NULL,
  `created_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `scrap_records`
--

CREATE TABLE `scrap_records` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `qty` decimal(15,2) NOT NULL,
  `reason` text NOT NULL,
  `reported_by` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `stock_balances`
--

CREATE TABLE `stock_balances` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `wh_id` int(11) NOT NULL,
  `qty` decimal(15,3) NOT NULL DEFAULT 0.000
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `stock_log`
--

CREATE TABLE `stock_log` (
  `id` int(11) NOT NULL,
  `product_id` int(11) DEFAULT NULL,
  `type` enum('IN','OUT') DEFAULT NULL,
  `qty` decimal(10,2) DEFAULT NULL,
  `from_wh_id` int(11) DEFAULT NULL COMMENT 'เบิก/ย้าย ออกจากคลังไหน',
  `to_wh_id` int(11) DEFAULT NULL COMMENT 'รับเข้า/ย้าย เข้าคลังไหน',
  `reference` varchar(255) DEFAULT NULL,
  `remark` text DEFAULT NULL,
  `action_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `suppliers`
--

CREATE TABLE `suppliers` (
  `id` int(11) NOT NULL,
  `s_name` varchar(255) NOT NULL COMMENT 'ชื่อบริษัท/ร้านค้า',
  `contact_person` varchar(255) DEFAULT NULL COMMENT 'ผู้ติดต่อ',
  `phone` varchar(50) DEFAULT NULL COMMENT 'เบอร์โทรศัพท์',
  `address` text DEFAULT NULL COMMENT 'ที่อยู่',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `supplier_quotes`
--

CREATE TABLE `supplier_quotes` (
  `id` int(11) NOT NULL,
  `item_id` int(11) DEFAULT NULL,
  `supplier_name` varchar(255) DEFAULT NULL,
  `price_quoted` decimal(10,2) DEFAULT NULL,
  `quote_date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `system_logs`
--

CREATE TABLE `system_logs` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL COMMENT 'ใครเป็นคนทำ',
  `username` varchar(255) NOT NULL COMMENT 'ชื่อคนทำ',
  `action_type` enum('INSERT','UPDATE','DELETE','LOGIN') NOT NULL,
  `affected_table` varchar(100) NOT NULL COMMENT 'ตารางที่โดนกระทำ',
  `details` text NOT NULL COMMENT 'รายละเอียดการเปลี่ยนแปลง',
  `ip_address` varchar(45) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `time_attendance`
--

CREATE TABLE `time_attendance` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `work_date` date NOT NULL,
  `clock_in` time DEFAULT NULL,
  `clock_out` time DEFAULT NULL,
  `late_minutes` int(11) DEFAULT 0 COMMENT 'จำนวนนาทีที่มาสาย',
  `remark` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `warehouses`
--

CREATE TABLE `warehouses` (
  `wh_id` int(11) NOT NULL,
  `plant` varchar(50) NOT NULL COMMENT 'โรงงาน 1 หรือ โรงงาน 2',
  `wh_code` varchar(20) NOT NULL,
  `wh_name` varchar(255) NOT NULL,
  `wh_type` varchar(50) NOT NULL COMMENT 'Normal, Hold, Scrap, WIP, Silo'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `warehouses`
--

INSERT INTO `warehouses` (`wh_id`, `plant`, `wh_code`, `wh_name`, `wh_type`) VALUES
(1, 'โรงงาน 1', 'WH1-MAIN', 'คลังสินค้า โรงงาน 1 (พร้อมใช้/พร้อมขาย)', 'Normal'),
(2, 'โรงงาน 1', 'WH1-HOLD', 'คลัง Hold โรงงาน 1 (กักกัน/ห้ามใช้)', 'Hold'),
(3, 'โรงงาน 1', 'WH1-SCRAP', 'คลังของเสียรอขาย โรงงาน 1 (รอขาย/ตั้งสำรอง)', 'Scrap'),
(4, 'โรงงาน 1', 'WH1-DUST', 'คลังฝุ่นสินค้าสำเร็จรูป โรงงาน 1 (รอผลิตใหม่)', 'WIP'),
(5, 'โรงงาน 1', 'WH1-WIPFG', 'คลังสินค้าสำเร็จรูประหว่างผลิต โรงงาน 1 (Bulk/เศษถุง)', 'WIP'),
(6, 'โรงงาน 1', 'S1-A', 'SILO-A', 'Silo'),
(7, 'โรงงาน 1', 'S1-B', 'SILO-B', 'Silo'),
(8, 'โรงงาน 1', 'S1-C', 'SILO-C', 'Silo'),
(9, 'โรงงาน 1', 'S1-D', 'SILO-D', 'Silo'),
(10, 'โรงงาน 1', 'S1-E', 'SILO-E', 'Silo'),
(11, 'โรงงาน 1', 'S1-F', 'SILO-F', 'Silo'),
(12, 'โรงงาน 1', 'S1-G', 'SILO-G', 'Silo'),
(13, 'โรงงาน 1', 'S1-I', 'SILO-I', 'Silo'),
(14, 'โรงงาน 2', 'WH2-MAIN', 'คลังสินค้า โรงงาน 2 (พร้อมใช้/พร้อมขาย)', 'Normal'),
(15, 'โรงงาน 2', 'WH2-HOLD', 'คลัง Hold โรงงาน 2 (กักกัน/ห้ามใช้)', 'Hold'),
(16, 'โรงงาน 2', 'WH2-SCRAP', 'คลังของเสียรอขาย โรงงาน 2 (รอขาย/ตั้งสำรอง)', 'Scrap'),
(17, 'โรงงาน 2', 'WH2-DUST', 'คลังฝุ่นสินค้าสำเร็จรูป โรงงาน 2 (รอผลิตใหม่)', 'WIP'),
(18, 'โรงงาน 2', 'WH2-WIPFG', 'คลังสินค้าสำเร็จรูประหว่างผลิต โรงงาน 2 (Bulk/เศษถุง)', 'WIP'),
(19, 'โรงงาน 2', 'S2-J', 'SILO-J', 'Silo'),
(20, 'โรงงาน 2', 'S2-K', 'SILO-K', 'Silo'),
(21, 'โรงงาน 2', 'S2-L', 'SILO-L', 'Silo'),
(22, 'โรงงาน 2', 'S2-N', 'SILO-N', 'Silo'),
(23, 'โรงงาน 2', 'S2-O', 'SILO-O', 'Silo'),
(24, 'โรงงาน 2', 'S2-P', 'SILO-P', 'Silo'),
(25, 'โรงงาน 2', 'S2-Q', 'SILO-Q', 'Silo'),
(26, 'โรงงาน 2', 'S2-R', 'SILO-R', 'Silo'),
(27, 'โรงงาน 2', 'S2-S', 'SILO-S', 'Silo');

-- --------------------------------------------------------

--
-- Table structure for table `work_shifts`
--

CREATE TABLE `work_shifts` (
  `id` int(11) NOT NULL,
  `shift_name` varchar(100) NOT NULL,
  `start_time` time NOT NULL,
  `end_time` time NOT NULL,
  `grace_period` int(11) DEFAULT 0 COMMENT 'อนุญาตให้เข้าสายได้กี่นาที',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `work_shifts`
--

INSERT INTO `work_shifts` (`id`, `shift_name`, `start_time`, `end_time`, `grace_period`, `created_at`) VALUES
(1, 'กะเช้าปกติ (Office)', '08:00:00', '17:00:00', 15, '2026-04-21 03:31:53');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `announcements`
--
ALTER TABLE `announcements`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `company_holidays`
--
ALTER TABLE `company_holidays`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `holiday_date` (`holiday_date`);

--
-- Indexes for table `credit_requests`
--
ALTER TABLE `credit_requests`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `delivery_orders`
--
ALTER TABLE `delivery_orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `employees`
--
ALTER TABLE `employees`
  ADD PRIMARY KEY (`emp_id`);

--
-- Indexes for table `formulas`
--
ALTER TABLE `formulas`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `inventory_lots`
--
ALTER TABLE `inventory_lots`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `leave_quotas`
--
ALTER TABLE `leave_quotas`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_user_year` (`userid`,`year`);

--
-- Indexes for table `leave_records`
--
ALTER TABLE `leave_records`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `maintenance_parts_issue`
--
ALTER TABLE `maintenance_parts_issue`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `maintenance_requests`
--
ALTER TABLE `maintenance_requests`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ot_records`
--
ALTER TABLE `ot_records`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `part_issues`
--
ALTER TABLE `part_issues`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `payroll_records`
--
ALTER TABLE `payroll_records`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `pm_schedules`
--
ALTER TABLE `pm_schedules`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `po_items`
--
ALTER TABLE `po_items`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `production_orders`
--
ALTER TABLE `production_orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`,`p_code`);

--
-- Indexes for table `product_costs`
--
ALTER TABLE `product_costs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product_formulas`
--
ALTER TABLE `product_formulas`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `purchase_orders`
--
ALTER TABLE `purchase_orders`
  ADD PRIMARY KEY (`po_id`);

--
-- Indexes for table `purchase_requests`
--
ALTER TABLE `purchase_requests`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `qa_inbound_logs`
--
ALTER TABLE `qa_inbound_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `qa_inspections`
--
ALTER TABLE `qa_inspections`
  ADD PRIMARY KEY (`qa_id`);

--
-- Indexes for table `qa_outbound_logs`
--
ALTER TABLE `qa_outbound_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `qa_records`
--
ALTER TABLE `qa_records`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sales_items`
--
ALTER TABLE `sales_items`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sales_orders`
--
ALTER TABLE `sales_orders`
  ADD PRIMARY KEY (`sale_id`);

--
-- Indexes for table `sales_returns`
--
ALTER TABLE `sales_returns`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `scrap_records`
--
ALTER TABLE `scrap_records`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `stock_balances`
--
ALTER TABLE `stock_balances`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_stock` (`product_id`,`wh_id`);

--
-- Indexes for table `stock_log`
--
ALTER TABLE `stock_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `suppliers`
--
ALTER TABLE `suppliers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `supplier_quotes`
--
ALTER TABLE `supplier_quotes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `system_logs`
--
ALTER TABLE `system_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `time_attendance`
--
ALTER TABLE `time_attendance`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_scan` (`userid`,`work_date`);

--
-- Indexes for table `warehouses`
--
ALTER TABLE `warehouses`
  ADD PRIMARY KEY (`wh_id`),
  ADD UNIQUE KEY `wh_code` (`wh_code`);

--
-- Indexes for table `work_shifts`
--
ALTER TABLE `work_shifts`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `announcements`
--
ALTER TABLE `announcements`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `company_holidays`
--
ALTER TABLE `company_holidays`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `credit_requests`
--
ALTER TABLE `credit_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `customers`
--
ALTER TABLE `customers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `delivery_orders`
--
ALTER TABLE `delivery_orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `employees`
--
ALTER TABLE `employees`
  MODIFY `emp_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=304;

--
-- AUTO_INCREMENT for table `formulas`
--
ALTER TABLE `formulas`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `inventory_lots`
--
ALTER TABLE `inventory_lots`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `leave_quotas`
--
ALTER TABLE `leave_quotas`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=296;

--
-- AUTO_INCREMENT for table `leave_records`
--
ALTER TABLE `leave_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `maintenance_parts_issue`
--
ALTER TABLE `maintenance_parts_issue`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `maintenance_requests`
--
ALTER TABLE `maintenance_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `ot_records`
--
ALTER TABLE `ot_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT for table `part_issues`
--
ALTER TABLE `part_issues`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `payroll_records`
--
ALTER TABLE `payroll_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `pm_schedules`
--
ALTER TABLE `pm_schedules`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `po_items`
--
ALTER TABLE `po_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `production_orders`
--
ALTER TABLE `production_orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1404;

--
-- AUTO_INCREMENT for table `product_costs`
--
ALTER TABLE `product_costs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `product_formulas`
--
ALTER TABLE `product_formulas`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `purchase_orders`
--
ALTER TABLE `purchase_orders`
  MODIFY `po_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `purchase_requests`
--
ALTER TABLE `purchase_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `qa_inbound_logs`
--
ALTER TABLE `qa_inbound_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `qa_inspections`
--
ALTER TABLE `qa_inspections`
  MODIFY `qa_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `qa_outbound_logs`
--
ALTER TABLE `qa_outbound_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `qa_records`
--
ALTER TABLE `qa_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `sales_items`
--
ALTER TABLE `sales_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `sales_orders`
--
ALTER TABLE `sales_orders`
  MODIFY `sale_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `sales_returns`
--
ALTER TABLE `sales_returns`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `scrap_records`
--
ALTER TABLE `scrap_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `stock_balances`
--
ALTER TABLE `stock_balances`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `stock_log`
--
ALTER TABLE `stock_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=103;

--
-- AUTO_INCREMENT for table `suppliers`
--
ALTER TABLE `suppliers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `supplier_quotes`
--
ALTER TABLE `supplier_quotes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `system_logs`
--
ALTER TABLE `system_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=183;

--
-- AUTO_INCREMENT for table `time_attendance`
--
ALTER TABLE `time_attendance`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `warehouses`
--
ALTER TABLE `warehouses`
  MODIFY `wh_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT for table `work_shifts`
--
ALTER TABLE `work_shifts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
