-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 28, 2026 at 11:26 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `company_inventory`
--

-- --------------------------------------------------------

--
-- Table structure for table `announcements`
--

CREATE TABLE `announcements` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `announcement_date` date NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `company_holidays`
--

CREATE TABLE `company_holidays` (
  `id` int(11) NOT NULL,
  `holiday_date` date NOT NULL,
  `holiday_name` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `company_holidays`
--

INSERT INTO `company_holidays` (`id`, `holiday_date`, `holiday_name`, `created_at`) VALUES
(1, '2026-05-01', 'วันแรงงานแห่งชาติ', '2026-04-21 01:46:12'),
(2, '2026-06-03', 'วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าฯ พระบรมราชินี', '2026-04-21 01:47:52'),
(3, '2026-07-28', 'วันเฉลิมพระชนมพรรษา พระบาทสมเด็จพระปรเมนทรรามาธิบดีศรีสินทรมหาวชิราลงกรณพระวชิรเกล้าเจ้าอยู่หัว (รัชกาลที่ 10)', '2026-04-21 01:52:07'),
(4, '2026-08-12', 'วันแม่แห่งชาติ', '2026-04-21 01:52:50'),
(5, '2026-10-13', 'วันนวมินทรมหาราช', '2026-04-21 01:54:00'),
(6, '2026-10-23', 'วันปิยมหาราช', '2026-04-21 01:54:45'),
(7, '2026-12-05', 'วันพ่อแห่งชาติ', '2026-04-21 01:55:30'),
(8, '2026-12-31', 'วันปีใหม่', '2026-04-21 01:55:50'),
(9, '2026-01-01', 'วันปีใหม่', '2026-04-21 02:00:45'),
(10, '2026-02-17', 'วันตรุษจีน', '2026-04-21 02:01:30'),
(11, '2026-03-03', 'วันมาฆบูชา', '2026-04-21 02:02:16'),
(12, '2026-04-13', 'วันสงกรานต์', '2026-04-21 02:02:59'),
(13, '2026-04-14', 'วันสงกรานต์', '2026-04-21 02:03:06'),
(14, '2026-04-15', 'วันสงกรานต์', '2026-04-21 02:03:10');

-- --------------------------------------------------------

--
-- Table structure for table `credit_requests`
--

CREATE TABLE `credit_requests` (
  `id` int(11) NOT NULL,
  `customer_id` int(11) NOT NULL,
  `requested_limit` decimal(15,2) NOT NULL,
  `reason` text DEFAULT NULL,
  `status` varchar(50) DEFAULT 'Pending',
  `requested_by` varchar(100) DEFAULT NULL,
  `approved_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `credit_requests`
--

INSERT INTO `credit_requests` (`id`, `customer_id`, `requested_limit`, `reason`, `status`, `requested_by`, `approved_by`, `created_at`) VALUES
(1, 2, 1000000.00, NULL, 'Approved', ' (ระบบจำลอง)', '', '2026-04-27 08:39:59'),
(2, 2, 1111.00, NULL, 'Rejected', ' (ระบบจำลอง)', '', '2026-04-28 07:57:23'),
(3, 2, 2.00, NULL, 'Rejected', ' (ระบบจำลอง)', '', '2026-04-28 08:06:52'),
(4, 2, 4500000.00, NULL, 'Approved', ' (ระบบจำลอง)', '', '2026-04-28 08:12:59');

-- --------------------------------------------------------

--
-- Table structure for table `customers`
--

CREATE TABLE `customers` (
  `id` int(11) NOT NULL,
  `cus_name` varchar(255) NOT NULL,
  `cus_address` text DEFAULT NULL,
  `cus_tel` varchar(50) DEFAULT NULL,
  `cus_tax_id` varchar(20) DEFAULT NULL,
  `credit_limit` decimal(15,2) DEFAULT 0.00,
  `credit_term` int(11) DEFAULT 0 COMMENT 'จำนวนวันให้เครดิต',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `customers`
--

INSERT INTO `customers` (`id`, `cus_name`, `cus_address`, `cus_tel`, `cus_tax_id`, `credit_limit`, `credit_term`, `created_at`) VALUES
(2, 'บจก. Test jigjig', 'นนทบุรี', '0922639172', '0123456789111', 4500000.00, 10, '2026-04-27 04:30:55');

-- --------------------------------------------------------

--
-- Table structure for table `employees`
--

CREATE TABLE `employees` (
  `emp_id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `role` varchar(20) NOT NULL,
  `dept` varchar(100) NOT NULL,
  `shift_id` int(11) DEFAULT NULL,
  `base_salary` decimal(10,2) NOT NULL DEFAULT 0.00,
  `status` varchar(20) NOT NULL DEFAULT 'Active',
  `bank_account` varchar(20) DEFAULT NULL,
  `salary` decimal(10,2) DEFAULT 0.00
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `employees`
--

INSERT INTO `employees` (`emp_id`, `userid`, `password`, `username`, `role`, `dept`, `shift_id`, `base_salary`, `status`, `bank_account`, `salary`) VALUES
(1, 'admin', '$2y$10$Q8WtPORd.DukYtumnCqsTeds742J5ObzH3lZkrD8AoLAfBH8RuWD6', '', 'ADMIN', '', NULL, 0.00, 'Active', NULL, 0.00),
(4, '69021262', '$2y$10$kWEkE78LDh11d3Iy3Uvnue8D6wFv.RcNKCVoj5peAyFo4ksDqG72m', 'นายสุทธิเดช สุนทรโภคิน', 'USER', 'แผนกคอมพิวเตอร์', NULL, 0.00, 'Active', '', 0.00),
(5, '3403026', '3403026', 'นายวินัย พิลึก', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(6, '3803191', '3803191', 'นายสาคร เสามั่น', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(7, '4002269', '4002269', 'นายเพ็ญรุ่ง มั่นช่วยวงศ์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(8, '4201298', '4201298', 'นายไกรวุฒิ บัวบาน', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(9, '4201299', '4201299', 'นายกติยะ เสามั่น', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(10, '4301332', '4301332', 'นายกมล สิทธิพล', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(11, '4602369', '4602369', 'นายประชัน สุวรรณพันธ์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(12, '5307531', '5307531', 'นายประทีป อ่อนโชน', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(13, '5401539', '5401539', 'นายอนุรักษ์ อ่วมอินทร์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(14, '5402542', '5402542', 'นายสุเพชร์ แขกแพ', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(15, '5403547', '5403547', 'นายทองไทย ไขแสงจันทร์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(16, '5406557', '5406557', 'นายสาธิต บุญรอด', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(17, '5408564', '5408564', 'นายเอกพงษ์ อาจคงหาญ', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(18, '5503579', '5503579', 'นายสุธาเทพ คำสาย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(19, '5503581', '5503581', 'นายฉลอง หว่างกลาง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(20, '5607648', '5607648', 'นายสิริพงษ์ พงษ์ประเสริฐ', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(21, '5710726', '5710726', 'นายอิทธิพงษ์ ก๋งแก้ว', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(22, '5804755', '5804755', 'นายจักรกฤช สืบสาย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(23, '5805762', '5805762', 'นายนิรุฒ ศรีคร้าม', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(24, '5806782', '5806782', 'นายสาโรช สืบสาย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(25, '5806784', '5806784', 'นายรัชพล ราภาศิริ', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(26, '5807798', '5807798', 'นายสุทธิรักษ์ รอบรู้', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(27, '5808811', '5808811', 'นายธนา สิงหะภูกาม', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(28, '5811847', '5811847', 'นายสุนทร บุญประโคน', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(29, '5902863', '$2y$10$t7Yd0cOu1B5chNB/PGbkv.m2ed8YrQCVR8qWmMaZpJ2drrs1R6cFG', 'นายราชัญ เลื่อนลอย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(30, '5903870', '5903870', 'นายพิสิฏฐ์ กรุดไทย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(31, '6001937', '6001937', 'นายอัษฎา ผลพิบูลย์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(32, '6006970', '6006970', 'นายทรงพล จรูญชนม์', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(33, '6009996', '6009996', 'นายทรงศักดิ์ คล้ายคลึง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(34, '62091073', '62091073', 'นายธวัชชัย ละอองศรี', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(35, '63031093', '63031093', 'นายอนุสรณ์ เจ๊กรวย', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(36, '64061139', '64061139', 'นายจิรศักดิ์ บัวฝรั่ง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(37, '65061164', '65061164', 'นายสุรชัย ฟักหอม', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(38, '67021214', '67021214', 'นายทรัพย์อนันต์ แซ่เฮ้ง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(39, '68021242', '68021242', 'นายคมกฤษ รอชัยกุล', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(40, '68031243', '68031243', 'นายศราวุฒ สิงห์สกุล', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(41, '68031244', '68031244', 'นายนัฐวัฒน์ เมืองนก', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(42, '68091252', '68091252', 'นายบรรเทิง ปั้นเกี้ยว', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(43, '69021261', '69021261', 'นายณัฐวรรธน์ อินยัง', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(44, '69031265', '69031265', 'นายนพรัตน์ ทองบุญเย็น', 'USER', 'แผนกผลิต 1', NULL, 0.00, 'Active', NULL, 0.00),
(45, '3811228', '3811228', 'นายปิติ กรุณามัยพันธ์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(46, '3903237', '3903237', 'นายกรชัยวัส พานแก้ว', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(47, '4001261', '4001261', 'นายจารึก นามนิล', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(48, '4001263', '4001263', 'นายสังเวียน บุญรอด', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(49, '4001267', '4001267', 'นาย เฉลิมชนม์ ทองยศ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(50, '4004273', '4004273', 'นายวิยดา วัฒนจรูญโรจน์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(51, '4301333', '4301333', 'นายแดง ค่ำคูณ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(52, '4602371', '4602371', 'นายพิเชษฐ เนตรพะเนาว์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(53, '4802408', '4802408', 'นายสกลเดช ศรีปิตา', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(54, '4804412', '4804412', 'นายอดิเรก คำภีร์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(55, '4902441', '4902441', 'นายทักษิณ ศรีคุ้ม', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(56, '5205504', '5205504', 'นายอภิชาติ วันดี', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(57, '5207511', '5207511', 'นายธีระพงษ์ นิ่มอนงค์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(58, '5402543', '5402543', 'นายวินัย จูพล', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(59, '5403549', '5403549', 'นายนิคม เขื่อนสันเที๊ยะ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(60, '5510612', '5510612', 'นายจริญ ดิสผล', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(61, '5604631', '5604631', 'นายอำพล จำง่าย', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(62, '5612665', '5612665', 'นายระวี อ่างคำ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(63, '5703684', '5703684', 'นายวสันต์ ใหญ่ยงค์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(64, '5707709', '5707709', 'นายตฤณ ศรีจันทร์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(65, '5802742', '$2y$10$xg6dTUXip4QUsJloJwBUeeLrM9ar7LlQ3jABDwk4wu..A8KN7yeXi', 'นายถาวร จูพล', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(66, '5807803', '5807803', 'นายจิราภาส ดวงใจ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(67, '5902858', '5902858', 'นายสมโภชน์ เชี่ยวชาญ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(68, '6002943', '6002943', 'นายธีรพงศ์ ประยงค์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(69, '6005966', '6005966', 'นายนที คำเอก', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(70, '60111004', '60111004', 'นายสุรชัย สิมตะมะ', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(71, '61061032', '61061032', 'นายลิขิต ศรีคร้าม', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(72, '62071067', '62071067', 'นายวราวุฒิ บุตรเขียว', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(73, '63101113', '63101113', 'นายสมพงษ์ วงษ์ละคร', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(74, '64111149', '64111149', 'นายศราวุฒิ นาคสิทธิพันธุ์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(75, '65031158', '65031158', 'นายพิพัฒน์ แสงสุริยา', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(76, '65081172', '65081172', 'นายเจียง ขานยา', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(77, '67021217', '67021217', 'นายสิทธิศักดิ์ เกตุพุก', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(78, '68011239', '68011239', 'นายถนัด พิมพ์กลาง', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(79, '69011259', '69011259', 'นายหนูนา สิงห์นันต์', 'USER', 'แผนกคลังสินค้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(80, '3505115', '3505115', 'นายปรีชา นาคสิทธิพันธุ์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(81, '3601127', '3601127', 'นายวิโรจน์ สิงหา', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(82, '4205313', '4205313', 'นายฉลาด ราชวงษ์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(83, '4604377', '$2y$10$DYjP04AVdxIcUS9haXgFbu.2ZmrsWcs6DYnZp.Z1n.82HAk5.uFSS', 'นายเสรี สุวาวัลย์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(84, '4909472', '4909472', 'นายนพดล สังข์ภิรมย์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(85, '5907900', '5907900', 'นายชัยวัฒน์ จิปอมจา', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(86, '61041026', '61041026', 'นายสายชล สกุลดี', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(87, '65101179', '65101179', 'นายทวีศักดิ์ คะหาญ', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(88, '66041194', '66041194', 'นายไชยรัตน์ แจ้งสว่าง', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(89, '67021218', '67021218', 'นายมณฑล ล่วงลือ', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(90, '67081232', '67081232', 'นายชูเดช อนุรักษ์', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(91, '68101253', '68101253', 'นายวชิรวิทย์ ยิ้มพราย', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(92, '68111257', '68111257', 'นายประสิทธิ์ พันธ์ศรี', 'USER', 'แผนกซ่อมบำรุง 1', NULL, 0.00, 'Active', NULL, 0.00),
(93, '3702158', '3702158', 'นายกังวาน ภูริเดชา', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(94, '5901854', '5901854', 'นายศิวะพล สันทาลุนัย', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(95, '62111081', '62111081', 'นายจักรกฤษณ์ อินทรโชติ', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(96, '65091177', '65091177', 'นายณัฐวุฒิ ปั้นจันทร์', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(97, '69021263', '69021263', 'นายพุฒิเมธ ชมวงษ์', 'USER', 'แผนกไฟฟ้า 1', NULL, 0.00, 'Active', NULL, 0.00),
(98, '3707173', '3707173', 'นางสาวชลธิชา ชัดใจ', 'USER', 'ฝ่ายวิชาการ', NULL, 0.00, 'Active', NULL, 0.00),
(99, '4004274', '4004274', 'นางจันทร์จิรา อินทรา', 'USER', 'ฝ่ายวิชาการ', NULL, 0.00, 'Active', NULL, 0.00),
(100, '5306524', '5306524', 'นายเชี่ยวชาญ เพ็ชรนิล', 'USER', 'ฝ่ายวิชาการ', NULL, 0.00, 'Active', NULL, 0.00),
(101, '3404029', '3404029', 'นายสุจิน จันทร์เกตุ', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(102, '3501073', '3501073', 'นายมานะ จันทร์ตรี', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(103, '3709181', '3709181', 'นายโสภณ แสงซอน', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(104, '3709182', '3709182', 'นายสถาพร ร้อยแก้ว', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(105, '3804199', '3804199', 'นายวิรัตน์ อุ่นธง', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(106, '3804203', '3804203', 'นายประสิทธิ์ ถุงพุดซา', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(107, '5702673', '$2y$10$IR7CZnaNCOVwwmTKROtsR.DaiLS1a9t1pxOVzU4kjnRMxwYr9HpYC', 'นางสาวศิวพร เฉยดี', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(108, '5702674', '5702674', 'นางสาวสิริพิชชา แก้วกุล', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(109, '5706695', '5706695', 'นายนิราช จันทร์สุวรรณ', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(110, '5706705', '5706705', 'นายอำนาจ ภักดีนิมิตร', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(111, '5903868', '5903868', 'นายจำนงค์ ชูศรีจันทร์', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(112, '5909917', '5909917', 'นายณัฐิวุฒิ กาฬภักดี', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(113, '6004955', '6004955', 'นายณัฐสิทธิ์ อุตมกูล', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(114, '6006969', '6006969', 'นายพงศ์ศิริ รอดมนเฑียร', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(115, '63081105', '63081105', 'นายณัฐวุฒิ เพียรสุขเหลือ', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(116, '63111116', '63111116', 'นายชาคร จันทร์แก้ว', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(117, '65021156', '65021156', 'นายเมธี ภูกัน', 'USER', 'แผนก QA', NULL, 0.00, 'Active', NULL, 0.00),
(118, '3609151', '3609151', 'นายอิสเรศ ไตรยวงศ์', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(119, '4210324', '4210324', 'นายอนุวัฒน์ บุญธรรม', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(120, '4912475', '4912475', 'นายคูณ พานนนท์', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(121, '5306525', '5306525', 'นายธรรมรัตน์ แมลงภู่', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(122, '5907896', '5907896', 'นายชาญชัย ไหลหาโคตร', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(123, '62081070', '62081070', 'นายนนทรัตน์ แช่มรวย', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(124, '66061200', '66061200', 'นายสิทธิศักดิ์ อ่อนคำมา', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(125, '68061248', '68061248', 'นายษรชัย โคตฆ์สม', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(126, '69031264', '69031264', 'นายชายนนท์ ใจเที่ยงธรรม', 'USER', 'แผนก P&M - 1', NULL, 0.00, 'Active', NULL, 0.00),
(127, '3402024', '3402024', 'นางสาววรรณวิมล รุ่งโรจน์พานิช', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(128, '3501072', '3501072', 'นางปิยะวรรณ โป๊พัว', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(129, '3505102', '3505102', 'นางกฤษฎี ยังโหมด', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(130, '3705166', '3705166', 'นางสาวนันทยา แดงศรี', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(131, '3901235', '3901235', 'นางสิริลักษณ์ เม่นสุวรรณ์', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(132, '4504352', '4504352', 'นางอารีลักษณ์ บุญธรรม', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(133, '4512367', '4512367', 'นางสาวกาญจนา จรูญชนม์', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(134, '6009994', '6009994', 'นางสาวชลธิชา ปั้นรูป', 'USER', 'แผนก QC', NULL, 0.00, 'Active', NULL, 0.00),
(135, '3404034', '3404034', 'นายโชติ กสิวัฒน์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(136, '3409055', '3409055', 'นายบงกาญจน์ กาญจนกิจโสภณ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(137, '3907255', '3907255', 'นางยุพเยาว์ ม่วงแจ่ม', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(138, '4501346', '4501346', 'นายธานี เจนคุรุกิจ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(139, '4508359', '4508359', 'นายสุรศักดิ์ บูรณศิรินทร์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(140, '4904449', '4904449', 'นายเชิดศักดิ์ มางิ้ว', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(141, '5510611', '$2y$10$e27au925P2qKo9tjnHk26.DAY7rHF4nR4S6YWQl7axGzucN3lnLGu', 'นางสาวมิตชิตา สิทธิเจริญ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(142, '5806767', '5806767', 'นายศาสตรา นาคาโอก้า', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(143, '5907897', '5907897', 'นายวชิรเมษฐ์ โชติศิวัชโตบุญ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(144, '61071037', '61071037', 'นายวราสิทธิ์ อบรม', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(145, '62051049', '62051049', 'นางสาวศิรินทิพย์ วงษ์กรวด', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(146, '63011083', '63011083', 'นายนฤทธิ์ อุดมวงค์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(147, '63031091', '63031091', 'นายภูมินทร์ ชูเทียน', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(148, '64011126', '64011126', 'นางสาวณัฐวรรณ คงกระพัน', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(149, '64021130', '64021130', 'นางสาวพรไพลิน ทองนวล', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(150, '64051138', '64051138', 'นางสาวณัฐกานต์ นิลชัย', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(151, '65121185', '65121185', 'นายรัฐพงศ์ จันทวาลย์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(152, '67011213', '67011213', 'นางสาวอริสรา สุดตา', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(153, '67031221', '67031221', 'นายธนาดล ศรีโนนสูง', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(154, '68071249', '68071249', 'นายอภิสิทธิ์ สุขเสาร์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(155, '68071250', '68071250', 'นายสิทธิชัย เทวโรจน์', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(156, '68111256', '68111256', 'นายชัยวัฒน์ จันทรสมบัติ', 'USER', 'ฝ่ายขาย', NULL, 0.00, 'Active', NULL, 0.00),
(157, '3308014', '3308014', 'นางสาวสุดา ตติยวงศ์', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(158, '3709184', '3709184', 'นายรัตนชัย ธูปกระแจะ', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(159, '3710185', '3710185', 'นางรพีพรรณ คงดั่น', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(160, '4002270', '4002270', 'นางมณีรัตน์ คงทน', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(161, '5005484', '5005484', 'นางกรรณิการ์ ช่างคิด', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(162, '5802749', '$2y$10$y5WsZ4F2p7iGkOcjkL.nxumG8HzfPeSGHjJrbUT7U3nD/i.yj4R4y', 'นางจุฑามาส สนธิรอด', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(163, '5806771', '5806771', 'นายอนันตชัย ศักดิ์ชัยเจริญกุล', 'USER', 'ฝ่ายจัดซื้อ', NULL, 0.00, 'Active', NULL, 0.00),
(164, '3801125', '3801125', 'นางสาว ภรพัส คล้ายคลึง', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(165, '3905247', '3905247', 'นางสาวสายหยุด จันทร์ปาน', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(166, '3908256', '$2y$10$zirxAuyKjUcv/pRiOZIjvuKMkzfCw1xRufzhGF4S1GbqFzVWZPY5O', 'นางอรุณี แยบกระโทก', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(167, '4004272', '4004272', 'นางนงคราญ เรียนรอบกิจ', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(168, '4407345', '4407345', 'นางนันทพร ลังการ์พินธุ์', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(169, '4705394', '4705394', 'นางสาวนภาพร หริญบูรณานนท์', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(170, '5411571', '5411571', 'นางสาวกรรณิกา วงศ์อุตร', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(171, '5609652', '5609652', 'นางสาวจันทร์เพ็ญ เกิดผล', 'USER', 'ฝ่ายบัญชี', NULL, 0.00, 'Active', NULL, 0.00),
(172, '3502082', '3502082', 'นางสาวพวงเพ็ญ ชมทะเล', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(173, '3504087', '3504087', 'นายสุรินทร์ เลิศสมสกุลชัย', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(174, '3604146', '3604146', 'นางสาวจุฑามาศ แก้วหาวงศ์', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(175, '3804198', '3804198', 'นางสาวสุวรรณี ฉิ่งทอง', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(176, '3809222', '3809222', 'นางจารุพร ฉมังหัตถพงศ์', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(177, '3905245', '3905245', 'นางสาวบุญนาค วุฒิธาดา', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(178, '4306335', '4306335', 'นายสุนทร นิลสันเทียะ', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(179, '5006485', '5006485', 'นางสรรสิริ วันดี', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(180, '5701668', '5701668', 'นางสาวณัฐพัชร์ กนิษฐา', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(181, '65011153', '65011153', 'นางสาวกิดติญาภัท ดวงใจ', 'USER', 'ฝ่ายสินเชื่อ', NULL, 0.00, 'Active', NULL, 0.00),
(182, '3401017', '3401017', 'นางสาววราภรณ์ มารศรี', 'USER', 'ฝ่ายการเงิน', NULL, 0.00, 'Active', NULL, 0.00),
(183, '3505106', '3505106', 'นางสาวธัญพร สุรินทร์', 'USER', 'ฝ่ายการเงิน', NULL, 0.00, 'Active', NULL, 0.00),
(184, '3502084', '$2y$10$RrY3s2VvgViksx/XUDvt5Ocf/BrnBaY9ocUhZ/8eeolTIkCMAo3o.', 'นายสุขสันติ กล่ำแดง', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(185, '3805204', '$2y$10$JuoGrSYbIYNTNB22djLvM.S9ixUst9FuM7ss/oAThDf8hV.PnfTxC', 'นางพูลสุข อินทรโชติ', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(186, '4201296', '4201296', 'นายบุญมี ทะนาไธสง', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(187, '61021015', '61021015', 'นายสมยศ เม่นสุวรรณ์', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(188, '61071041', '61071041', 'นายมานพ ศรีวารี', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(189, '62031048', '62031048', 'นายอภิชิต เต็มตาวงษ์', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(190, '63021087', '63021087', 'นางสาวสุนีย์ หอมกระโทก', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(191, '64011122', '64011122', 'นายแจ้ง สืบวงษ์', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(192, '64011127', '64011127', 'นายศิวดล ทองสว่าง', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(193, '65091176', '65091176', 'นายกรด เวียนเปะ', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(194, '66041193', '66041193', 'นางสาวพิชญาพัชญ์ อู๋ปั๋น', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(195, '68101255', '68101255', 'นายพนารักษ์ สิมมาลา', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(196, '68111258', '68111258', 'นายนพรัตน์ ปลอดภัย', 'USER', 'ฝ่าย HR', NULL, 0.00, 'Active', NULL, 0.00),
(197, '4709397', '4709397', 'นายสุทธิชัย ศักดิ์ชัยเจริญกุล', 'USER', 'ฝ่ายงานวางแผน', NULL, 0.00, 'Active', NULL, 0.00),
(198, '3707172', '3707172', 'นายคมสันต์ ศิริโสภณ', 'USER', 'แผนกคอมพิวเตอร์', NULL, 0.00, 'Active', NULL, 0.00),
(199, '3411061', '3411061', 'นางสมพร สองจันทร์', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(200, '3611155', '3611155', 'นางสาวกุศล คงเหล่', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(201, '3907252', '3907252', 'นางวันเพ็ญ โพธิ์พันธุ์', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(202, '3907254', '3907254', 'นางสุมาลี ทะนาไธสง', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(203, '4008283', '4008283', 'นางเรณู เพไร', 'USER', 'บัญชี - ท็อปธุรกิจ', NULL, 0.00, 'Active', NULL, 0.00),
(204, '3601132', '3601132', 'นายจำลอง จุมจวง', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(205, '3601140', '3601140', 'นายอำนวย จักษุกัน', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(206, '4205315', '4205315', 'นายสถาพร มินตาไพสิฐ', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(207, '4402341', '4402341', 'นายมานพ พานแก้ว', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(208, '5106494', '5106494', 'นายธนพงศ์ ยิ้มใหญ่หลวง', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(209, '5107497', '5107497', 'นายน้อม ใจดี', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(210, '5410569', '5410569', 'นายวิโรจน์ ชมแค', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(211, '5503582', '5503582', 'นายยอดชาย ฟุ้งสุวรรณ', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(212, '5511619', '5511619', 'นายสมบูรณ์ โตเจริญวิวัฒน์', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(213, '5604629', '5604629', 'นายฉัตรชัย เพ็ชรเรือง', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(214, '5802748', '5802748', 'นายปราโมทย์ นุชอุดม', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(215, '5804751', '5804751', 'นายสมบัติ กลิ่นกลัด', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(216, '62061053', '62061053', 'นายวิชญ์พล เพ็ชรเรือง', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(217, '63111120', '63111120', 'นายทองเทพ น้อยไทรวัน', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(218, '66061199', '66061199', 'นายรัชพล โสประดิษฐ์', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(219, '67051224', '67051224', 'นายศรัณย์ อาษา', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(220, '67111235', '67111235', 'นายมนตรี อาจสาลี', 'USER', 'ผลิตอาหารสัตว์น้ำ', NULL, 0.00, 'Active', NULL, 0.00),
(221, '3601138', '3601138', 'นายวิเชียร ภูผา', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(222, '3707170', '3707170', 'นายมนตรี นรบุตร', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(223, '3806209', '3806209', 'นายวิเชียร สุริยา', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(224, '4301331', '4301331', 'นายถนอม ไม้เลิศ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(225, '4602373', '4602373', 'นายรุ่ง ทองคำ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(226, '4802409', '4802409', 'นายอนุศิษฎ์ บุตรดางาม', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(227, '4907463', '4907463', 'นายธนาพร ทักษ์อรุณกุล', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(228, '4907466', '4907466', 'นายจารึก โมราชาติ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(229, '5309536', '5309536', 'นายขวัญชัย อุปเงิน', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(230, '5505586', '5505586', 'นายเดือน ทองสิงห์', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(231, '5505587', '5505587', 'นายรุ่งสิริ สัตย์ซื่อ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(232, '5705694', '5705694', 'นายยอดชาย เฉลิมหมู่', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(233, '5710725', '5710725', 'นายองอาจ ไชยลังกา', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(234, '5805761', '5805761', 'นายพงษ์ศิริ ปานดี', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(235, '5807797', '5807797', 'นายวชิระ ศรีพุฒ', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(236, '5811848', '5811848', 'นายวิชาญ กาละมัญดี', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(237, '5907903', '5907903', 'นายจิรานุวัฒน์ แมลงภู่', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(238, '5907909', '5907909', 'นายไกรษร บุญดี', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(239, '65011152', '65011152', 'นายเสน่ห์ จักษุกัน', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(240, '65021155', '65021155', 'นายอนุพงษ์ อ่วมอินทร์', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(241, '65051159', '65051159', 'นายธนพัฒน์ อาดสะลาด', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(242, '65061163', '65061163', 'นายนที พานแก้ว', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(243, '65061166', '65061166', 'นายทิวา เกิดเสวี', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(244, '65061167', '65061167', 'นายศิวกรณ์ ยี่หวา', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(245, '66021191', '66021191', 'นายศรชัย กิมฮวย', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(246, '66091207', '66091207', 'นายนันทิพัฒน์ พันธ์น้อย', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(247, '67011212', '67011212', 'นายศุภสิน เอกภาคสวัสดิ์', 'USER', 'แผนกผลิต 2', NULL, 0.00, 'Active', NULL, 0.00),
(248, '3901229', '3901229', 'นายไตรรัตน์ นาวารัตน์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(249, '3901234', '3901234', 'นายอรรถสิทธิ์ สวนทรัพย์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(250, '3904242', '3904242', 'นายสมศักดิ์ โพธิ์พันธุ์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(251, '4001266', '4001266', 'นายพยนต์ อยู่สินไชย', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(252, '4301328', '4301328', 'นายไพฑูรย์ ฟักสุข', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(253, '4808425', '4808425', 'นายรัตนชัย โสมวงษ์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(254, '5002480', '5002480', 'นายสมพร แก้วเกษ', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(255, '5101490', '5101490', 'นายออมทรัพย์ คุณโฑ', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(256, '5304516', '5304516', 'นายธนาดล จวงเจิม', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(257, '5604630', '5604630', 'นายสิทธิชัย ยี่สุ่นแป้น', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(258, '5706701', '5706701', 'นายวรวุฒิ ทาบุญ', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(259, '5801739', '5801739', 'นายพัชระวรรธน์ แก้วหาวงศ์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(260, '5804758', '5804758', 'นายชูโชค ธัญทรงธรรม', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(261, '5807793', '5807793', 'นายศิวพงษ์ สมศรี', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(262, '5810835', '5810835', 'นายสมเกียรติ มิเอม', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(263, '5812849', '5812849', 'นายกฤตลักษณ์ สาทะเล', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(264, '5907911', '5907911', 'นายดลธรรม ศรีเพชร', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(265, '5910929', '5910929', 'นายวรุฒ ฝั้นหลี', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(266, '6004961', '6004961', 'นายโสภณ รอดกลิ่น', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(267, '61021017', '61021017', 'นายภูเบศน์ อินทร์นุ่มพันธ์', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(268, '61021018', '61021018', 'นายสมศักดิ์ ใจกล้า', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(269, '61021019', '61021019', 'นายฉัตรชัย ตรีหิรัญ', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(270, '64031135', '64031135', 'นายราชิน ฟักทิม', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(271, '65071169', '65071169', 'นายสรายุทธ แสงพราว', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(272, '68011240', '68011240', 'นายประเทือง เฉยดี', 'USER', 'แผนกคลังสินค้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(273, '3505114', '3505114', 'นายพลกฤษณ์ ประเสริฐธรรม', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(274, '4810429', '4810429', 'นายอนุรัตน์ จุ้ยพันธุ์', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(275, '5405556', '5405556', 'นายนทีธร สนธิรอต', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(276, '5406560', '5406560', 'นายสนั่น เกษรา', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(277, '5710724', '5710724', 'นายธงชัย ทองมา', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(278, '5808818', '5808818', 'นายวิโรจน์ บุญเพ็ชร', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(279, '5904881', '5904881', 'นายชัยวัฒน์ ศรีเพชร', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(280, '61031025', '61031025', 'นายประพันธ์ หอมพรมมา', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(281, '64011129', '64011129', 'นายจิรวัฒน์ วงษบุญมาก', 'USER', 'แผนกซ่อมบำรุง 2', NULL, 0.00, 'Active', NULL, 0.00),
(282, '3505110', '3505110', 'นายชัยยะสิทธิ์ ฉลองบุญ', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(283, '3705161', '3705161', 'นายทนงศักดิ์ ม่วงแจ่ม', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(284, '5605636', '5605636', 'นายสุทธิพงศ์ ทิพย์พิชัย', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(285, '5702672', '5702672', 'นายอินทร์ธร การุญ', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(286, '5710721', '5710721', 'นายธนาวุฒิ คะหาญ', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(287, '65101180', '65101180', 'นายธีรภัทร พลสรรค์', 'USER', 'แผนกไฟฟ้า 2', NULL, 0.00, 'Active', NULL, 0.00),
(288, '3405040', '3405040', 'นายมลเฑียร ปั้นจันทร์', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(289, '3601130', '3601130', 'นายบุญธรรม พัดทอง', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(290, '5703679', '5703679', 'นางสาวทัศณีย์ อุ่นธง', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(291, '5706697', '5706697', 'นายธาดา บัวจันอัด', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(292, '5708712', '5708712', 'นายวีระ ทรดี', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(293, '5803750', '5803750', 'นายรุ่งฟ้า รื่นโพธิ์วงษ์', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(294, '63031092', '63031092', 'นายจรัล เติมสิน', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(295, '64111150', '64111150', 'นางสาวอำไพพรรณ หรั่งศรี', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(296, '65021157', '65021157', 'นางสาวบุญยัง ภูสิงห์', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00),
(297, '69011260', '69011260', 'นายวีรภัทร โพธิ์นิล', 'USER', 'แผนก P&M - 2', NULL, 0.00, 'Active', NULL, 0.00);

-- --------------------------------------------------------

--
-- Table structure for table `formulas`
--

CREATE TABLE `formulas` (
  `id` int(11) NOT NULL,
  `product_id` int(11) DEFAULT NULL,
  `ingredient_id` int(11) DEFAULT NULL,
  `quantity_required` decimal(10,3) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `formulas`
--

INSERT INTO `formulas` (`id`, `product_id`, `ingredient_id`, `quantity_required`) VALUES
(4, 1403, 1247, 10.000),
(5, 1403, 506, 30.000),
(6, 1403, 490, 20.000);

-- --------------------------------------------------------

--
-- Table structure for table `formula_items`
--

CREATE TABLE `formula_items` (
  `id` int(11) NOT NULL,
  `formula_id` int(11) NOT NULL,
  `raw_material_id` int(11) NOT NULL,
  `qty_per_unit` decimal(10,4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `formula_items`
--

INSERT INTO `formula_items` (`id`, `formula_id`, `raw_material_id`, `qty_per_unit`) VALUES
(1, 1, 36, 5.5000),
(2, 1, 1247, 4.5000),
(3, 1, 215, 3.5000);

-- --------------------------------------------------------

--
-- Table structure for table `inventory_lots`
--

CREATE TABLE `inventory_lots` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `mfg_date` date NOT NULL,
  `exp_date` date NOT NULL,
  `qty` decimal(15,2) NOT NULL,
  `status` varchar(50) DEFAULT 'Active',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `inventory_lots`
--

INSERT INTO `inventory_lots` (`id`, `product_id`, `lot_no`, `mfg_date`, `exp_date`, `qty`, `status`, `created_at`) VALUES
(2, 1403, 'LOT-OPENING-1403', '2026-04-27', '2099-12-31', 0.00, 'Active', '2026-04-27 04:13:59'),
(3, 1403, 'LOT-20260427-0002', '2026-04-27', '2026-05-27', 0.00, 'Active', '2026-04-27 04:26:17'),
(4, 1403, 'LOT-20260427-0001', '2026-04-27', '2026-05-27', 0.00, 'Active', '2026-04-27 04:55:04'),
(5, 1403, 'LOT-20260427-0003', '2026-04-27', '2026-05-27', 0.00, 'Active', '2026-04-27 06:18:58'),
(6, 1403, 'LOT-20260427-0004', '2026-04-27', '2026-05-27', 0.00, 'Active', '2026-04-27 06:19:02'),
(7, 1403, 'LOT-20260427-0005', '2026-04-27', '2026-05-27', 0.00, 'Active', '2026-04-27 06:20:26'),
(8, 1403, 'LOT-20260427-0006', '2026-01-31', '2026-05-27', 0.00, 'Active', '2026-04-27 06:31:46'),
(9, 1403, 'LOT-20260427-0007', '2026-04-27', '2026-05-27', 0.00, 'Active', '2026-04-27 08:13:14'),
(10, 1137, 'REC-20260428-0011-1137', '2026-04-28', '2099-12-31', 500.00, 'Active', '2026-04-28 01:46:11'),
(11, 143, 'REC-20260428-0012-143', '2026-04-28', '2099-12-31', 0.00, 'Rejected_QA', '2026-04-28 01:57:38'),
(12, 1124, 'REC-20260428-0013-1124', '2026-04-28', '2099-12-31', 0.00, 'Rejected_QA', '2026-04-28 02:00:40'),
(13, 30, 'REC-20260428-0014-30', '2026-04-28', '2099-12-31', 0.00, 'Rejected_QA', '2026-04-28 02:19:12'),
(14, 1337, 'REC-20260428-0015-1337', '2026-04-28', '2099-12-31', 250.00, 'Active', '2026-04-28 02:22:38'),
(15, 1403, 'RMA-20260428-S9-1403', '2026-04-28', '2026-05-28', 0.00, 'Rejected_QA', '2026-04-28 04:25:24'),
(16, 702, 'REC-20260428-0016-702', '2026-04-28', '2099-12-31', 0.00, 'Rejected_QA', '2026-04-28 06:08:03'),
(17, 1403, 'LOT-20260428-0008', '2026-04-28', '2026-05-28', 3.00, 'Active', '2026-04-28 06:23:51');

-- --------------------------------------------------------

--
-- Table structure for table `leave_quotas`
--

CREATE TABLE `leave_quotas` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `year` int(11) NOT NULL,
  `sick_max` int(11) DEFAULT 30 COMMENT 'ลาป่วย',
  `personal_other_max` int(11) DEFAULT 7 COMMENT 'ลากิจรวมลาอื่นๆ',
  `vacation_max` int(11) DEFAULT 6 COMMENT 'พักร้อน',
  `maternity_max` int(11) DEFAULT 120 COMMENT 'ลาคลอด'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `leave_quotas`
--

INSERT INTO `leave_quotas` (`id`, `userid`, `year`, `sick_max`, `personal_other_max`, `vacation_max`, `maternity_max`) VALUES
(1, 'admin', 2026, 30, 7, 6, 120),
(2, '69021262', 2026, 30, 7, 6, 120),
(3, '3403026', 2026, 30, 7, 6, 120),
(4, '3803191', 2026, 30, 7, 6, 120),
(5, '4002269', 2026, 30, 7, 6, 120),
(6, '4201298', 2026, 30, 7, 6, 120),
(7, '4201299', 2026, 30, 7, 6, 120),
(8, '4301332', 2026, 30, 7, 6, 120),
(9, '4602369', 2026, 30, 7, 6, 120),
(10, '5307531', 2026, 30, 7, 6, 120),
(11, '5401539', 2026, 30, 7, 6, 120),
(12, '5402542', 2026, 30, 7, 6, 120),
(13, '5403547', 2026, 30, 7, 6, 120),
(14, '5406557', 2026, 30, 7, 6, 120),
(15, '5408564', 2026, 30, 7, 6, 120),
(16, '5503579', 2026, 30, 7, 6, 120),
(17, '5503581', 2026, 30, 7, 6, 120),
(18, '5607648', 2026, 30, 7, 6, 120),
(19, '5710726', 2026, 30, 7, 6, 120),
(20, '5804755', 2026, 30, 7, 6, 120),
(21, '5805762', 2026, 30, 7, 6, 120),
(22, '5806782', 2026, 30, 7, 6, 120),
(23, '5806784', 2026, 30, 7, 6, 120),
(24, '5807798', 2026, 30, 7, 6, 120),
(25, '5808811', 2026, 30, 7, 6, 120),
(26, '5811847', 2026, 30, 7, 6, 120),
(27, '5902863', 2026, 30, 7, 6, 120),
(28, '5903870', 2026, 30, 7, 6, 120),
(29, '6001937', 2026, 30, 7, 6, 120),
(30, '6006970', 2026, 30, 7, 6, 120),
(31, '6009996', 2026, 30, 7, 6, 120),
(32, '62091073', 2026, 30, 7, 6, 120),
(33, '63031093', 2026, 30, 7, 6, 120),
(34, '64061139', 2026, 30, 7, 6, 120),
(35, '65061164', 2026, 30, 7, 6, 120),
(36, '67021214', 2026, 30, 7, 6, 120),
(37, '68021242', 2026, 30, 7, 6, 120),
(38, '68031243', 2026, 30, 7, 6, 120),
(39, '68031244', 2026, 30, 7, 6, 120),
(40, '68091252', 2026, 30, 7, 6, 120),
(41, '69021261', 2026, 30, 7, 6, 120),
(42, '69031265', 2026, 30, 7, 6, 120),
(43, '3811228', 2026, 30, 7, 6, 120),
(44, '3903237', 2026, 30, 7, 6, 120),
(45, '4001261', 2026, 30, 7, 6, 120),
(46, '4001263', 2026, 30, 7, 6, 120),
(47, '4001267', 2026, 30, 7, 6, 120),
(48, '4004273', 2026, 30, 7, 6, 120),
(49, '4301333', 2026, 30, 7, 6, 120),
(50, '4602371', 2026, 30, 7, 6, 120),
(51, '4802408', 2026, 30, 7, 6, 120),
(52, '4804412', 2026, 30, 7, 6, 120),
(53, '4902441', 2026, 30, 7, 6, 120),
(54, '5205504', 2026, 30, 7, 6, 120),
(55, '5207511', 2026, 30, 7, 6, 120),
(56, '5402543', 2026, 30, 7, 6, 120),
(57, '5403549', 2026, 30, 7, 6, 120),
(58, '5510612', 2026, 30, 7, 6, 120),
(59, '5604631', 2026, 30, 7, 6, 120),
(60, '5612665', 2026, 30, 7, 6, 120),
(61, '5703684', 2026, 30, 7, 6, 120),
(62, '5707709', 2026, 30, 7, 6, 120),
(63, '5802742', 2026, 30, 7, 6, 120),
(64, '5807803', 2026, 30, 7, 6, 120),
(65, '5902858', 2026, 30, 7, 6, 120),
(66, '6002943', 2026, 30, 7, 6, 120),
(67, '6005966', 2026, 30, 7, 6, 120),
(68, '60111004', 2026, 30, 7, 6, 120),
(69, '61061032', 2026, 30, 7, 6, 120),
(70, '62071067', 2026, 30, 7, 6, 120),
(71, '63101113', 2026, 30, 7, 6, 120),
(72, '64111149', 2026, 30, 7, 6, 120),
(73, '65031158', 2026, 30, 7, 6, 120),
(74, '65081172', 2026, 30, 7, 6, 120),
(75, '67021217', 2026, 30, 7, 6, 120),
(76, '68011239', 2026, 30, 7, 6, 120),
(77, '69011259', 2026, 30, 7, 6, 120),
(78, '3505115', 2026, 30, 7, 6, 120),
(79, '3601127', 2026, 30, 7, 6, 120),
(80, '4205313', 2026, 30, 7, 6, 120),
(81, '4604377', 2026, 30, 7, 6, 120),
(82, '4909472', 2026, 30, 7, 6, 120),
(83, '5907900', 2026, 30, 7, 6, 120),
(84, '61041026', 2026, 30, 7, 6, 120),
(85, '65101179', 2026, 30, 7, 6, 120),
(86, '66041194', 2026, 30, 7, 6, 120),
(87, '67021218', 2026, 30, 7, 6, 120),
(88, '67081232', 2026, 30, 7, 6, 120),
(89, '68101253', 2026, 30, 7, 6, 120),
(90, '68111257', 2026, 30, 7, 6, 120),
(91, '3702158', 2026, 30, 7, 6, 120),
(92, '5901854', 2026, 30, 7, 6, 120),
(93, '62111081', 2026, 30, 7, 6, 120),
(94, '65091177', 2026, 30, 7, 6, 120),
(95, '69021263', 2026, 30, 7, 6, 120),
(96, '3707173', 2026, 30, 7, 6, 120),
(97, '4004274', 2026, 30, 7, 6, 120),
(98, '5306524', 2026, 30, 7, 6, 120),
(99, '3404029', 2026, 30, 7, 6, 120),
(100, '3501073', 2026, 30, 7, 6, 120),
(101, '3709181', 2026, 30, 7, 6, 120),
(102, '3709182', 2026, 30, 7, 6, 120),
(103, '3804199', 2026, 30, 7, 6, 120),
(104, '3804203', 2026, 30, 7, 6, 120),
(105, '5702673', 2026, 30, 7, 6, 120),
(106, '5702674', 2026, 30, 7, 6, 120),
(107, '5706695', 2026, 30, 7, 6, 120),
(108, '5706705', 2026, 30, 7, 6, 120),
(109, '5903868', 2026, 30, 7, 6, 120),
(110, '5909917', 2026, 30, 7, 6, 120),
(111, '6004955', 2026, 30, 7, 6, 120),
(112, '6006969', 2026, 30, 7, 6, 120),
(113, '63081105', 2026, 30, 7, 6, 120),
(114, '63111116', 2026, 30, 7, 6, 120),
(115, '65021156', 2026, 30, 7, 6, 120),
(116, '3609151', 2026, 30, 7, 6, 120),
(117, '4210324', 2026, 30, 7, 6, 120),
(118, '4912475', 2026, 30, 7, 6, 120),
(119, '5306525', 2026, 30, 7, 6, 120),
(120, '5907896', 2026, 30, 7, 6, 120),
(121, '62081070', 2026, 30, 7, 6, 120),
(122, '66061200', 2026, 30, 7, 6, 120),
(123, '68061248', 2026, 30, 7, 6, 120),
(124, '69031264', 2026, 30, 7, 6, 120),
(125, '3402024', 2026, 30, 7, 6, 120),
(126, '3501072', 2026, 30, 7, 6, 120),
(127, '3505102', 2026, 30, 7, 6, 120),
(128, '3705166', 2026, 30, 7, 6, 120),
(129, '3901235', 2026, 30, 7, 6, 120),
(130, '4504352', 2026, 30, 7, 6, 120),
(131, '4512367', 2026, 30, 7, 6, 120),
(132, '6009994', 2026, 30, 7, 6, 120),
(133, '3404034', 2026, 30, 7, 6, 120),
(134, '3409055', 2026, 30, 7, 6, 120),
(135, '3907255', 2026, 30, 7, 6, 120),
(136, '4501346', 2026, 30, 7, 6, 120),
(137, '4508359', 2026, 30, 7, 6, 120),
(138, '4904449', 2026, 30, 7, 6, 120),
(139, '5510611', 2026, 30, 7, 6, 120),
(140, '5806767', 2026, 30, 7, 6, 120),
(141, '5907897', 2026, 30, 7, 6, 120),
(142, '61071037', 2026, 30, 7, 6, 120),
(143, '62051049', 2026, 30, 7, 6, 120),
(144, '63011083', 2026, 30, 7, 6, 120),
(145, '63031091', 2026, 30, 7, 6, 120),
(146, '64011126', 2026, 30, 7, 6, 120),
(147, '64021130', 2026, 30, 7, 6, 120),
(148, '64051138', 2026, 30, 7, 6, 120),
(149, '65121185', 2026, 30, 7, 6, 120),
(150, '67011213', 2026, 30, 7, 6, 120),
(151, '67031221', 2026, 30, 7, 6, 120),
(152, '68071249', 2026, 30, 7, 6, 120),
(153, '68071250', 2026, 30, 7, 6, 120),
(154, '68111256', 2026, 30, 7, 6, 120),
(155, '3308014', 2026, 30, 7, 6, 120),
(156, '3709184', 2026, 30, 7, 6, 120),
(157, '3710185', 2026, 30, 7, 6, 120),
(158, '4002270', 2026, 30, 7, 6, 120),
(159, '5005484', 2026, 30, 7, 6, 120),
(160, '5802749', 2026, 30, 7, 6, 120),
(161, '5806771', 2026, 30, 7, 6, 120),
(162, '3801125', 2026, 30, 7, 6, 120),
(163, '3905247', 2026, 30, 7, 6, 120),
(164, '3908256', 2026, 30, 7, 6, 120),
(165, '4004272', 2026, 30, 7, 6, 120),
(166, '4407345', 2026, 30, 7, 6, 120),
(167, '4705394', 2026, 30, 7, 6, 120),
(168, '5411571', 2026, 30, 7, 6, 120),
(169, '5609652', 2026, 30, 7, 6, 120),
(170, '3502082', 2026, 30, 7, 6, 120),
(171, '3504087', 2026, 30, 7, 6, 120),
(172, '3604146', 2026, 30, 7, 6, 120),
(173, '3804198', 2026, 30, 7, 6, 120),
(174, '3809222', 2026, 30, 7, 6, 120),
(175, '3905245', 2026, 30, 7, 6, 120),
(176, '4306335', 2026, 30, 7, 6, 120),
(177, '5006485', 2026, 30, 7, 6, 120),
(178, '5701668', 2026, 30, 7, 6, 120),
(179, '65011153', 2026, 30, 7, 6, 120),
(180, '3401017', 2026, 30, 7, 6, 120),
(181, '3505106', 2026, 30, 7, 6, 120),
(182, '3502084', 2026, 30, 7, 6, 120),
(183, '3805204', 2026, 30, 7, 6, 120),
(184, '4201296', 2026, 30, 7, 6, 120),
(185, '61021015', 2026, 30, 7, 6, 120),
(186, '61071041', 2026, 30, 7, 6, 120),
(187, '62031048', 2026, 30, 7, 6, 120),
(188, '63021087', 2026, 30, 7, 6, 120),
(189, '64011122', 2026, 30, 7, 6, 120),
(190, '64011127', 2026, 30, 7, 6, 120),
(191, '65091176', 2026, 30, 7, 6, 120),
(192, '66041193', 2026, 30, 7, 6, 120),
(193, '68101255', 2026, 30, 7, 6, 120),
(194, '68111258', 2026, 30, 7, 6, 120),
(195, '4709397', 2026, 30, 7, 6, 120),
(196, '3707172', 2026, 30, 7, 6, 120),
(197, '3411061', 2026, 30, 7, 6, 120),
(198, '3611155', 2026, 30, 7, 6, 120),
(199, '3907252', 2026, 30, 7, 6, 120),
(200, '3907254', 2026, 30, 7, 6, 120),
(201, '4008283', 2026, 30, 7, 6, 120),
(202, '3601132', 2026, 30, 7, 6, 120),
(203, '3601140', 2026, 30, 7, 6, 120),
(204, '4205315', 2026, 30, 7, 6, 120),
(205, '4402341', 2026, 30, 7, 6, 120),
(206, '5106494', 2026, 30, 7, 6, 120),
(207, '5107497', 2026, 30, 7, 6, 120),
(208, '5410569', 2026, 30, 7, 6, 120),
(209, '5503582', 2026, 30, 7, 6, 120),
(210, '5511619', 2026, 30, 7, 6, 120),
(211, '5604629', 2026, 30, 7, 6, 120),
(212, '5802748', 2026, 30, 7, 6, 120),
(213, '5804751', 2026, 30, 7, 6, 120),
(214, '62061053', 2026, 30, 7, 6, 120),
(215, '63111120', 2026, 30, 7, 6, 120),
(216, '66061199', 2026, 30, 7, 6, 120),
(217, '67051224', 2026, 30, 7, 6, 120),
(218, '67111235', 2026, 30, 7, 6, 120),
(219, '3601138', 2026, 30, 7, 6, 120),
(220, '3707170', 2026, 30, 7, 6, 120),
(221, '3806209', 2026, 30, 7, 6, 120),
(222, '4301331', 2026, 30, 7, 6, 120),
(223, '4602373', 2026, 30, 7, 6, 120),
(224, '4802409', 2026, 30, 7, 6, 120),
(225, '4907463', 2026, 30, 7, 6, 120),
(226, '4907466', 2026, 30, 7, 6, 120),
(227, '5309536', 2026, 30, 7, 6, 120),
(228, '5505586', 2026, 30, 7, 6, 120),
(229, '5505587', 2026, 30, 7, 6, 120),
(230, '5705694', 2026, 30, 7, 6, 120),
(231, '5710725', 2026, 30, 7, 6, 120),
(232, '5805761', 2026, 30, 7, 6, 120),
(233, '5807797', 2026, 30, 7, 6, 120),
(234, '5811848', 2026, 30, 7, 6, 120),
(235, '5907903', 2026, 30, 7, 6, 120),
(236, '5907909', 2026, 30, 7, 6, 120),
(237, '65011152', 2026, 30, 7, 6, 120),
(238, '65021155', 2026, 30, 7, 6, 120),
(239, '65051159', 2026, 30, 7, 6, 120),
(240, '65061163', 2026, 30, 7, 6, 120),
(241, '65061166', 2026, 30, 7, 6, 120),
(242, '65061167', 2026, 30, 7, 6, 120),
(243, '66021191', 2026, 30, 7, 6, 120),
(244, '66091207', 2026, 30, 7, 6, 120),
(245, '67011212', 2026, 30, 7, 6, 120),
(246, '3901229', 2026, 30, 7, 6, 120),
(247, '3901234', 2026, 30, 7, 6, 120),
(248, '3904242', 2026, 30, 7, 6, 120),
(249, '4001266', 2026, 30, 7, 6, 120),
(250, '4301328', 2026, 30, 7, 6, 120),
(251, '4808425', 2026, 30, 7, 6, 120),
(252, '5002480', 2026, 30, 7, 6, 120),
(253, '5101490', 2026, 30, 7, 6, 120),
(254, '5304516', 2026, 30, 7, 6, 120),
(255, '5604630', 2026, 30, 7, 6, 120),
(256, '5706701', 2026, 30, 7, 6, 120),
(257, '5801739', 2026, 30, 7, 6, 120),
(258, '5804758', 2026, 30, 7, 6, 120),
(259, '5807793', 2026, 30, 7, 6, 120),
(260, '5810835', 2026, 30, 7, 6, 120),
(261, '5812849', 2026, 30, 7, 6, 120),
(262, '5907911', 2026, 30, 7, 6, 120),
(263, '5910929', 2026, 30, 7, 6, 120),
(264, '6004961', 2026, 30, 7, 6, 120),
(265, '61021017', 2026, 30, 7, 6, 120),
(266, '61021018', 2026, 30, 7, 6, 120),
(267, '61021019', 2026, 30, 7, 6, 120),
(268, '64031135', 2026, 30, 7, 6, 120),
(269, '65071169', 2026, 30, 7, 6, 120),
(270, '68011240', 2026, 30, 7, 6, 120),
(271, '3505114', 2026, 30, 7, 6, 120),
(272, '4810429', 2026, 30, 7, 6, 120),
(273, '5405556', 2026, 30, 7, 6, 120),
(274, '5406560', 2026, 30, 7, 6, 120),
(275, '5710724', 2026, 30, 7, 6, 120),
(276, '5808818', 2026, 30, 7, 6, 120),
(277, '5904881', 2026, 30, 7, 6, 120),
(278, '61031025', 2026, 30, 7, 6, 120),
(279, '64011129', 2026, 30, 7, 6, 120),
(280, '3505110', 2026, 30, 7, 6, 120),
(281, '3705161', 2026, 30, 7, 6, 120),
(282, '5605636', 2026, 30, 7, 6, 120),
(283, '5702672', 2026, 30, 7, 6, 120),
(284, '5710721', 2026, 30, 7, 6, 120),
(285, '65101180', 2026, 30, 7, 6, 120),
(286, '3405040', 2026, 30, 7, 6, 120),
(287, '3601130', 2026, 30, 7, 6, 120),
(288, '5703679', 2026, 30, 7, 6, 120),
(289, '5706697', 2026, 30, 7, 6, 120),
(290, '5708712', 2026, 30, 7, 6, 120),
(291, '5803750', 2026, 30, 7, 6, 120),
(292, '63031092', 2026, 30, 7, 6, 120),
(293, '64111150', 2026, 30, 7, 6, 120),
(294, '65021157', 2026, 30, 7, 6, 120),
(295, '69011260', 2026, 30, 7, 6, 120);

-- --------------------------------------------------------

--
-- Table structure for table `leave_records`
--

CREATE TABLE `leave_records` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `start_date` date NOT NULL COMMENT 'วันที่เริ่มลา',
  `end_date` date NOT NULL COMMENT 'วันสิ้นสุดการลา',
  `leave_type` varchar(50) NOT NULL,
  `d` int(11) DEFAULT 0,
  `h` int(11) DEFAULT 0,
  `m` int(11) DEFAULT 0,
  `t` int(11) DEFAULT 0,
  `recorder` varchar(100) DEFAULT NULL,
  `status` enum('Pending','Manager_Approved','Approved','Rejected') NOT NULL DEFAULT 'Pending',
  `created_at` datetime DEFAULT current_timestamp(),
  `reason` text DEFAULT NULL COMMENT 'เหตุผลการลา',
  `attachment` varchar(255) DEFAULT NULL COMMENT 'ไฟล์แนบรูปภาพ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `maintenance_parts_issue`
--

CREATE TABLE `maintenance_parts_issue` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `qty` decimal(10,2) NOT NULL,
  `maintenance_id` int(11) DEFAULT NULL,
  `machine_name` varchar(255) NOT NULL,
  `reason` text DEFAULT NULL,
  `withdrawn_by` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `maintenance_requests`
--

CREATE TABLE `maintenance_requests` (
  `id` int(11) NOT NULL,
  `machine_name` varchar(255) NOT NULL,
  `issue_description` text NOT NULL,
  `priority` enum('Low','Medium','High','Urgent') DEFAULT 'Medium',
  `status` enum('Pending','In_Progress','Completed','Cancelled') DEFAULT 'Pending',
  `requester_name` varchar(100) NOT NULL,
  `userid` varchar(50) DEFAULT NULL,
  `technician_name` varchar(100) DEFAULT NULL,
  `remark` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ot_records`
--

CREATE TABLE `ot_records` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `ot_date` date NOT NULL,
  `ot_1_h` int(11) DEFAULT 0,
  `ot_1_m` int(11) DEFAULT 0,
  `ot_15_h` int(11) DEFAULT 0,
  `ot_15_m` int(11) DEFAULT 0,
  `ot_3_h` int(11) DEFAULT 0,
  `ot_3_m` int(11) DEFAULT 0,
  `shift_fee` int(11) DEFAULT 0,
  `diligence_fee` int(11) DEFAULT 0,
  `recorder` varchar(100) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `status` enum('Pending','Manager_Approved','Approved','Rejected') DEFAULT 'Pending'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `part_issues`
--

CREATE TABLE `part_issues` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `qty` decimal(15,2) NOT NULL,
  `machine_name` varchar(255) NOT NULL,
  `reason` text DEFAULT NULL,
  `issued_by` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payroll_records`
--

CREATE TABLE `payroll_records` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `pay_month` varchar(2) NOT NULL,
  `pay_year` varchar(4) NOT NULL,
  `base_salary` decimal(10,2) DEFAULT 0.00,
  `ot_pay` decimal(10,2) DEFAULT 0.00,
  `leave_deduction` decimal(10,2) DEFAULT 0.00,
  `net_salary` decimal(10,2) DEFAULT 0.00,
  `status` enum('Pending','Paid') DEFAULT 'Pending',
  `processed_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `processed_by` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `po_items`
--

CREATE TABLE `po_items` (
  `id` int(11) NOT NULL,
  `po_id` int(11) DEFAULT NULL,
  `item_id` int(11) DEFAULT NULL,
  `quantity` decimal(10,2) DEFAULT NULL,
  `unit_price` decimal(10,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `po_items`
--

INSERT INTO `po_items` (`id`, `po_id`, `item_id`, `quantity`, `unit_price`) VALUES
(11, 11, 1137, 500.00, 1500.00),
(12, 12, 143, 580.00, 1500.00),
(13, 13, 1124, 520.00, 6000.00),
(14, 14, 30, 1000.00, 500.00),
(15, 15, 1337, 250.00, 500.00),
(16, 16, 702, 20.00, 100.00);

-- --------------------------------------------------------

--
-- Table structure for table `production_orders`
--

CREATE TABLE `production_orders` (
  `id` int(11) NOT NULL,
  `order_no` varchar(50) NOT NULL,
  `formula_name` varchar(255) NOT NULL,
  `target_qty` decimal(10,2) NOT NULL,
  `unit` varchar(50) DEFAULT 'ตัน',
  `production_line` varchar(100) NOT NULL,
  `start_date` date NOT NULL,
  `due_date` date NOT NULL,
  `status` varchar(50) DEFAULT 'Pending',
  `created_by` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `production_orders`
--

INSERT INTO `production_orders` (`id`, `order_no`, `formula_name`, `target_qty`, `unit`, `production_line`, `start_date`, `due_date`, `status`, `created_by`, `created_at`) VALUES
(1, 'PRD-202604-001', 'อาหารหมู', 20.00, 'ตัน', 'แผนกผลิต 1', '2026-04-27', '2026-04-30', 'Completed', '', '2026-04-27 04:21:22'),
(2, 'PRD-202604-002', 'อาหารหมู', 1.00, 'ตัน', 'แผนกผลิต 1', '2026-04-27', '2026-04-30', 'Completed', '', '2026-04-27 04:25:42'),
(3, 'PRD-202604-003', 'อาหารหมู', 1.00, 'ตัน', 'แผนกผลิต 1', '2026-04-27', '2026-04-30', 'Completed', '', '2026-04-27 04:51:57'),
(4, 'PRD-202604-004', 'อาหารหมู', 1.00, 'ตัน', 'แผนกผลิต 1', '2026-04-27', '2026-04-30', 'Completed', '', '2026-04-27 04:54:54'),
(5, 'PRD-202604-005', 'อาหารหมู', 20.00, 'ตัน', 'แผนกผลิต 1', '2026-04-27', '2026-04-30', 'Completed', '', '2026-04-27 06:17:56'),
(6, 'PRD-202604-006', 'อาหารหมู', 2.00, 'ตัน', 'แผนกผลิต 1', '2026-04-27', '2026-04-30', 'Completed', '', '2026-04-27 06:31:37'),
(7, 'PRD-202604-007', 'อาหารหมู', 10.00, 'ตัน', 'แผนกผลิต 1', '2026-04-27', '2026-04-30', 'Completed', '', '2026-04-27 08:10:55'),
(8, 'PRD-202604-008', 'อาหารหมู', 5.00, 'ตัน', 'แผนกผลิต 1', '2026-04-28', '2026-05-01', 'Completed', '', '2026-04-28 03:09:45');

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `p_code` varchar(20) NOT NULL,
  `p_name` varchar(100) NOT NULL,
  `p_type` varchar(50) NOT NULL,
  `p_unit` varchar(50) NOT NULL DEFAULT 'หน่วย',
  `p_qty` decimal(12,2) NOT NULL DEFAULT 0.00,
  `p_min` decimal(12,2) NOT NULL DEFAULT 0.00,
  `shelf_life_days` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `p_code`, `p_name`, `p_type`, `p_unit`, `p_qty`, `p_min`, `shelf_life_days`) VALUES
(9, '0000', 'ของเสียจากเอ็กซ์ทรูด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(10, '1010', 'CORN GRID', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(11, '1050', 'MICRO-CORN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(12, '1051', 'MICRO-CAL-CARB.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(13, '1052', 'MICRO-RB-EXT.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(14, '1101', 'ข้าวโพด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(15, '1102', 'ข้าวโพด-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(16, '1103', 'ข้าวโพดจีน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(17, '1104', 'ข้าวโพด-A', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(18, '1105', 'ข้าวโพดโม่หยาบ', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(19, '1106', 'MEDIUM CORN A/MEDIUM G CORN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(20, '1107', 'COARSE CORN-A', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(21, '1108', 'CORN SILO - B', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(22, '1109', 'CORN SILO - F', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(23, '1111', 'CORNTECH/CORN EXTRUDE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(24, '1112', 'CORNFLAKE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(25, '1113', 'Suprex Corn', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(26, '1114', 'S-SUPERX CORN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(27, '1115', 'Extrude Corn-A', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(28, '1116', 'CORN-E', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(29, '1117', 'HOMINY FEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(30, '1121', 'กากข้าวโพด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(31, '1123', 'TG-T CORN G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(32, '1129', 'CORN DUST', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(33, '1130', 'CORN SCREENING', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(34, '1141', 'ซังข้าวโพด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(35, '1142', 'เปลือกถั่วป่น', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(36, '1178', '178-OLD STOCK', 'RAW', 'หน่วย', 250.00, 20.00, 0),
(37, '1191', 'ข้าวโพดอบ-เสีย', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(38, '1201', 'ข้าวฟ่าง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(39, '1300', 'ปลายข้าว-D', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(40, '1301', 'ปลายข้าว-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(41, '1302', 'ปลายข้าว-B', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(42, '1303', 'ปลายข้าว-C', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(43, '1304', 'RICE-A', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(44, '1305', 'เศษหมี่', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(45, '1306', 'แป้งข้าวเหนียว', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(46, '1307', 'ปลายข้าว-X', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(47, '1308', 'PADDY RICE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(48, '1311', 'NANO BR.RICE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(49, '1312', 'GR.RICE-MM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(50, '1331', 'CARBOTECH-RS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(51, '1332', 'S-NU-TROLYSE P100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(52, '1333', 'EXTRD RICE-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(53, '1334', 'RICE-C EXTRD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(54, '1335', 'RICE-E', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(55, '1336', 'BF HYDRORIC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(56, '1401', 'มันเส้น', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(57, '1403', 'มันอัดเม็ด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(58, '1405', 'แป้งสาลี', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(59, '1406', 'CHOCOLATE CANDY FEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(60, '1407', 'BISCUIT ML', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(61, '1408', 'SNACK MIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(62, '1409', 'มันฝรั่งบด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(63, '1410', 'COARSE WHEATFLOUR', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(64, '1411', 'BAKERY ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(65, '1414', 'BAKED RICE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(66, '1416', 'COOKEDRICE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(67, '1421', 'กากแป้งมัน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(68, '1422', 'CITRIC BY-PRODUCT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(69, '1423', 'CASSAVA ML-ETHANOL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(70, '1427', 'DR.CASSAVAPEEL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(71, '1435', 'RTC NOODLE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(72, '1440', 'DRIEDMUSHROOM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(73, '1501', 'รำละเอียด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(74, '1502', 'รำหยาบ', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(75, '1503', 'RB SCREENINGS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(76, '1504', 'รำข้าวนึ่ง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(77, '1505', 'รำข้าวขัด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(78, '1521', 'รำสกัด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(79, '1522', 'รำสกัด-18%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(80, '1531', 'รำละเอียดเอ็กซ์ทรูด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(81, '1534', 'รำข้าวหนึ่ง EXTRUDE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(82, '1601', 'รำข้าวสาลี', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(83, '1602', 'ข้าวสาลี', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(84, '1605', 'FEED WHEAT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(85, '1606', 'WHEAT GRAINS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(86, '1607', 'Wheat/Screening', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(87, '1651', 'BARLEY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(88, '1653', 'DUST BARLEY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(89, '1801', 'กากน้ำตาล', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(90, '1811', 'น้ำตาล', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(91, '1812', 'DEXTROSE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(92, '1901', 'น้ำมันมะพร้าว', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(93, '1902', 'น้ำมันปาล์มดิบ/ไขวัว', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(94, '1903', 'Lard/Fat', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(95, '1904', 'น้ำมันถั่วเหลือง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(96, '1905', 'RICE OIL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(97, '1906', 'POULTRY FAT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(98, '1907', 'ACID OIL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(99, '1908', 'CrudePalmOil', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(100, '1912', 'FISH-O', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(101, '1913', 'FF OIL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(102, '1920', 'BERGAFAT SL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(103, '1921', 'COCONUT MILK POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(104, '1922', 'OIL/DIE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(105, '1941', 'B-HIFAT/DK30/PORKOWEAN ELITE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(106, '1942', 'B-ZUPERFAT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(107, '1951', 'PROTECTED FAT/แมคกาแลค', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(108, '1952', 'PREMA FAT POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(109, '1953', 'D-FAT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(110, '1954', 'T300BURGAFAT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(111, '1E58Q', 'CARNIVORE SUPPLEMENT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(112, '1EQC/1', '2222', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(113, '2031', 'CORN GLUTEN FEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(114, '2101', 'กระถินป่น 13%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(115, '2103', 'กระถินป่น 16%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(116, '2106', 'ALFLAFA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(117, '2108', 'MULBERRY LEAVES', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(118, '2110', 'GREEN TEA ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(119, '2201', 'LOTUS SD.ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(120, '2311', 'กากมะพร้าว', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(121, '2312', 'COPRA ML-10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(122, '2313', 'COPRA-15%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(123, '2321', 'COPRA ML.SOLV.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(124, '2401', 'WH.PLAM ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(125, '2411', 'กากปาล์มกระเทาะเปลือก', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(126, '2412', 'PLAM-LF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(127, '2421', 'กากปาล์มสกัดน้ำมัน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(128, '2441', 'PALM SLLUDGE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(129, '2521', 'กากเบียร์', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(130, '2522', 'BG-30', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(131, '2523', 'DDGS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(132, '2524', 'Spent Malt/กากข้าวมอลท์', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(133, '2526', 'YEAST POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(134, '2527', 'GM BIO YEAST-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(135, '2528', 'BJC YEAST', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(136, '2529', 'BREWERS YEAST-CBD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(137, '2530', 'SUPER YEA.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(138, '2531', 'DRIED YEAST 28%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(139, '2532', 'DRIED YEAST 25%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(140, '2533', 'DRIED YEAST 35%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(141, '2534', 'DRIED YEAST 31%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(142, '2536', 'DIST.YEAST -65%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(143, '2539', 'DRIED YEAST ไม่รู้เกรด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(144, '2541', 'FEED YEAST 55%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(145, '2601', 'COCOA SD.COAT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(146, '2701', 'PEAS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(147, '2721', 'PEAS EXTRD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(148, '2731', 'PEA PROT.CONC.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(149, '2732', 'S-NU-TROLYSE P300', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(150, '2733', 'S-NU-TROLYSE P260', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(151, '2735', 'POTAPRO1500', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(152, '2831', 'B-STARTEX 2S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(153, '3001', 'LUPINS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(154, '3031', 'โปรตีนข้าวโพด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(155, '3034', 'US CORN GLUTEN ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(156, '3035', 'EMPERIAL 75', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(157, '3100', 'SOYBEAN SEEDS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(158, '3101', 'SOY HULL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(159, '3104', 'PEA HULL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(160, '3111', 'กากถั่วเหลืองไทย อัดน้ำมัน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(161, '3120', 'กากถั่วเหลืองอัดน้ำมัน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(162, '3121', 'กากถั่วเหลือง-ไทย', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(163, '3122', 'กากถั่วเหลือง-จีน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(164, '3123', 'กากถั่วเหลือง-อินเดีย', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(165, '3124', 'กากถั่วเหลือง-46', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(166, '3125', 'กากถั่วเหลือง-44', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(167, '3126', 'กากถั่วเหลือง-อาร์เจนติน่า', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(168, '3127', 'กากถั่วเหลือง-KM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(169, '3129', 'กากถั่วเหลือง-HIPRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(170, '3131', 'FULL FAT SOYBEAN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(171, '3132', 'SOYBEAN-E', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(172, '3139', 'FFSBM-34', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(173, '3140', 'X-SOY 600', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(174, '3141', 'SELECTA/PROTEC CON PA2 / SOLCAF -70', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(175, '3142', 'BF HP-300', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(176, '3143', 'PROFINE VF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(177, '3144', 'Bio Bomb/Bio pro / Nutri Soy', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(178, '3145', 'PROTORSAN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(179, '3146', 'SOYCOMIL-K', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(180, '3147', 'P-DIGEST/GM-PROVASOY20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(181, '3148', 'VET SOY LAC/Living Bacteria', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(182, '3150', 'PROVASOY.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(183, '3151', 'PROMAX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(184, '3153', 'HISOY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(185, '3154', 'HD SOY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(186, '3155', 'MILPRO200', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(187, '3156', 'DABOMB-P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(188, '3158', 'EP 200', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(189, '3160', 'TRADKON SPC 75', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(190, '3161', 'PROTEIN DRINKMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(191, '3171', 'SOYMILK ML', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(192, '3181', 'SOYPASTE ML (กากเต้าเจี้ยว)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(193, '3191', 'ถั่วอบ-เสีย', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(194, '3221', 'กากถั่วดำ', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(195, '3231', 'S-LINOMAX LD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(196, '3232', 'CASSIA ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(197, '3313', 'PEANUT ML-55/EXP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(198, '3321', 'กากถั่วลิสง-45', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(199, '3322', 'กากถั่วลิสง-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(200, '3323', 'กากถั่วลิสง-55', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(201, '3401', 'ละหุ่ง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(202, '3411', 'CASHEW NUT MEAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(203, '3412', 'CASHEW BUT ML-20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(204, '3421', 'กากนุ่ม', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(205, '3461', 'กากละหุ่ง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(206, '3521', 'กากองุ่น', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(207, '3522', 'CANOLA MEAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(208, '3612', 'กากทานตะวันอัดน้ำมัน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(209, '3621', 'กากทานตะวัน-35', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(210, '3622', 'กากทานตะวัน-28', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(211, '3623', 'SUNFLOWER ML-25', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(212, '3701', 'COTTON SD W/LINT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(213, '3702', 'ฝ้าย', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(214, '3721', 'กากฝ้าย', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(215, '3811', 'กากงา', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(216, '3812', 'กากงา-35/20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(217, '3821', 'กากงา (SOLV.)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(218, '3822', 'SESAME ML-40', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(219, '3931', 'WHEAT GLUTEN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(220, '3941', 'กากวุ้นเส้น', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(221, '3942', 'กากวุ้นเส้น-70', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(222, '3943', 'กากวุ้นเส้น-60', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(223, '3945', 'เปลือกถั่วเขียว', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(224, '3951', 'เปลือกถั่วเขียว', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(225, '3961', 'กากเหล้า', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(226, '3962', 'GLUTENOL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(227, '3963', 'GLUTENOL-45', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(228, '4100', 'ปลาป่นไม่ทราบเกรด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(229, '4101', 'FISH-999', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(230, '4102', 'ปลาป่น-67', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(231, '4103', 'ปลาป่น-65', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(232, '4104', 'ปลาป่น-63', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(233, '4105', 'ปลาป่น-61', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(234, '4106', 'ปลาป่น-59', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(235, '4107', 'ปลาป่น-57', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(236, '4108', 'ปลาป่น-55', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(237, '4109', 'ปลาป่น-53', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(238, '4110', 'หัวปลาป่น', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(239, '4111', 'FISH SOLUBLE PWDR', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(240, '4112', 'SALMON PRO HYDROLYSATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(241, '4114', 'EURO SALPEPTIDE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(242, '4115', 'FISH SOLUBLE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(243, '4116', 'ปลาป่น-ซิลี', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(244, '4117', 'ปลาป่น-เปรู', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(245, '4118', 'ปลาเกรดกุ้ง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(246, '4120', 'ปลาป่น 69', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(247, '4121', 'KU-FISH1-56/57', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(248, '4122', 'KU-FISH2-58', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(249, '4123', 'KU-FISH-PERU', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(250, '4125', 'Dr.Mollusca MI-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(251, '4126', 'ACTIFISHP493', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(252, '4131', 'ACTIPAL HL18/ACTITUNA L060', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(253, '4198', 'NUTRICALF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(254, '4201', 'D.SK.MILK', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(255, '4202', 'SK.MILK', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(256, '4203', 'DR.WHEY/SWEET WHEY/WHEY POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(257, '4204', 'STOCK FEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(258, '4205', 'นมผง DELAC-38', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(259, '4206', 'BUTTER MILK', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(260, '4207', 'EW-27', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(261, '4208', 'SPECILAC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(262, '4209', 'นมผง VREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(263, '4210', 'นมผง MIXOMEL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(264, '4211', 'CASINE-82', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(265, '4212', 'PRELAC/MIXOMEL/PROTIPLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(266, '4213', 'LACTOSE-85', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(267, '4214', 'FULLCREAM MILK', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(268, '4215', 'NUKAMIX 10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(269, '4216', 'DR-WHEY REP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(270, '4217', 'PERMEATE MS 140 / Dairy Lac', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(271, '4218', 'Cheese Plus', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(272, '4219', 'LACTO FEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(273, '4220', 'LACTO FEED-70', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(274, '4221', 'บอร์ซิแลค - 20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(275, '4222', 'เกรนูเมล', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(276, '4223', 'บอร์โมเฟต - 50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(277, '4224', 'Whey LP/Whey LP-11%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(278, '4226', 'PROMAG', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(279, '4227', 'PORCOMIX PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(280, '4229', 'Premulac-L', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(281, '4230', 'PROCOLAC-EXTRA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(282, '4231', 'DWP/Anilac/นมผง ANILAC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(283, '4232', 'MEP 30', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(284, '4233', 'M-FAT 20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(285, '4234', 'MIXOMEL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(286, '4235', 'LACTOSE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(287, '4236', 'COFFEEMATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(288, '4238', 'PORKOWEAN-ELITE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(289, '4239', 'DENKAPIG/NLP SUPRER 20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(290, '4240', 'S-CHOCO-MIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(291, '4241', 'S-CHOCOLATE MILK', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(292, '4242', 'EPILAC 901', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(293, '4243', 'CHEESE MEAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(294, '4244', 'LI PROLAC20/20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(295, '4245', 'MILK CHOCOLATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(296, '4246', 'NUKLOS P-30', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(297, '4247', 'NUKLOS P-42', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(298, '4248', 'ACG CHEESE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(299, '4249', 'นมผงวีวอแล็ค', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(300, '4250', 'D-MILK 20/10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(301, '4251', 'CAROB ML./CAROMIC/Carob 111/CARANI', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(302, '4252', 'MALT/ACTI MALT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(303, '4253', 'PORKOWEAN 50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(304, '4254', 'PORKOWEAN MILK EXTRA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(305, '4256', 'GOATMILK POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(306, '4257', 'MILK POWDER 20/40', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(307, '4260', 'MULKMEAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(308, '4261', 'MEDICAL FOOD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(309, '4262', 'MALTED MILK POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(310, '4263', 'DENKAPIGSMARTMILK-20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(311, '4264', 'DUMEX12/15', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(312, '4265', 'BLENDERA MF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(313, '4274', 'S26-10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(314, '4275', 'COCOWPC-65%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(315, '4280', 'AVONLAC 282SWC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(316, '4281', 'WPC 80/MILK PROTEIN CONCENTRATE 485', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(317, '4282', 'WHEY PROTEIN CONCENTRATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(318, '4284', 'ANLEAN CHOC 19%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(319, '4286', 'MALTED CHOCOLATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(320, '4300', 'PORK-ไม่รู้เกรด', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(321, '4301', 'MEAT ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(322, '4302', 'เนื้อและกระดูกป่น อินเดีย', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(323, '4303', 'MEAT&BONE-45', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(324, '4304', 'MEAT AND BONE MEAL-45 / เบลเยี่ยม', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(325, '4305', 'PORK MEAT AND BONE MEAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(326, '4306', 'PORCINE M&B -50 S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(327, '4307', 'PORK ML - 65%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(328, '4308', 'PORK ML. -55', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(329, '4309', 'PORK ML. -60', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(330, '4311', 'PORK ML. -70', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(331, '4312', 'PORKMNB/LF-50%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(332, '4402', 'EGG POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(333, '4410', 'QRILLA KRILL ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(334, '4424', 'WHEY LP-11%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(335, '4426', 'PORCOMIX PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(336, '4501', 'โปรตีน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(337, '4503', 'POULT M&B ML', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(338, '4504', 'POULT M&B -60%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(339, '4505', 'POULTRY BY PRODUCT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(340, '4507', 'GM PR PTIDE PRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(341, '4510', 'CHICK EXTRACT -20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(342, '4599', 'FRIED SHRIM ML-27', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(343, '4601', 'SHRIMP ML.-30', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(344, '4602', 'SHRIMP ML.-45', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(345, '4603', 'CLAM ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(346, '4605', 'SQUID ML.-80', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(347, '4606', 'SLP-ASA-1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(348, '4607', 'SQUID-ML-50 (ปลาหมึกแห้ง)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(349, '4608', 'SQUID LIVER POWDER-43', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(350, '4609', 'FISH LIVER MEAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(351, '4610', 'ปลาหมึกแห้ง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(352, '4611', 'SLP-35', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(353, '4615', 'SHRIMP SOLUBLE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(354, '4693', '493S-OLD STOCK', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(355, '4701', 'เลือดป่น', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(356, '4704', 'Plass MA(PM722)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(357, '4705', 'Uitracell', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(358, '4707', 'SPS-50RD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(359, '4708', 'PRO FOUND', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(360, '4710', 'EUROHAEM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(361, '4711', 'BF KULACTIC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(362, '4712', 'VEPRO-95 PHF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(363, '4713', 'HEAMOGLOBIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(364, '4715', 'POULT BLOOD ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(365, '4717', 'Palbio 50RD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(366, '4718', 'BF DPS 50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(367, '4719', 'PROTEIN POWDER/POULTRY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(368, '4721', 'Prosin/INDO-CJ PROCIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(369, '4722', 'AMINO PROTEIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(370, '4723', 'BRAZIL-CJ PROCIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(371, '4724', 'AJITEIN/PROSIN BRAZIL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(372, '4725', 'SB-GUT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(373, '4726', 'VEDAFEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(374, '4728', 'FD PRO 40', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(375, '4729', 'B-GUT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(376, '4732', 'KOBOTEN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(377, '4733', 'P-PRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(378, '5001', 'ยูเรีย', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(379, '5571', '571-OLD STOCK', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(380, '5591', '591 (050339)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(381, '591P', '591P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(382, '5940', 'SILICON DIOXIDE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(383, '6101', 'ไดแคลเซียม(กระดูก)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(384, '6102', 'DICAL-HYDRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(385, '6103', 'DYNAFOS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(386, '6112', 'DCP-THAI', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(387, '6113', 'ROCK PHOSPATE-P14', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(388, '6201', 'หินฝุ่น', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(389, '6202', 'OYSTER SHELL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(390, '6203', 'GRIT CAL.CARB.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(391, '6211', 'แคลเซี่ยม คลอไรด์', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(392, '6301', 'MONOCAL.PHOSPHATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(393, '6302', 'MCP-LCA.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(394, '6304', 'CALSEA POWDER ADVENCE G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(395, '6401', 'ไมโนไดแคลเซียม ฟอสเฟต/ไดนาฟอส', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(396, '6402', 'MDCP-21.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(397, '6403', 'GM MDCP-21/GM BIOFOS/GM FEEDPHOS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(398, '6404', 'MS PHOSPHATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(399, '6500', 'CHICKHOCK ML-25', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(400, '6501', 'BONE ML.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(401, '6503', 'BLK. CLAY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(402, '6504', 'ZEOLITE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(403, '6505', 'KAOLIN/ZEOLITE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(404, '6506', 'BIONIT-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(405, '6507', 'CLINOPTILOLITE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(406, '6901', 'เกลือป่น/Sodium Chloride', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(407, '6902', 'Sod.Bicarb', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(408, '6903', 'Sod.Sesguicarb', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(409, '6910', 'ETHOXYQUIN-L/AOXTEC F11', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(410, '6931', 'เฮปาวิท', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(411, '6941', 'TLL-30', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(412, '6942', 'TLL-64', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(413, '6951', 'ALIMET-88/RHODIMET AT88', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(414, '6953', 'CHOL-CHLORIDE 75%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(415, '6955', 'MOLDTEC 213', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(416, '6956', 'Prosid Pellet Pro/Fylax/Prostabil BSL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(417, '6957', 'KLEAN-N-KOR', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(418, '6958', 'MYCO CURB/LUPROSIL/MOLDTEC/pH7/KOFA FEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(419, '6959', 'Eastman MC/KEMIRA LP3 NC/KOFAGRAIN pH5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(420, '6960', 'P10CHGHEMICELLD190/ROVABIO EXCEL LC2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(421, '6961', 'ECONASE XT 25L', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(422, '6962', 'INTRA INNOVAZYME5L/AXTRA PHY/ Phyzyme XP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(423, '6963', 'AXTRAPHY/FINASE2X', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(424, '6964', 'OPTIPHOS LIQUID', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(425, '6966', 'QUANTUM BLUE 5L', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(426, '6967', 'ROVABIO ADVANCE PHY L', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(427, '6968', 'ECONASE WLP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(428, '6969', 'NATUGRAIN TS L', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(429, '6970', 'AVI-MULTOP/META-LIP 20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(430, '6971', 'L-LYSOFORTE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(431, '6972', 'PROGRES', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(432, '6974', 'OPTIPHOS 10000', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(433, '6997', 'อาหารดั้ม ตามรายงาน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(434, '6998', 'อาหารดั้ม ตามสูตร', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(435, '6999', 'อาหารรวมมิตร', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(436, '8056', 'CARRY-5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(437, '8057', 'CARRY-10/CARRIES GOLD 4', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(438, '8058', 'CARRY MIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(439, '8101', 'L-METHIONONE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(440, '8102', 'DL-METHIONINE/RHODIMET NP99', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(441, '8103', 'MHA-CA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(442, '8104', 'L-LYSINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(443, '8105', 'L-LYSINE HCL.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(444, '8106', 'TRYPTOPHAN-98.5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(445, '8107', 'L-TRYPTOPHAN.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(446, '8108', 'THREONINE-98', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(447, '8109', 'GLYSINE-98', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(448, '8111', 'L-THREONINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(449, '8112', 'TAURINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(450, '8114', 'L-ARGININE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(451, '8115', 'ENERMAX B-96/VISTABET-96/BETAINE HCL.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(452, '8116', 'Betaine HCI/BETAFIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(453, '8117', 'L-VALINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(454, '8118', 'Methionmax/L-THREONINE./IND-METIONINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(455, '8119', 'GM-L-THREONINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(456, '8120', 'DL-MET.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(457, '8121', 'L-ISOLEUCINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(458, '8125', 'CREAMINO/CREATINE-98', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(459, '8127', 'NUTRIBUILDER/GGA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(460, '8128', 'VEGUANIDPRO-96%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(461, '8129', 'GUANAMINO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(462, '8131', 'EXCENTIAL BETA-KEY ANHYDROUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(463, '8146', 'SYNLAC PRIME', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(464, '8147', 'PROVIAPRIME', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(465, '8148', 'POLIN PRO 300', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(466, '8151', 'TOYOCERIN-10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(467, '8152', 'ACTIVE DOUBLE 20B/AC-SK LACTO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(468, '8153', 'SALTOSE EX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(469, '8154', 'BIOTASE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(470, '8155', 'ZYMAX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(471, '8156', 'FEEDZYME DS-1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(472, '8157', 'ECOBIOL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(473, '8158', 'GALLIPRO-TECH/BIOPLUS YC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(474, '8159', 'COMBIO TYPE I', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(475, '8160', 'BIOAQUA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(476, '8161', 'DVNursery/SYNGENX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(477, '8162', 'XPCULTRA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(478, '8163', 'DV AQUA/XPC/BIOYEASTAR 4C', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(479, '8164', 'XPEL SPECTRA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(480, '8165', 'PROGUT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(481, '8166', 'GROPRO NX 101', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(482, '8167', 'GENIKAN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(483, '8168', 'I-CARE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(484, '8171', 'BAYMIX GROBIG PLUS/RCR Link/Grobig+', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(485, '8172', 'PROGUARD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(486, '8174', 'PRO.B', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(487, '8175', 'ACITSAF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(488, '8176', 'ProBe-BacSE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(489, '8177', 'LEVUCELLSB-TITAN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(490, '8200', 'AD3(1000/200)/RECOVIT 1000/200', 'RAW', 'หน่วย', 40.00, 20.00, 0),
(491, '8201', 'VIT A-500', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(492, '8202', 'VIT AD3(500/100)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(493, '8204', 'VIT D3(500)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(494, '8205', 'HY-D', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(495, '8206', 'VIT E(500)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(496, '8208', 'VIT K3', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(497, '8210', 'VIT B1(THAIMIN)/THIAVIT MONO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(498, '8212', 'VIT B2-80/RIBOVIT B2 800', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(499, '8213', 'VIT B2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(500, '8214', 'VIT B6(PYRIDOXINE)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(501, '8216', 'VIT B12(1%)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(502, '8218', 'VIT B12(0.1%)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(503, '8220', 'VIT C(ASCOBIC)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(504, '8221', 'VIT C-PHOSPHATE/STAY-C', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(505, '8222', 'CAL.D-PANTOTHENATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(506, '8223', 'ANER-C/L-ASCORBATE-2/ASCORVIT35%', 'RAW', 'หน่วย', 850.00, 20.00, 0),
(507, '8224', 'NIACIN/ACIPPEX 990', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(508, '8225', 'NIACIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(509, '8226', 'FOLIC-96', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(510, '8227', 'FOLIC-80', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(511, '8228', 'BIOTIN-1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(512, '8230', 'BIOTIN-2/BIFEX H2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(513, '8231', 'CARNIKING 50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(514, '8232', 'L-CARNITINE50%.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(515, '8233', 'CABANIN/PROVIOX50/GRAPEPP/GOLDENFRULT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(516, '8234', 'PHYTOCEE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(517, '8238', 'HERBALC PWDR', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(518, '8240', 'SUGARCANE EXTRACT POLYPHENOL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(519, '8241', 'OXC BETA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(520, '8243', 'PROVIOX-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(521, '8245', 'ELIFE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(522, '8246', 'NUQO FLEX 50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(523, '8251', 'FUJI FF INULIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(524, '8256', 'IPP (FEED GRADE)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(525, '8257', 'DIAMOND V', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(526, '8266', 'BEXEMULSIFYDRY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(527, '8296', 'VIT B12(97%)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(528, '8301', 'CANTHAPLUS-10/AVIXANTHIN-100/CANTHACOL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(529, '8302', 'CAROPHYLL RED-10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(530, '8304', 'CAROPHYLL YELLOW/APOEPLUS 10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(531, '8305', 'CAROPHYLL RED-10%.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(532, '8307', 'Naxture Gold 40/XAMACOL 40', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(533, '8308', 'CANTHACAL 1%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(534, '8310', 'ESSENTION RED10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(535, '8312', 'CHOLESTEROL-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(536, '8314', 'CHOLESTEROL-90', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(537, '8341', 'CANTHAPLUS 10S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(538, '8352', 'VITAGOLD15', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(539, '8353', 'QUANTUM GLO Y DRY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(540, '8354', 'ORO GLO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(541, '8355', 'CAPSANTAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(542, '8356', 'NaxtureGold20/BSLEADERYELLOW2%/PIXLUTEIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(543, '8359', 'IDACOL DGT-803', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(544, '8360', 'IDC TERTRAZINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(545, '8362', 'LIPOSORB', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(546, '8364', 'INOSITOL-97', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(547, '8365', 'RUNEON(LACHANCE)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(548, '8366', 'E-Energy+/LIPA PRO P/DR.LECITHIN-95', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(549, '8367', 'PIGGOMIX/LIPICEL/VOLAMEL EXTRA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(550, '8368', 'LECITHIN LIQUID-65/LYSOFORTE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(551, '8369', 'BREDOL683/Scattice/BREDOL694', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(552, '8370', 'AVILAC C/Lipidol', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(553, '8371', 'LIPO AMP/SOLMAX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(554, '8372', 'AVI-MUL TOP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(555, '8373', 'MYVATEX AF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(556, '8374', 'LIPOTECH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(557, '8375', 'LIPIDMATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(558, '8376', 'AXTRA PHY GOLD 10 T', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(559, '8377', 'AXTRA XB 201 TPT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(560, '8391', 'G ECODIAR', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(561, '8392', 'G SILICON DIOXIDE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(562, '8402', 'CHOL.CHLORIDE-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(563, '8403', 'CHOL.CHLORIDE-60', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(564, '8404', 'CHOLINE CHLORIDE -60%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(565, '8405', 'BIOCHOLINEPOWDER/ACT BIO CHOLINE ORGANIC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(566, '8406', 'KOLIN PLUS/METACHOL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(567, '8410', 'OLIVE LEAF EXTRACT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(568, '8411', 'GRAPE SKIN EXTRACT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(569, '8412', 'GRAPE SEED EXTRACT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(570, '8413', 'SORBITOL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(571, '8414', 'ZMIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(572, '8420', 'CALCIUM LACTATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(573, '8421', 'LCALCIUM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(574, '8422', 'LPOLYSAC.GUM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(575, '8435', 'PERZINCO S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(576, '8436', 'SHIELD ZN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(577, '8437', 'BLEN NANO ZN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(578, '8451', 'WBIONIT-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(579, '8452', 'WEURODIGESTGUARD BCP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(580, '8453', 'WENVIRO QS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(581, '8461', 'ZAV - ZN 120', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(582, '8462', 'ZAV - FE 100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(583, '8463', 'ZAV - CU 100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(584, '8464', 'ANTAOX AQUA/ZAV - MN 80', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(585, '8465', 'ZAV - SOW FF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(586, '8472', 'P-PRO/JT PE ADVANCE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(587, '8481', 'KATTAPUGITE CLAY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(588, '8482', 'KSTAR ANISE POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(589, '8485', 'LIANOL SOLAPRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(590, '8486', 'KARTICHOKE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(591, '8487', 'KQUERARIA MIRIFICA POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(592, '8488', 'K3K', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(593, '8489', 'K SUP.CHOMIUM.-0.4%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(594, '8490', 'K GLY ADD ZN-20%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(595, '8491', 'K STAR YEAST /K Brewer\'s dried yeast', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(596, '8492', 'K AZOMITE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(597, '8493', 'K ANTITOX EXPERT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(598, '8494', 'K SMECTONE E558 BENTO / K BENTONITE BT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(599, '8495', 'K PAPAIN/K PAPAIN-10,02,000', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(600, '8496', 'K KLINOFEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(601, '8497', 'K BENGEL RA (I) POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(602, '8498', 'K BENTONITE HP POWDER/HPA/ECO FIX PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(603, '8499', 'KORE-PMX/ECODIAR', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(604, '8500', 'BENTONITE OD/SMECTONE ODF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(605, '8501', 'COPPER OXIDE-75', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(606, '8502', 'COPPER SULFATE-24', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(607, '8503', 'CALITON/CUCL2-58%/COPPER CHLORIDE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(608, '8504', 'FERROUS SULFATE-31', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(609, '8505', 'MANGANOUS OXIDE-58', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(610, '8506', 'MANGANESE SULFATE-28', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(611, '8507', 'NANOZINC/AGRAZINC 100/HORIZNO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(612, '8508', 'ZINC OXIDE-78', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(613, '8509', 'ZINC SULFATE-35', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(614, '8510', 'POTASSIUM IODIDE-72', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(615, '8511', 'CALCIUM IODATE-62', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(616, '8512', 'COBALT SULFATE-33', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(617, '8513', 'COBALT CARBONATE-46', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(618, '8514', 'SELENUM-2%/SELEMIX-2/ASIA SELENIUM-2%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(619, '8515', 'PROKEL SE/SELEMIX-1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(620, '8516', 'CALCIUM SULFATE-18', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(621, '8518', 'PENTA. ZINC SULFATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(622, '8519', 'POTASSIUM SULFATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(623, '8520', 'POTASSIUM CHLORIDE-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(624, '8521', 'POTASSIUM PHOSPHATE-29', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(625, '8522', 'MAGNESIUM SULFATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(626, '8523', 'MAGNESIUM OXIDE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(627, '8524', 'ALUMINIUM CHLORIDE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(628, '8526', 'FE PLEXOMIN-20/BIOMET IRON', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(629, '8527', 'BIOPLEX IRON', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(630, '8528', 'EXCENTIAL SELENIUM/SELESIUM YEAST - 500', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(631, '8529', 'NanoSelenium-0.3%/Selenium B-Traxim Se-2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(632, '8530', 'SOD.BICARB.-98', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(633, '8531', 'EGGSHELL 49', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(634, '8532', 'GENEX-P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(635, '8534', 'ZINC OXIDE.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(636, '8535', 'CALIXIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(637, '8536', 'ZINCORET SWINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(638, '8538', 'CHROMAX 67.5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(639, '8539', 'CHROMIUM PICOL.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(640, '8540', 'CHROMIUM PICOLINATE USP42/CHROMIUM-12.2%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(641, '8541', 'CHROMAX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(642, '8542', 'MYCROPLEX-1000', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(643, '8543', 'CROLINATE 1000.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(644, '8544', 'Nutrocal-T/Cr.Kem Trace', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(645, '8546', 'AC-SUPERIOR CHROMIUM TRIPICOLINATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(646, '8548', 'Smanganes Proteinate-13%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(647, '8549', 'Szine Proteinate-15%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(648, '8550', 'Scopper Proteinate-13%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(649, '8552', 'KZN PROT-15%/COPPER AMINO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(650, '8553', 'KMN PROT-15%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(651, '8554', 'FERROUS AMINO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(652, '8555', 'KFE PROT-15%IRON PROTEINATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(653, '8556', 'MANGANESE AMINO/Mn 220 QILI G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(654, '8557', 'PROCHAL-ZN 10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(655, '8558', 'ZINC AMINO/MINTREX - ZN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(656, '8559', 'QILI-FE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(657, '8560', 'ZN220 QILI G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(658, '8562', 'COROUGE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(659, '8563', 'CU220 QILI G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(660, '8564', 'ECOTRACE/PLEXOMIN CU-24', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(661, '8569', 'SELENIUM B-TRAXIM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(662, '8571', 'AV ZN 120', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(663, '8572', 'AVAILA Z/M', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(664, '8573', 'AVAILA-FE-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(665, '8576', 'ECOT.ZN-27%/AV-ZN100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(666, '8578', 'AVAILA MN 80', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(667, '8579', 'AvMin-Starter', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(668, '8580', 'YES MINERALS SELENIUM 5000', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(669, '8581', 'AVAILA SOW', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(670, '8582', 'ECONOMAS E', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(671, '8584', 'BIOPLEX HIGH FIVE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(672, '8585', 'MAAC IMZ', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(673, '8586', 'SULFUR-99/SULPHUR POWDER S-325', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(674, '8588', 'ETRACE MN-23%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(675, '8589', 'AB TOR SEL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(676, '8592', 'SOW MAAX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(677, '8593', 'ULTRAMINS P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(678, '8594', 'FERROUS GLYCINE-17%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(679, '8595', 'SELKO INTELLIBOND C/SINTELLIBOND-C54', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(680, '8596', 'SINTELLIBOND Z-55%/SELKO INTELLIBOND Z', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(681, '8597', 'ZINC GLYCINE 21%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(682, '8599', 'SODIUM SELENNITE-99.8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(683, '8601', 'TERMOX DRY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(684, '8602', 'TERMOX EF DRY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(685, '8603', 'SANTOQUIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(686, '8604', 'ENDOX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(687, '8605', 'OXYGARD F/OXIGARD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(688, '8606', 'LUCTANOX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(689, '8607', 'OXISTAT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(690, '8608', 'FEEDOX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(691, '8609', 'OXICAP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(692, '8610', 'BONOX DRY/LOXIDAN CF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(693, '8611', 'Oxy Nil Dry', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(694, '8612', 'FEEDGUARD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(695, '8613', 'AOXTEC-101/Santoquin Mixture 6', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(696, '8614', 'EUROTIOX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(697, '8617', 'DISGUARD-SC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(698, '8618', 'Walstrong-EO/Tanganoil-D', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(699, '8619', 'AVT-PERFORMANCE+', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(700, '8620', 'SUPERLIV', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(701, '8621', 'HERBATOB-MIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(702, '8622', '3K', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(703, '8623', 'NUTRI Q/EURO-DIGESTGUARD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(704, '8624', 'PEP 1000', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(705, '8625', 'MGM EX/OLIGO ESSENTIAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(706, '8626', 'VEMOHERB BP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(707, '8627', 'LIV.52/HIMPRO POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(708, '8628', 'PX AV3 C UEB POWER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(709, '8629', 'NUTRIFEN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(710, '8630', 'RE-FENCE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(711, '8631', 'SANGROVIT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(712, '8632', 'ANTA PHYT MO/SARDIPHYTROGEN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(713, '8633', 'VentarD/Activo', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(714, '8634', 'AVT WEANING', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(715, '8635', 'AVIPLUS P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(716, '8636', 'BEDGEN 40 PREMIX SFA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(717, '8637', 'BIOQUINA MN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(718, '8638', 'INTELLA FIT/BIACID NUCLEUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(719, '8639', 'ENVIVA EO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(720, '8640', 'VEROMIN-P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(721, '8641', 'DYSGUARD-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(722, '8642', 'HERB-ALL GT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(723, '8643', 'MU-PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(724, '8644', 'FENSAP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(725, '8645', 'AVIPOWER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(726, '8646', 'ANTAOX AQUA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(727, '8647', 'NEXTEND', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(728, '8648', 'INTELLA FIT PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(729, '8649', 'SAVIOTAN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(730, '8650', 'AVTF3', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(731, '8651', 'SODIUM SACCHARIN.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(732, '8652', 'SOD.SACCHARIN/EURO SWEET DS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(733, '8653', 'MENOSWEET/MENOSWEET 600', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(734, '8654', 'APPETINE F', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(735, '8655', 'APPETINE V /APPETINE SV', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(736, '8656', 'NQYUMMYCASSIC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(737, '8657', 'PIGGY SWEETS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(738, '8659', 'FISHY FLAVOR/Grill mackerel 400', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(739, '8668', 'HSCAS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(740, '8669', 'ACTIVATED CARBON', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(741, '8670', 'AGAL PRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(742, '8671', 'PROACT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(743, '8672', 'CIBENZA DP-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(744, '8674', 'CONCENTRASE-P/COLOPROTEASE P200', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(745, '8675', 'AXTRA XAP 101', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(746, '8677', 'VTPROX-3001', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(747, '8678', 'ATPRO301TPT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(748, '8679', 'CAREOX-GOX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(749, '8680', 'BIOACTIV', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(750, '8681', 'SUNNCYS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(751, '8682', 'CT CYSTEAMIN 30%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(752, '8683', 'PENERGETIC T-FATTENING', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(753, '8684', 'HAURIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(754, '8685', 'WCPORCININ+F', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(755, '8687', 'RADIAMULSMG2549V', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(756, '8688', 'EUROLAUALPHA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(757, '8689', 'HILYSES', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(758, '8690', 'KOBOTEN NUTRI 30/NUTRIPLEX E', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(759, '8691', 'PORCININ/PORCIMAX/PYGIMAX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(760, '8693', 'FRA AC 4 DRY/LipoVital GL90', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(761, '8694', 'NFI MLS 30/FRA VC 4 DRY/LauriULTRA P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(762, '8695', 'FRA C12 MONOLAURIN DRY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(763, '8696', 'WS-GB/Tributyrin/ButyPearl', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(764, '8697', 'BALANGUT/DING SU 70C/SODIUM BUTYRATE.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(765, '8698', 'DING SU', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(766, '8699', 'LIPO ZAP/GUSTER XXI B92/BUTY-FAC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(767, '8700', 'PIG ACID FLA/CALPRONA-P4/FORMI', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(768, '8701', 'ACIDAL NC/FORMI NDF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(769, '8702', 'CALC.FORMATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(770, '8703', 'PHORCE/PROBNIOCTIRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(771, '8704', 'ORGACIDS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(772, '8705', 'DIGESTOCAP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(773, '8706', 'BOLIFOR FA 2800A/FUMARIC ACID', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(774, '8707', 'ACID LAC DRY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(775, '8708', 'LATIBON PLUS/DIGEST - ACID', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(776, '8709', 'MEGACID/AMASIL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(777, '8710', 'FLAMOTIN R DRY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(778, '8711', 'TETRACID-500', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(779, '8712', 'GALLIACID', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(780, '8713', 'BACT-A-CID', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(781, '8714', 'BIOTRONIC TOP3/BIOTRONIC-P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(782, '8715', 'ACTIVATE DA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(783, '8716', 'CITREX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(784, '8717', 'AcidTec401', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(785, '8718', 'BF BANGIFLEX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(786, '8719', 'PROPHORCE AC 299/LUCTAPLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(787, '8720', 'CAPLUS ME/VEVOVITAL.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(788, '8721', 'KEMZYME MAP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(789, '8722', 'KEMZYMES', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(790, '8723', 'ECONASE XT 25', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(791, '8724', 'DANISCO XYLANASE 40000G/PORZYME 93010', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(792, '8725', 'CELLUGAZ S100/Natuzyme', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(793, '8726', 'PHYZYME XP5000G/PHYTASE 5000G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(794, '8727', 'AXTRAPHYGOLD10T/AXTRAPHY10000TP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(795, '8728', 'ProSparity250/Sunphase/Ronomix P.', 'RAW', 'หน่วย', 0.00, 20.00, 0);
INSERT INTO `products` (`id`, `p_code`, `p_name`, `p_type`, `p_unit`, `p_qty`, `p_min`, `shelf_life_days`) VALUES
(796, '8729', 'MENTAL WAY-50/LYSOZYME', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(797, '8730', 'NATOPHOS-10000G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(798, '8731', 'LF LYSOZYME 10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(799, '8732', 'HOSTAZYM X15000', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(800, '8733', 'Rovabio-Excel AP/Rovabio Advance T - Flex', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(801, '8734', 'RB T FLEX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(802, '8735', 'AXT.XB201TPT/XYLANEX.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(803, '8736', 'SUNPHASEHT/10000/ROXAZYME G2G.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(804, '8737', 'QUANTUM BLUE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(805, '8738', 'PRORELASE 3X/PORKASE-100.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(806, '8739', 'POULTRY GROW 250/ENZYNAT PRO 125', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(807, '8740', 'CYNERGY FIT 3S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(808, '8741', 'ADVANCE PHY ROVA/OREGO-STIM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(809, '8742', 'XTRACT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(810, '8743', 'Axxess XY 1000G/Phytase - 150.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(811, '8745', 'BIO-MOS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(812, '8747', 'S-RATTIFEED IPE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(813, '8748', 'S-AGRABOND', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(814, '8749', 'S-INNOFIBER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(815, '8750', 'S-SOW BOOSTER REPRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(816, '8751', 'S-SOW BOOSTER LP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(817, '8752', 'S-GROW FAST', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(818, '8753', 'S-ECON PORK', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(819, '8754', 'S-ICQ STARTER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(820, '8755', 'SUPER GROW', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(821, '8756', 'A-ZYME F1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(822, '8757', 'ZYME SELEC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(823, '8758', 'CTCZYMEP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(824, '8759', 'RONOZYME HIPHOS(GT)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(825, '8760', 'OPTIPHOS 5000 PP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(826, '5761', 'TIDEASY/BIOCARE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(827, '8762', 'UMM MAMI', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(828, '8763', 'IPLUSG/Z-TASTE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(829, '8764', 'AGRISWEET', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(830, '8765', 'LIPOTECH X-1001', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(831, '8767', 'AMPTER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(832, '8770', 'SURFA-TID/BOSPRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(833, '8771', 'FERMACTO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(834, '8772', 'KEMZYMES', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(835, '8773', 'YEA SACC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(836, '8774', 'PAN-TEK ROBUST/ID FLASH 2202', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(837, '8775', 'COVATONE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(838, '8776', 'LUCTAROM S3314Z/LUCTASWEET', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(839, '8777', 'SUCRAM TAK TIK-150/Sucram 5S/CULMINA8000', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(840, '8778', 'DDC RASPBERRY F9./DDC MILK VANILLA FLAVO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(841, '8779', 'NQSENSERASP/BIOSAF SC47', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(842, '8780', 'PIGORTEK-650', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(843, '8781', 'PIGORTEK-658', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(844, '8782', 'BIOPOWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(845, '8783', 'MICRO-AID', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(846, '8784', 'NORPONIN OPTI/SUGARING', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(847, '8785', 'FLUIDAROM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(848, '8786', 'LUCTAROMPIGLETS79404Z', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(849, '8788', 'DYNADOX -50.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(850, '8789', 'COTINGARD 40%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(851, '8790', 'RODOTIUM 80%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(852, '8791', 'LINCOMIX 600', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(853, '8792', 'KISA SP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(854, '8793', 'MUTALN 10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(855, '8794', 'TILMICIN/MICOSIN 20%/TILCOGURAD 20%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(856, '8795', 'ASTYLOPHOS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(857, '8796', 'NOVATILIN10%/ASTIMULIN25%/ASTIMULIN10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(858, '8797', 'P-DOXYCIN-150', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(859, '8798', 'P-HIPRAMIX-DOXI 50%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(860, '8799', 'CHLORTECLIN 15%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(861, '8800', 'TYSOL./TYLIN 500', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(862, '8801', 'PENNICLING-G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(863, '8802', 'FURAZOLIDONE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(864, '8803', 'SURAMOX-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(865, '8804', 'ROXARSONE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(866, '8805', 'NEOTYLAN 20%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(867, '8806', 'TYLOSIN 10% G.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(868, '8807', 'Mulinta10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(869, '8808', 'BACTMOX 80%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(870, '8809', 'TIMULIN 10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(871, '8810', 'CEPHAVET 500.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(872, '8811', 'FLAVOMYCIN 80', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(873, '8812', 'STAFAC-500', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(874, '8813', 'ENRADIN-40.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(875, '8814', 'PURIMO500.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(876, '8815', 'CHOLORSTECLIN 20%/CHLORTETRACYCLIHNE20%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(877, '8816', 'ZINC BAC.-150/ALBAC FEED 15%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(878, '8817', 'AUROFAC-200', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(879, '8818', 'CTC-TETRACIN 20%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(880, '8819', 'Lavadex1%/NULISTNP P-400/BIOCOLOSTIN40%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(881, '8820', 'NEOMYCIN-AG/COLISTIN SULPHATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(882, '8821', 'TYLOSIN -220./PHARMATILIN 25%.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(883, '8822', 'P-VALIOSINFG-50/AIVROSIN 5%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(884, '8823', 'SURMAX-25', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(885, '8824', 'Triamulox 80%/TIAMULIN HYDROGEN 80%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(886, '8825', 'TIAMULIN-10 / DENAGARD10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(887, '8826', 'QUIXALUD-60/ROXSOLIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(888, '8827', 'CTC-15%.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(889, '8828', 'SURMAX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(890, '8829', 'FLUBENOL-50%/Carbadox', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(891, '8830', 'Halquinol 60%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(892, '8831', 'VERMITAN 20%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(893, '8832', 'FLUBENOL-5/PARAZOLE 12%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(894, '8833', 'OXIBENDAZOLE 99%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(895, '8834', 'PARAZOLE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(896, '8835', 'IVOTIC 0.6%/IVOMEC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(897, '8836', 'HYGROMIX-8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(898, '8837', 'SAFEGUARD/PANACUR', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(899, '8838', 'SITASIN 10%.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(900, '8839', 'Colicure / MAC COLI 40%.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(901, '8840', 'BACITRACIN ZINC.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(902, '8841', 'Namoxilin/ARTXY-500/Novamoxine/PORCILLIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(903, '8842', 'COLISTIN-400/MEDISTIN-40', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(904, '8843', 'MILQUINOL.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(905, '8844', 'LINCOMED-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(906, '8845', 'P-LINCOSPECTIN - 880', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(907, '8846', 'PRO-STREP 100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(908, '8847', 'AMOXOCIN 15%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(909, '8848', 'PHARMOPHARM 8%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(910, '8849', 'P-TRUFOR SP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(911, '8850', 'CHLORO.GRAN-180', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(912, '8851', 'TYLOVET 250', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(913, '8852', 'TYLAN 100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(914, '8853', 'PULMOTIL G-200', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(915, '8854', 'P-FOSBAC PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(916, '8855', 'DIMETON SODA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(917, '8856', 'LINCOTECH-44.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(918, '8857', 'TYNOX-220', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(919, '8858', 'GM PURIMOX/SOMOMOX/BACTAMOX-50%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(920, '8859', 'Cephavet 500', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(921, '8860', 'TILMOVET20%G/Nutrikem150/CTC-Tetracin20%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(922, '8861', 'ADDCON XF/Tiamulin/Mulinta', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(923, '8862', 'GM SODIUM BUTYRATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(924, '8863', 'GM.DDC RASPBERRY/Ess.Ultra.Extra./Pigo', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(925, '8864', 'GM.DDC FISH FLAVOR 105', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(926, '8865', 'GM MICRO AID', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(927, '8866', 'GM MILK VANILA V5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(928, '8868', 'GM OSSITERA 200', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(929, '8869', 'GM TYLOSIN PHOSP 20% / GM NEOTYLAN 20%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(930, '8870', 'GM Mycofix Plus/GM Novasil Plus', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(931, '8871', 'GM COBACTIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(932, '8872', 'GM Milquinol/GM-Quixalud-60/GM Halquinol', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(933, '8873', 'GM-VERMISOL 150', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(934, '8874', 'GM-Luctarom/57683Z', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(935, '8875', 'GM-BMD 10%G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(936, '8876', 'GM Bactamox 80%/COLIMED/COLMIXTIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(937, '8877', 'GM SURMAX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(938, '8878', 'GM TYSOL 80% /GM TYLAN-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(939, '8879', 'GM MECTINPHAR/GM SOMECTIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(940, '8880', 'GM-PANCHOCOLATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(941, '8881', 'GM-ENROGES 2.5%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(942, '8882', 'P-COLISTIN-63', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(943, '8883', 'P-PEFLOXACIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(944, '8884', 'P-BMD-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(945, '8885', 'P-MOVETEC/P-AMOXCYL/VETXIL50%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(946, '8886', 'P-TYLOVET-25%/P-TYLOSIN 10%/TYAZIN 10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(947, '8887', 'FLUBENVET 5%/VERMITAN 20%/FLUBEN-VET 50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(948, '8888', 'P-FOSBAC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(949, '8889', 'P-VERMISOL-15%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(950, '8890', 'BACTAMOX 20%.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(951, '8891', 'BACTAMOX 50%.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(952, '8892', 'TYLOVET 10%.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(953, '8894', 'LINCOMYCIN-110.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(954, '8895', 'PRNNITRACIN MD50.G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(955, '8896', 'DROPEN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(956, '8897', 'FENOVET - 100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(957, '8898', 'Lincocep-44.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(958, '8900', 'AVATEC 150', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(959, '8901', 'EUSITIN 120', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(960, '8902', 'D.O.T.-99', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(961, '8903', 'Sacox 120 / Salinopharm 120', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(962, '8904', 'COXISTAC-12', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(963, '8905', 'CRANULATED MONESIN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(964, '8906', 'YUMAMYCIN/CYGRO-1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(965, '8907', 'MAXIBAN-80', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(966, '8908', 'Coxield/AMPROL-25', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(967, '8909', 'NARASIN-QA(715DK7)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(968, '8910', 'MAXIBAN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(969, '8911', 'CLINACOX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(970, '8912', 'LUPROSIL/MOLDTEC POWDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(971, '8913', 'Formycine Gold Px', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(972, '8914', 'FEED CURB', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(973, '8915', 'Sal Curb/salkil', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(974, '8916', 'SALGRD/MIS-500', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(975, '8917', 'MOLDGRAD/MYCOBAN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(976, '8918', 'MYCO CURB DRY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(977, '8919', 'CALPRONA-CP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(978, '8920', 'GENTIAN VIOLET', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(979, '8921', 'MYCOTOX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(980, '8922', 'INTEPROP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(981, '8923', 'MOLDSTOP SD+/MOLD-ZAP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(982, '8924', 'MYCO-AD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(983, '8925', 'KLINO FEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(984, '8926', 'AB - 20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(985, '8927', 'MTB-100/MYCOSORB/BIO.ToxActiv8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(986, '8928', 'TRUEBOND', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(987, '8929', 'Toxibond PRO/NOVASIL PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(988, '8930', 'PELEX DRY/MASTERCUBE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(989, '8931', 'NUTRI-BIND DRY/LIGNOBOND', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(990, '8932', 'UNOBIND DRY GN/SAVEBIND/AQUA STAB', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(991, '8933', 'AMERI BOND-2X/PELLTECH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(992, '8934', 'BENTONITE/VOLCLAY 325/FAITHSORB', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(993, '8935', 'MONTCARE/SITTO ZEOLITE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(994, '8936', 'AKUCELL/Maxi bond', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(995, '8937', 'ANPRO-MBX/BHBC-BIO PLUS.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(996, '8938', 'NUTRIBIND SD/NOVIPLE S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(997, '8939', 'PRNERGETIC - PIGLET', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(998, '8940', 'SILICON DIOXIDE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(999, '8941', 'MASTERSORB', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1000, '8942', 'MASTERCUBE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1001, '8943', 'DDC FISH FLAVOR Y5.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1002, '8944', 'Endoban/GM SUNPHASE 5000/GM-BIOPHOS - J', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1003, '8945', 'Solis+/PIGGOMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1004, '8946', 'FUSION MBX /GM ROXAZYME G2G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1005, '8947', 'MFEED +', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1006, '8948', 'LINKAFIX/GM.ENBIOCELL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1007, '8949', 'MAXIGUT/GM.FINTOX-MOLD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1008, '8950', 'PELLAN/GM-NOVASIL PLUS/TOXORID/HBC BIO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1009, '8951', 'ULTIMATE BIND/GM Popencil', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1010, '8952', 'FT-1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1011, '8953', 'BB-325/GM.MICRO PLEX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1012, '8954', 'EXCENTIAL TOXIN A/GM.FINTOX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1013, '8955', 'OPTIMIZE / GM LUCTAZYME', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1014, '8956', 'GM.Luctarom\"s\"42455Z', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1015, '8957', 'GM BZB 15% Granule', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1016, '8958', 'GM COLINZIDE/GM MAC - COLI 40%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1017, '8959', 'SULCOTIL - 20% PREMIX.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1018, '8960', 'GM AVILA STARTER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1019, '8961', 'GM AV MIN-SOW', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1020, '8962', 'GM AVAILAZ/M', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1021, '8963', 'GM AVAILA-SE-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1022, '8964', 'ANTA CATCH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1023, '8965', 'GM AVAILACU-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1024, '8966', 'GM AVAILA ZN-120', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1025, '8967', 'GM CROLINATE 1000', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1026, '8968', 'GM VEVOVITAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1027, '8969', 'GM CARNIVIT 50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1028, '8971', 'GM CYSTEAMIX-200', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1029, '8972', 'STARMEAN 50.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1030, '8973', 'CYSTEAMINE 50% G.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1031, '8974', 'VIP STARTER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1032, '8975', 'VIP GROWER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1033, '8980', 'GM-AV-TIN100/C', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1034, '8981', 'Ar-Plus/GM ALPLUCINE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1035, '8982', 'X-PEL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1036, '8985', 'CALSEA POWDER ADVANCE G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1037, '8988', 'TE800-P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1038, '8989', 'SP500A-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1039, '8990', 'BF PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1040, '8991', 'AquaSW600/S91A-PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1041, '8992', 'ZETA TOF/S92A-PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1042, '8993', 'AMERI-BOND-2X', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1043, '8994', 'ABF001', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1044, '8995', 'BLEND COS PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1045, '8996', 'BLEN COS PREMIX (C)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1046, '8997', 'S97A-PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1047, '8998', 'S98A-PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1048, '8999', 'MTX GP/S99A-PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1049, '9003', 'VIT PMX #3', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1050, '9004', 'VIT PMX #4', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1051, '9005', 'VIT PMX #5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1052, '9006', 'VIT PMX #6', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1053, '9007', 'VIT PMX #7', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1054, '9008', 'VIT PMX #8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1055, '9009', 'VIT PMX #9', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1056, '901', 'S111', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1057, '9010', 'VIT PMX #10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1058, '9011', 'VIT PMX #11', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1059, '902', 'S222', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1060, '9021', 'VIT PMX #100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1061, '9023', 'VIT PMX #300', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1062, '9024', 'VIT PMX #400', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1063, '9025', 'VIT PMX #500', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1064, '9026', 'VIT PMX #600', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1065, '9029', 'VIT PMX #900', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1066, '903', 'S333', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1067, '9034', 'VIT PMX #401', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1068, '9036', 'VIT PMX #601', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1069, '904', 'S444', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1070, '9046', 'VIT PMX-F', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1071, '905', 'B111', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1072, '9050', 'Vit PmxD399', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1073, '9051', 'J PERFORMIX STR. (9080)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1074, '9052', 'J ROVIMIX9081', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1075, '9053', 'J PERFORMIX BRDR (9091)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1076, '9056', 'J-GM4', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1077, '9057', 'OVN PRESTARTER.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1078, '9058', 'OVN STARTER.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1079, '9059', 'OVN GROWER.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1080, '906', 'B444', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1081, '9060', 'OVN FINISHER.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1082, '9061', 'OVN BREEDER.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1083, '9062', 'GM MC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1084, '9065', 'GM M4', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1085, '9067', 'GM. N-PRESTARTER/OVN PERSTARTER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1086, '9068', 'GM. N-STARTER/OVN STARTER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1087, '9069', 'GM. N-PIG GROWER/OVN GROWER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1088, '907', 'B444', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1089, '9070', 'GM. N-FINISHER/OVN FINISHER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1090, '9071', 'GM. N-BREEDER/OVN BREEDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1091, '9072', 'GM-N-MINERAL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1092, '908', 'D 111', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1093, '909', 'L444', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1094, '910', 'C444', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1095, '9106', 'TRYPTOPHAN PMX-20', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1096, '9108', 'THREONINE PMX-10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1097, '911', 'C444S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1098, '914', 'S444F', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1099, '915', 'B111W', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1100, '928', 'G444S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1101, '9301', 'K301', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1102, '9302', 'CANTH PMX-1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1103, '9304', 'CY PMX-10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1104, '9306', 'VIT PMX # 601', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1105, '936', 'B444', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1106, '941', 'S111(A)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1107, '942', 'S222(A)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1108, '943', 'S333(A)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1109, '944', 'S444(A)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1110, '945', 'B111(A)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1111, '946', 'B444(A)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1112, '947', 'B222(A)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1113, '949', 'L444(A)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1114, '9490', 'BLEN COS PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1115, '9514', 'SELENIUM PMX 0.2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1116, '9538', '9538-CHROMIUM PMX-1000', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1117, '9540', 'CHROMIUM PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1118, '9569', 'SEL PMX-1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1119, '958', 'C 444', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1120, '9736', 'ROXAZYME G2G PMX.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1121, '9801', 'PENN G-PMX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1122, '9802', 'FZ PMX-110', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1123, '9803', 'AMPICILLIN PMX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1124, '9804', '3-NITRO PMX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1125, '9805', 'DIMETHOX PMX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1126, '9806', 'SULFA PMX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1127, '9808', 'OLAQUIND PMX-50', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1128, '9810', 'TRIMETHOPRIM PMX-10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1129, '9811', 'FLAVCMYCIN PMX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1130, '9812', 'STAFAC PMX-100', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1131, '98216', 'VIT B12 PMX-1%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1132, '9823', 'SURMAX PMX-25', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1133, '9832', 'FLUBENOL -5%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1134, '9841', 'LS PMX-44', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1135, '9842', 'COLISTIN-10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1136, '9902', 'D.O.T. PMX-25', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1137, '9905', 'B111', 'RAW', 'หน่วย', 500.00, 20.00, 0),
(1138, '9906', 'B444', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1139, '9920', 'GENTIAN PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1140, '9930', 'KOVIL PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1141, '9931', 'ZN 120 PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1142, '9932', 'FE-100 PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1143, '9933', 'CU-100 PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1144, '9934', 'BIC BREEDER MIN.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1145, '9935', 'SOW-FF PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1146, '9941', 'GM4 MC.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1147, '9942', 'GPS TOTO MC.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1148, '9943', 'ROVIMIX PMC.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1149, '9944', 'ROVIMIX TAIYO/MIN.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1150, '9946', 'MIN PMX-F', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1151, '9951', 'MIN PMX-A', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1152, '9952', 'MIN PMX-B', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1153, '9953', 'MIN PMX-D', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1154, '9954', 'MIN PMX-H', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1155, '9955', 'MIN PXM-DVET PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1156, '9961', 'MIN PMX-P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1157, '9964', 'MIN PMX-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1158, '9965', 'ES PMX-2X', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1159, '9971', 'MIN PMX-T', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1160, '9974', 'MIN-PMX-C', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1161, '9975', 'MIN CONC.3', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1162, '9980', 'PROTAMIX-HIMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1163, '9981', 'N.J.1.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1164, '9982', 'N.J.2.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1165, '9983', 'N.J.6.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1166, '9984', 'T2.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1167, '9985', 'MIN-PMX-BP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1168, '9986', 'N.J.3.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1169, '9987', 'ROVIMIX BIC.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1170, '9988', 'VIT CON PMX 462/8.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1171, '9989', 'VEVOLITE.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1172, '9992', 'ROVIMIX BIC BREEDER.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1173, '9993', 'ROVIMIX BIC FINISHER.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1174, '9994', 'ROVIMIX BIC GROWER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1175, '9995', 'ROVIMIX BIC STARTER.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1176, '9996', 'ROVIMIX BIC PRESTARTER.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1177, '9999', 'FAULT MIXED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1178, 'A101', 'อาหารสมทบปลากินพืชเล็ก', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1179, 'A102', 'อาหารสมทบปลากินพืชใหญ่', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1180, 'A111', 'อาหารสมทบปลากินพืช18%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1181, 'A112', 'อาหารสมทบปลากินพืช15.5%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1182, 'A112A', 'อาหารสมทบปลากินพืช15.5%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1183, 'A301', 'อาหารปลากินพืชพัฒนาเล็ก', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1184, 'A302', 'อาหารปลากินพืชพัฒนากลาง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1185, 'A303', 'อาหารปลากินพืชพัฒนาใหญ่', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1186, 'A501', 'อาหารปลาดุกเล็ก', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1187, 'A502', 'อาหารปลาดุกกลาง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1188, 'A502V', 'อาหารปลาดุก 30% โปรตีน', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1189, 'A503', 'อาหารปลาดุกใหญ่', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1190, 'A503L', 'อาหารปลาดุกใหญ่-L', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1191, 'A503M', 'อาหารปลาดุกใหญ่-M', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1192, 'A503S', 'อาหารปลาดุกใหญ่-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1193, 'A511', 'อาหารปลาดุกเล็ก32%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1194, 'A511A', 'อาหารปลาดุกเล็ก32% (เม็ดใหญ่)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1195, 'A512', 'อาหารปลาดุกกลาง30%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1196, 'A512A', 'อาหารปลาดุกกลาง30%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1197, 'A513', 'อาหารปลาดุกใหญ่26%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1198, 'A514', 'อาหารปลาดุกใหญ่พิเศษ24%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1199, 'A711', 'อาหารกบเล็ก', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1200, 'A712', 'อาหารกบกลาง', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1201, 'A713', 'อาหารกบใหญ่', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1202, 'B111', 'B111', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1203, 'B111CCF', 'B111CCF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1204, 'B111W', 'MYCOTOX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1205, 'B112', 'B112', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1206, 'B113', 'B113', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1207, 'B114', 'B114', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1208, 'B222', 'INTEPROP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1209, 'B444', 'MOLD-ZAP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1210, 'B592', 'BIOBOOST-S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1211, 'B593', 'BIOBOOST-G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1212, 'B594', 'BIOBOOST-F', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1213, 'B597', 'B597/BIOMAX G', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1214, 'B598', 'B598/BIOMAX L', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1215, 'BEP802', 'RP802 / MD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1216, 'BEPSML', 'BPSML', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1217, 'BPSML', 'BPSML', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1218, 'C444D', 'C444D', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1219, 'CIPROFLOXACIN', 'MYCO-AD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1220, 'CU798PMX', 'CU784 - PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1221, 'CU784', 'CU VIT PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1222, 'CU992PMX', 'CU992PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1223, 'CU99XPMX', 'CU 991 PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1224, 'E001 ', 'B001/INGEN PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1225, 'E002', 'HAEMO PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1226, 'E009', 'E009', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1227, 'E103', 'BIO-BPLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1228, 'E103S', 'BIO-B PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1229, 'E111', 'EUROTEC 111/B111', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1230, 'E111CCF', 'B111CCF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1231, 'E112', 'EUROTEC 112/B112', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1232, 'E114CCF', 'B112CCF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1233, 'E113', 'EUROTEC E113/B113', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1234, 'E114', 'EUROTEC 114/B114', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1235, 'E117', 'EUROTEC 117/B117', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1236, 'E117CCF', 'B117CCF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1237, 'E127', 'B127', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1238, 'E301', 'B301-BIOZYME XP', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1239, 'E58Q', 'CARNIVORE SUPPLERMENT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1240, 'E58QC/1', 'B58Q CARNIVORE SUPPLEMENT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1241, 'E901', 'B901-KPK FISH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1242, 'EC442', 'BC442', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1243, 'EP805', 'EP805/6', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1244, 'ERT1', 'PHYTA XB', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1245, 'F01', 'FAITHTECH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1246, 'F111V', 'F111V-KMIT', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1247, 'F1970809', '197-04/09/56', 'RAW', 'หน่วย', 410.00, 20.00, 0),
(1248, 'FA01', 'FA01-MIN PREMIX-DPO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1249, 'FT-2', 'FT MEDICATION', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1250, 'FT904', 'CMMAX 104', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1251, 'G001', 'D8-DEZIGNER8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1252, 'HC01', 'TOXICLEAR', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1253, 'I001', 'INNOVET MIXED/MULTI MIXED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1254, 'JT01', 'AMINOGEN PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1255, 'JYB3', 'CANTHA 1%+ANTICAKING2%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1256, 'JYB4', 'APR E 1% ANTICAKING2%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1257, 'JYB5', 'CANTHA 2%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1258, 'K001', 'ZETA PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1259, 'K001#2', 'ZETA PLUS(#2)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1260, 'K001#3', 'ZETA PLUS(#3)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1261, 'K001#4', 'ZETA PLUS(#4)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1262, 'K001#6', 'ZETA PLUS(#6)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1263, 'K001#7', 'ZETA PLUS#7', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1264, 'K001#8', 'ZETA PLUS#8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1265, 'K001#9', 'ZETA PLUS#9', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1266, 'K002', 'ZETA L-TONIC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1267, 'K002#10', 'ZETZ L-TONIC(#10)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1268, 'K002#12', 'ZETA L-TONIC(#12)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1269, 'K002#3', 'ZETA L-TONIC(#3)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1270, 'K002#4', 'ZETA L-TONIC(#4)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1271, 'K002#5', 'ZETA L-TONIC(#5)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1272, 'K002#6', 'ZETA L-TONIC#6', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1273, 'K002#7', 'ZETA L-TONIC(#7)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1274, 'K002#8', 'ZETA L-TONIC(#8)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1275, 'K002#9', 'ZETA L-TONIC(#9)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1276, 'K003', 'ZETA TOF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1277, 'K003#10', 'ZETA TOF#10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1278, 'K003#4', 'ZETA TOF#4', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1279, 'K003#5', 'ZETA TOF#5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1280, 'K003#7', 'ZETA TOF#7', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1281, 'K003#9', 'ZETA TOF#9', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1282, 'K004', 'ZODAFT HEN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1283, 'K005#1', 'ZETA ZAD#1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1284, 'K005#2', 'ZETA ZAD#2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1285, 'K005#3', 'ZETA ZAD(#3)', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1286, 'K005#4', 'ZETA ZAD#4', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1287, 'K005#5', 'ZETA ZAD#5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1288, 'K005#6', 'ZETA ZAD#6', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1289, 'K005#7', 'ZETA ZAD#7', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1290, 'K005#S', 'ZETA ZAD#6', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1291, 'K005T', 'ZETA ZAD#TEST', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1292, 'K008', 'ZETA 8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1293, 'K009', 'HP-CLAY', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1294, 'K101', 'ZODAFT GF', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1295, 'K101#2', 'ZODAFT GF#2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1296, 'K101#3', 'ZODAFT GF#3', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1297, 'K101#4', 'ZODAFT GF#4', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1298, 'K101#5', 'ZODAFT GF#5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1299, 'K101#6', 'ZODAFT GF#6', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1300, 'K101#8', 'ZODAFT GF#8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1301, 'K103', 'ZODAFT GOLD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1302, 'K103#10', 'ZODAFT GOLD#10', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1303, 'K103#12', 'ZODAFT GOLD#12', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1304, 'K103#13', 'ZODAFT GOLD#13', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1305, 'K103#14', 'ZODAFT GOLD#14', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1306, 'K103#2', 'ZODAFT GOLD#2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1307, 'K103#4', 'ZODAFT GOLD#4', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1308, 'K103#5', 'ZODAFT GOLD#5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1309, 'K103#6', 'ZODAFT GOLD#6', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1310, 'K103#7', 'ZODAFT GOLD#7', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1311, 'K103#8', 'ZODRAFT GOLD#8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1312, 'K103#9', 'ZODAFT GOLD#9', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1313, 'K103S', 'BIO-BPLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1314, 'K104', 'ZODAFT HEN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1315, 'K104#2', 'ZODAFT HEN#2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1316, 'K104#3', 'ZODAFT HEN#3', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1317, 'K104#4', 'ZODAFT HEN#4', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1318, 'K104#5', 'ZODAFT HEN#5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1319, 'K104#6', 'ZODAFT HEN#6', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1320, 'K104#7', 'ZODAFT HEN#7', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1321, 'K104#9', 'ZODAFT HEN#9', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1322, 'K301', 'DEZIGNER 8', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1323, 'K301#3', 'DEZIGNER8#3', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1324, 'K301#5', 'DEZIGNER 8 #5', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1325, 'K302#1', 'NANOBIOSORB#1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1326, 'K302#2', 'NANOBIOSORB#2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1327, 'K303#1', 'MYCOFIVE-PRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1328, 'K501', 'PREMIX OV11 DD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1329, 'K503', 'DUALIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1330, 'L004', 'NUCLEOTEK ADVANCE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1331, 'L444', 'KINO FEED', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1332, 'LIC11', 'ULTIMATE-BIND', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1333, 'LK01', 'IRON PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1334, 'M194A', 'PERMA PEL', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1335, 'M444M', 'M444M', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1336, 'M592A', 'CALC.LIGNINSULF.', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1337, 'M594-P', '591-P', 'RAW', 'หน่วย', 250.00, 20.00, 0),
(1338, 'M794S-P', '794S-P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1339, 'M894-2', '894-PLANT2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1340, 'M991U-2', '991-UFAS PLANT 2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1341, 'M992A', '992A', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1342, 'MF412', 'MF412', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1343, 'MM444S', 'MM444S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1344, 'MMF412', 'MF412', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1345, 'MP984S', 'P984S', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1346, 'MPL32', 'PILOT32', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1347, 'MVF812P', 'VF812P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1348, 'MX01', 'MX01', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1349, 'Mป92A', 'ป92A', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1350, 'Mป94A', 'ป94A', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1351, 'NT02', 'CALCIMAX-P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1352, 'P001', 'EVENMOR/BORN MORE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1353, 'P900', 'DUCK PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1354, 'PC01', 'PC01-Q PAK', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1355, 'PC03', 'FISHTECH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1356, 'PC04', 'FISH ZINC', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1357, 'PC21', 'GOLDEN TECH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1358, 'PC22', 'MAG TECH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1359, 'PC23', 'ZINC TECH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1360, 'PC24', 'CAP TECH', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1361, 'PC74B', 'PC74B', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1362, 'PC99', 'PC99-DAIRY PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1363, 'PT01', 'PT01', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1364, 'PVM1', 'CANTHA LITE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1365, 'PVM3', 'NAT SHIELD PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1366, 'PVM4', 'MAX SHIELD', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1367, 'S111', 'PIC STARTER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1368, 'S111Z', 'S111Z', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1369, 'S222', 'S97A-PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1370, 'S222Z', 'S222Z', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1371, 'S333', 'S98A-PREMIX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1372, 'S444', 'PIG BREEDER', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1373, 'S444Z', 'S444Z', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1374, 'S98APMX', 'S98A PMX', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1375, 'SD111', 'SD111', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1376, 'SD222', 'SD222', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1377, 'SD333', 'SD333', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1378, 'SD333P', 'SD333P', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1379, 'SD444', 'SD444', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1380, 'STV01', 'STV01 NANOSE -0.06%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1381, 'TOP53', 'PAQ GRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1382, 'TOP54', 'PAQ TIVATE', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1383, 'TU401', 'VIT PMX-TU/240606', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1384, 'TU90231', 'VIT PMX #300/TU1', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1385, 'TU90232', 'VIT PMX #300/TU2', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1386, 'V571', '571VN', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1387, 'VX01', 'VX01', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1388, 'W001', 'W001-WINGROW PLUS', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1389, 'WC001', 'BIO STRONG-PM', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1390, 'WC002', 'BIO STRONG PV', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1391, 'Z001', 'HYD PREMIX-10%', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1392, 'ZI02', 'BI PATH B-ZINPRO INDIA', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1393, 'ZI05', 'BI PATH-L', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1394, 'ZMT1', 'ZMT1-ZINPRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1395, 'ZMT2', 'ZMT2-ZINPRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1396, 'ZMT3', 'ZMT3-ZINPRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1397, 'ZMT4', 'ZMT4-ZINPRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1398, 'ZS101', 'PIG BREEDER ZINPRO', 'RAW', 'หน่วย', 0.00, 20.00, 0),
(1403, 'RM-002', 'อาหารหมู', 'PRODUCT', 'กระสอบ', 3.00, 10.00, 30);

-- --------------------------------------------------------

--
-- Table structure for table `product_costs`
--

CREATE TABLE `product_costs` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `production_order_id` int(11) NOT NULL,
  `total_cost` decimal(15,2) NOT NULL DEFAULT 0.00,
  `cost_per_unit` decimal(15,2) NOT NULL DEFAULT 0.00,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `product_costs`
--

INSERT INTO `product_costs` (`id`, `product_id`, `lot_no`, `production_order_id`, `total_cost`, `cost_per_unit`, `created_at`) VALUES
(1, 1403, 'LOT-20260428-0008', 8, 0.00, 0.00, '2026-04-28 06:23:51');

-- --------------------------------------------------------

--
-- Table structure for table `product_formulas`
--

CREATE TABLE `product_formulas` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `formula_name` varchar(255) NOT NULL,
  `created_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `product_formulas`
--

INSERT INTO `product_formulas` (`id`, `product_id`, `formula_name`, `created_by`, `created_at`) VALUES
(1, 1403, 'สูตร 1', '', '2026-04-28 09:07:20');

-- --------------------------------------------------------

--
-- Table structure for table `purchase_orders`
--

CREATE TABLE `purchase_orders` (
  `po_id` int(11) NOT NULL,
  `supplier_name` varchar(255) DEFAULT NULL,
  `expected_delivery_date` date DEFAULT NULL,
  `status` varchar(50) DEFAULT 'Pending',
  `payment_status` varchar(50) DEFAULT 'Unpaid',
  `payment_date` date DEFAULT NULL,
  `payment_ref` varchar(100) DEFAULT NULL,
  `payment_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `purchase_orders`
--

INSERT INTO `purchase_orders` (`po_id`, `supplier_name`, `expected_delivery_date`, `status`, `payment_status`, `payment_date`, `payment_ref`, `payment_by`, `created_at`) VALUES
(11, 'บจก. เกษตรไทยร่วมใจ', '2026-04-30', 'Delivered', 'Paid', '2026-04-28', '124534721', '', '2026-04-28 01:44:44'),
(12, 'หจก. พืชผลรุ่งเรือง', '2026-04-28', 'Delivered', 'Paid', '2026-04-28', '12344174341', '', '2026-04-28 01:48:26'),
(13, 'บจก. เกษตรไทยร่วมใจ', '2026-04-24', 'Delivered', 'Paid', '2026-04-28', '4453453453453', '', '2026-04-28 01:59:52'),
(14, 'หจก. พืชผลรุ่งเรือง', '2026-05-01', 'QA_Rejected', 'Unpaid', NULL, NULL, NULL, '2026-04-28 02:13:24'),
(15, 'บจก. เกษตรไทยร่วมใจ', '2026-04-30', 'Completed', 'Paid', '2026-04-28', '4454572434', '', '2026-04-28 02:22:18'),
(16, 'บจก. เกษตรไทยร่วมใจ', '2026-05-01', 'QA_Rejected', 'Unpaid', NULL, NULL, NULL, '2026-04-28 06:07:29');

-- --------------------------------------------------------

--
-- Table structure for table `purchase_requests`
--

CREATE TABLE `purchase_requests` (
  `id` int(11) NOT NULL,
  `pr_no` varchar(50) NOT NULL,
  `item_name` varchar(255) NOT NULL,
  `qty` decimal(10,2) NOT NULL,
  `unit` varchar(50) NOT NULL,
  `reason` text DEFAULT NULL,
  `request_by` varchar(100) NOT NULL,
  `request_dept` varchar(100) NOT NULL,
  `status` varchar(50) DEFAULT 'Pending',
  `approved_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `purchase_requests`
--

INSERT INTO `purchase_requests` (`id`, `pr_no`, `item_name`, `qty`, `unit`, `reason`, `request_by`, `request_dept`, `status`, `approved_by`, `created_at`) VALUES
(1, 'PR-202604-001', 'ดินสอ', 2.00, 'ด้าม', 'หมด', '', '', 'Approved', '', '2026-04-28 06:54:09');

-- --------------------------------------------------------

--
-- Table structure for table `qa_inbound_logs`
--

CREATE TABLE `qa_inbound_logs` (
  `id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `product_id` int(11) NOT NULL,
  `moisture` decimal(5,2) NOT NULL,
  `visual_check` varchar(50) NOT NULL,
  `qa_status` varchar(50) NOT NULL,
  `remark` text DEFAULT NULL,
  `inspector_name` varchar(100) NOT NULL,
  `inspected_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `qa_inbound_logs`
--

INSERT INTO `qa_inbound_logs` (`id`, `lot_no`, `product_id`, `moisture`, `visual_check`, `qa_status`, `remark`, `inspector_name`, `inspected_at`) VALUES
(1, 'REC-20260428-0011-1137', 1137, 7.50, 'ปกติ (ผ่านเกณฑ์)', 'Approved', '25%', '', '2026-04-28 01:47:10'),
(2, 'REC-20260428-0012-143', 143, 50.00, 'พบเชื้อรา/ชื้นเกิน', 'Rejected', '', '', '2026-04-28 01:58:37'),
(3, 'REC-20260428-0013-1124', 1124, 999.99, 'ปกติ (ผ่านเกณฑ์)', 'Rejected', 'เล็กน้อย', '', '2026-04-28 02:01:02'),
(4, 'REC-20260428-0014-30', 30, 60.00, 'พบเชื้อรา/ชื้นเกิน', 'Rejected', 'ชื้นจัด', '', '2026-04-28 02:19:46'),
(5, 'REC-20260428-0015-1337', 1337, 1.00, 'ปกติ (ผ่านเกณฑ์)', 'Approved', 'ผ่าน', '', '2026-04-28 02:22:55'),
(6, 'REC-20260428-0016-702', 702, 50.00, 'พบเชื้อรา/ชื้นเกิน', 'Rejected', 'ชิ้น', '', '2026-04-28 06:09:20');

-- --------------------------------------------------------

--
-- Table structure for table `qa_inspections`
--

CREATE TABLE `qa_inspections` (
  `qa_id` int(11) NOT NULL,
  `ref_doc` varchar(50) NOT NULL COMMENT 'เลขอ้างอิง เช่น PO-00001 หรือ ทะเบียนรถ',
  `product_id` int(11) NOT NULL COMMENT 'รหัสวัตถุดิบ',
  `moisture_percent` decimal(5,2) NOT NULL COMMENT 'เปอร์เซ็นต์ความชื้น',
  `visual_check` enum('Pass','Fail') NOT NULL COMMENT 'การตรวจกายภาพ',
  `remark` text DEFAULT NULL COMMENT 'หมายเหตุเพิ่มเติม',
  `final_result` enum('Approved','Rejected') NOT NULL COMMENT 'ผลการตัดสิน',
  `inspector` varchar(100) NOT NULL COMMENT 'ผู้ตรวจสอบ',
  `inspected_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `qa_outbound_logs`
--

CREATE TABLE `qa_outbound_logs` (
  `id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `moisture` decimal(5,2) NOT NULL,
  `protein` decimal(5,2) NOT NULL,
  `appearance` varchar(50) NOT NULL,
  `qa_status` varchar(50) NOT NULL,
  `remark` text DEFAULT NULL,
  `inspector_name` varchar(100) NOT NULL,
  `inspected_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `qa_outbound_logs`
--

INSERT INTO `qa_outbound_logs` (`id`, `order_id`, `lot_no`, `moisture`, `protein`, `appearance`, `qa_status`, `remark`, `inspector_name`, `inspected_at`) VALUES
(1, 2, 'LOT-20260427-0002', 10.00, 5.00, 'ปกติ', 'Approved', 'เล็กน้อย', '', '2026-04-27 04:57:58'),
(2, 1, 'LOT-20260427-0001', 50.00, 11.00, 'ปกติ', 'Approved', 'เล็กน้อย', '', '2026-04-27 06:16:24'),
(3, 1, 'LOT-20260427-0001', 50.00, 11.00, 'ปกติ', 'Approved', 'เล็กน้อย', '', '2026-04-27 06:16:25'),
(4, 4, 'LOT-20260427-0004', 10.00, 5.00, 'ปกติ', 'Approved', 'เล็กน้อย', '', '2026-04-27 06:26:17'),
(5, 3, 'LOT-20260427-0003', 5.00, 5.00, 'ปกติ', 'Approved', 'เล็กน้อย', '', '2026-04-27 06:26:23'),
(6, 5, 'LOT-20260427-0005', 5.00, 5.00, 'ปกติ', 'Approved', 'เล็กน้อย', '', '2026-04-27 06:30:59'),
(7, 6, 'LOT-20260427-0006', 1.00, 1.00, 'ปกติ', 'Approved', 'เล็กน้อย', '', '2026-04-27 06:40:07'),
(8, 7, 'LOT-20260427-0007', 1.00, 1.00, 'ปกติ', 'Approved', 'เล็กน้อย', '', '2026-04-27 08:13:42'),
(9, 0, 'RMA-20260428-S9-1403', 70.00, 0.00, 'ปกติ', 'Rejected', 'ไม่สามารถ', '', '2026-04-28 06:10:20'),
(10, 8, 'LOT-20260428-0008', 2.00, 50.00, 'ปกติ', 'Approved', 'ผ่าน', '', '2026-04-28 06:28:44');

-- --------------------------------------------------------

--
-- Table structure for table `sales_items`
--

CREATE TABLE `sales_items` (
  `id` int(11) NOT NULL,
  `sale_id` int(11) DEFAULT NULL,
  `product_id` int(11) DEFAULT NULL,
  `quantity` decimal(10,2) DEFAULT NULL,
  `unit_price` decimal(10,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `sales_items`
--

INSERT INTO `sales_items` (`id`, `sale_id`, `product_id`, `quantity`, `unit_price`) VALUES
(2, 2, 1403, 6.00, 5000.00),
(3, 3, 1403, 1.00, 100.00),
(4, 4, 1403, 40.00, 500.00),
(5, 5, 1403, 2.00, 500.00),
(6, 6, 1403, 18.00, 18000.00),
(7, 7, 1403, 12.00, 1000.00),
(8, 8, 1403, 1.00, 700000.00),
(9, 9, 1403, 1.00, 100000.00);

-- --------------------------------------------------------

--
-- Table structure for table `sales_orders`
--

CREATE TABLE `sales_orders` (
  `sale_id` int(11) NOT NULL,
  `customer_name` varchar(255) DEFAULT NULL,
  `sale_date` date DEFAULT NULL,
  `total_amount` decimal(12,2) DEFAULT 0.00,
  `created_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `cus_id` int(11) DEFAULT NULL,
  `payment_status` enum('Unpaid','Paid','Credit') DEFAULT 'Unpaid',
  `due_date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `sales_orders`
--

INSERT INTO `sales_orders` (`sale_id`, `customer_name`, `sale_date`, `total_amount`, `created_by`, `created_at`, `cus_id`, `payment_status`, `due_date`) VALUES
(2, 'บจก. Test jigjig', '2026-04-27', 30000.00, '', '2026-04-27 04:31:29', 2, 'Paid', '2026-04-27'),
(3, 'บจก. Test jigjig', '2026-04-27', 100.00, '', '2026-04-27 06:15:36', 2, 'Paid', '2026-04-27'),
(4, 'บจก. Test jigjig', '2026-04-27', 20000.00, '', '2026-04-27 06:17:13', 2, 'Paid', '2026-04-27'),
(5, 'บจก. Test jigjig', '2026-04-27', 1000.00, '', '2026-04-27 06:27:49', 2, 'Paid', '2026-04-27'),
(6, 'บจก. Test jigjig', '2026-04-27', 324000.00, '', '2026-04-27 08:16:11', 2, 'Paid', '2026-04-27'),
(7, 'บจก. Test jigjig', '2026-04-27', 12000.00, '', '2026-04-27 08:18:05', 2, 'Paid', '2026-04-27'),
(8, 'บจก. Test jigjig', '2026-04-27', 700000.00, '', '2026-04-27 08:41:07', 2, 'Paid', '2026-08-16'),
(9, 'บจก. Test jigjig', '2026-04-27', 0.00, '', '2026-04-27 09:01:56', 2, 'Paid', '2026-08-16');

-- --------------------------------------------------------

--
-- Table structure for table `sales_returns`
--

CREATE TABLE `sales_returns` (
  `id` int(11) NOT NULL,
  `sale_id` int(11) NOT NULL,
  `cus_id` int(11) NOT NULL,
  `return_date` date NOT NULL,
  `total_refund` decimal(15,2) NOT NULL DEFAULT 0.00,
  `reason` text DEFAULT NULL,
  `created_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `sales_returns`
--

INSERT INTO `sales_returns` (`id`, `sale_id`, `cus_id`, `return_date`, `total_refund`, `reason`, `created_by`, `created_at`) VALUES
(1, 9, 2, '2026-04-28', 100000.00, 'ถุงขาด', '', '2026-04-28 04:25:24');

-- --------------------------------------------------------

--
-- Table structure for table `scrap_records`
--

CREATE TABLE `scrap_records` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `lot_no` varchar(100) NOT NULL,
  `qty` decimal(15,2) NOT NULL,
  `reason` text NOT NULL,
  `reported_by` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `scrap_records`
--

INSERT INTO `scrap_records` (`id`, `product_id`, `lot_no`, `qty`, `reason`, `reported_by`, `created_at`) VALUES
(1, 1403, 'LOT-OPENING-1403', 20.00, 'ขาด', '', '2026-04-27 04:10:21'),
(2, 1403, 'LOT-OPENING-1403', 30.00, 'หนูแทะ', '', '2026-04-27 04:12:56'),
(3, 143, 'REC-20260428-0012-143', 580.00, 'ตีกลับซัพพลายเออร์ (ไม่ผ่าน QA: )', '', '2026-04-28 01:58:37'),
(4, 1124, 'REC-20260428-0013-1124', 520.00, 'ตีกลับซัพพลายเออร์ (ไม่ผ่าน QA: เล็กน้อย)', '', '2026-04-28 02:01:02'),
(5, 30, 'REC-20260428-0014-30', 1000.00, 'ตีกลับ (ไม่ผ่าน QA: ชื้นจัด)', '', '2026-04-28 02:19:46'),
(6, 702, 'REC-20260428-0016-702', 20.00, 'ตีกลับ (ไม่ผ่าน QA: ชิ้น)', '', '2026-04-28 06:09:21'),
(7, 1403, 'RMA-20260428-S9-1403', 1.00, 'สินค้าตีกลับเสียจริง (ไม่สามารถ)', '', '2026-04-28 06:10:20'),
(8, 1403, 'LOT-20260428-0008', 2.00, 'ถุงขาด', '', '2026-04-28 06:29:33');

-- --------------------------------------------------------

--
-- Table structure for table `stock_log`
--

CREATE TABLE `stock_log` (
  `id` int(11) NOT NULL,
  `product_id` int(11) DEFAULT NULL,
  `type` enum('IN','OUT') DEFAULT NULL,
  `qty` decimal(10,2) DEFAULT NULL,
  `reference` varchar(255) DEFAULT NULL,
  `remark` text DEFAULT NULL,
  `action_by` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `stock_log`
--

INSERT INTO `stock_log` (`id`, `product_id`, `type`, `qty`, `reference`, `remark`, `action_by`, `created_at`) VALUES
(9, 1403, 'OUT', 20.00, 'ตัดชำรุด (Scrap) Lot: LOT-OPENING-1403', 'ขาด', '', '2026-04-27 04:10:20'),
(10, 1403, 'OUT', 30.00, 'ตัดชำรุด (Scrap) Lot: LOT-OPENING-1403', 'หนูแทะ', '', '2026-04-27 04:12:55'),
(11, 1247, 'IN', 10.00, 'ปรับปรุงสต็อกด้วยมือ', 'นับ', '', '2026-04-27 04:24:14'),
(12, 506, 'IN', 60.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 04:24:45'),
(13, 490, 'IN', 40.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 04:25:06'),
(14, 1247, 'OUT', 10.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 04:26:17'),
(15, 506, 'OUT', 30.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 04:26:17'),
(16, 490, 'OUT', 20.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 04:26:17'),
(17, 1403, 'IN', 1.00, 'รับจากการผลิต Order #2', NULL, '', '2026-04-27 04:26:17'),
(18, 1403, 'OUT', 1.00, 'ขายสินค้า INV-2 (Lot: LOT-20260427-0002)', NULL, '', '2026-04-27 04:31:29'),
(19, 1403, 'OUT', 5.00, 'ขายสินค้า INV-2 (Lot: LOT-OPENING-1403)', NULL, '', '2026-04-27 04:31:29'),
(20, 36, 'IN', 250.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 04:33:25'),
(21, 1247, 'IN', 1000.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 04:53:16'),
(22, 506, 'IN', 1000.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 04:53:43'),
(23, 490, 'IN', 1000.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 04:54:03'),
(24, 1247, 'OUT', 200.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 04:55:03'),
(25, 506, 'OUT', 600.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 04:55:03'),
(26, 490, 'OUT', 400.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 04:55:04'),
(27, 1403, 'IN', 1.00, 'รับเข้าคลัง: ผ่าน QA (Lot: LOT-20260427-0002)', NULL, '', '2026-04-27 04:57:58'),
(28, 1403, 'IN', 20.00, 'รับเข้าคลัง: ผ่าน QA (Lot: LOT-20260427-0001)', NULL, '', '2026-04-27 06:16:25'),
(29, 1403, 'IN', 20.00, 'รับเข้าคลัง: ผ่าน QA (Lot: LOT-20260427-0001)', NULL, '', '2026-04-27 06:16:25'),
(30, 1403, 'OUT', 20.00, 'ขายสินค้า INV-4 (Lot: LOT-20260427-0001)', NULL, '', '2026-04-27 06:17:13'),
(31, 1247, 'OUT', 10.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:18:57'),
(32, 506, 'OUT', 30.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:18:57'),
(33, 490, 'OUT', 20.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:18:58'),
(34, 1247, 'OUT', 10.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:19:02'),
(35, 506, 'OUT', 30.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:19:02'),
(36, 490, 'OUT', 20.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:19:02'),
(37, 506, 'IN', 300.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 06:19:39'),
(38, 1247, 'OUT', 200.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:20:26'),
(39, 506, 'OUT', 600.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:20:26'),
(40, 490, 'OUT', 400.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:20:26'),
(41, 1403, 'IN', 1.00, 'รับเข้าคลัง: ผ่าน QA (Lot: LOT-20260427-0004)', NULL, '', '2026-04-27 06:26:17'),
(42, 1403, 'IN', 1.00, 'รับเข้าคลัง: ผ่าน QA (Lot: LOT-20260427-0003)', NULL, '', '2026-04-27 06:26:23'),
(43, 1403, 'OUT', 1.00, 'ขายสินค้า INV-5 (Lot: LOT-20260427-0003)', NULL, '', '2026-04-27 06:27:50'),
(44, 1403, 'OUT', 1.00, 'ขายสินค้า INV-5 (Lot: LOT-20260427-0004)', NULL, '', '2026-04-27 06:27:50'),
(45, 1403, 'IN', 20.00, 'รับเข้าคลัง: ผ่าน QA (Lot: LOT-20260427-0005)', NULL, '', '2026-04-27 06:30:59'),
(46, 1247, 'OUT', 20.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:31:46'),
(47, 506, 'OUT', 60.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:31:46'),
(48, 490, 'OUT', 40.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 06:31:46'),
(49, 1403, 'IN', 2.00, 'รับเข้าคลัง: ผ่าน QA (Lot: LOT-20260427-0006)', NULL, '', '2026-04-27 06:40:07'),
(50, 490, 'IN', 200.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 08:11:50'),
(51, 506, 'IN', 200.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 08:12:23'),
(52, 506, 'IN', 90.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-27 08:13:06'),
(53, 1247, 'OUT', 100.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 08:13:14'),
(54, 506, 'OUT', 300.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 08:13:14'),
(55, 490, 'OUT', 200.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-27 08:13:14'),
(56, 1403, 'IN', 10.00, 'รับเข้าคลัง: ผ่าน QA (Lot: LOT-20260427-0007)', NULL, '', '2026-04-27 08:13:42'),
(57, 1403, 'OUT', 18.00, 'ขายสินค้า INV-6 (Lot: LOT-20260427-0005)', NULL, '', '2026-04-27 08:16:11'),
(58, 1403, 'OUT', 2.00, 'ขายสินค้า INV-7 (Lot: LOT-20260427-0005)', NULL, '', '2026-04-27 08:18:05'),
(59, 1403, 'OUT', 2.00, 'ขายสินค้า INV-7 (Lot: LOT-20260427-0006)', NULL, '', '2026-04-27 08:18:05'),
(60, 1403, 'OUT', 8.00, 'ขายสินค้า INV-7 (Lot: LOT-20260427-0007)', NULL, '', '2026-04-27 08:18:05'),
(61, 1403, 'OUT', 1.00, 'ขายสินค้า INV-8 (Lot: LOT-20260427-0007)', NULL, '', '2026-04-27 08:41:08'),
(62, 1403, 'OUT', 1.00, 'ขายสินค้า INV-9 (Lot: LOT-20260427-0007)', NULL, '', '2026-04-27 09:01:56'),
(63, 1137, 'IN', 500.00, 'รับเข้า (ผ่าน QA ขาเข้า Lot: REC-20260428-0011-1137)', NULL, '', '2026-04-28 01:47:11'),
(64, 1337, 'IN', 250.00, 'รับเข้า (ผ่าน QA ขาเข้า Lot: REC-20260428-0015-1337)', NULL, '', '2026-04-28 02:22:56'),
(65, 1403, 'IN', 1.00, 'ลูกค้ารับคืน (RMA จากบิล INV-9)', NULL, '', '2026-04-28 04:25:24'),
(66, 506, 'IN', 1000.00, 'ปรับปรุงสต็อกด้วยมือ', 'เพิ่ม', '', '2026-04-28 06:23:40'),
(67, 1247, 'OUT', 50.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-28 06:23:51'),
(68, 506, 'OUT', 150.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-28 06:23:51'),
(69, 490, 'OUT', 100.00, 'ผลิตสินค้า FG-#1403', NULL, '', '2026-04-28 06:23:51'),
(70, 1403, 'IN', 5.00, 'ผลิตเสร็จ (ผ่าน QA Lot: LOT-20260428-0008)', NULL, '', '2026-04-28 06:28:44'),
(71, 1403, 'OUT', 2.00, 'ตัดชำรุด (Scrap) Lot: LOT-20260428-0008', 'ถุงขาด', '', '2026-04-28 06:29:32');

-- --------------------------------------------------------

--
-- Table structure for table `suppliers`
--

CREATE TABLE `suppliers` (
  `id` int(11) NOT NULL,
  `s_name` varchar(255) NOT NULL COMMENT 'ชื่อบริษัท/ร้านค้า',
  `contact_person` varchar(255) DEFAULT NULL COMMENT 'ผู้ติดต่อ',
  `phone` varchar(50) DEFAULT NULL COMMENT 'เบอร์โทรศัพท์',
  `address` text DEFAULT NULL COMMENT 'ที่อยู่',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `suppliers`
--

INSERT INTO `suppliers` (`id`, `s_name`, `contact_person`, `phone`, `address`, `created_at`) VALUES
(1, 'บจก. เกษตรไทยร่วมใจ', 'คุณสมชาย', '081-234-5678', NULL, '2026-04-22 02:16:42'),
(2, 'หจก. พืชผลรุ่งเรือง', 'คุณมานี', '089-999-8888', NULL, '2026-04-22 02:16:42');

-- --------------------------------------------------------

--
-- Table structure for table `supplier_quotes`
--

CREATE TABLE `supplier_quotes` (
  `id` int(11) NOT NULL,
  `item_id` int(11) DEFAULT NULL,
  `supplier_name` varchar(255) DEFAULT NULL,
  `price_quoted` decimal(10,2) DEFAULT NULL,
  `quote_date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `system_logs`
--

CREATE TABLE `system_logs` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL COMMENT 'ใครเป็นคนทำ',
  `username` varchar(255) NOT NULL COMMENT 'ชื่อคนทำ',
  `action_type` enum('INSERT','UPDATE','DELETE','LOGIN') NOT NULL,
  `affected_table` varchar(100) NOT NULL COMMENT 'ตารางที่โดนกระทำ',
  `details` text NOT NULL COMMENT 'รายละเอียดการเปลี่ยนแปลง',
  `ip_address` varchar(45) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `system_logs`
--

INSERT INTO `system_logs` (`id`, `userid`, `username`, `action_type`, `affected_table`, `details`, `ip_address`, `created_at`) VALUES
(70, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-23 09:11:49'),
(71, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 01:17:02'),
(72, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 01:52:47'),
(73, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 01:55:40'),
(74, '69021262', 'นายสุทธิเดช สุนทรโภคิน', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 02:03:33'),
(75, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 02:03:55'),
(76, 'admin', '', 'UPDATE', 'employees', 'แก้ไขข้อมูลพนักงานรหัส 69021262 (เงินเดือน: 170000)', '::1', '2026-04-24 04:03:40'),
(77, 'admin', '', 'UPDATE', 'employees', 'แก้ไขข้อมูลพนักงานรหัส 69021262 (เงินเดือน: 17000)', '::1', '2026-04-24 04:04:19'),
(78, '69021262', 'นายสุทธิเดช สุนทรโภคิน', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 04:11:29'),
(79, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 04:12:35'),
(80, 'admin', '', 'UPDATE', 'employees', 'แก้ไขข้อมูลพนักงานรหัส 69021262 (เงินเดือน: 0)', '::1', '2026-04-24 04:12:57'),
(81, 'admin', '', 'UPDATE', 'employees', 'แก้ไขข้อมูลพนักงานรหัส 69021262 (เงินเดือน: 17000)', '::1', '2026-04-24 04:27:28'),
(82, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 04:30:22'),
(83, 'admin', '', 'UPDATE', 'employees', 'แก้ไขข้อมูลพนักงานรหัส 69021262 (เงินเดือน: 0)', '::1', '2026-04-24 04:32:00'),
(84, '69021262', 'นายสุทธิเดช สุนทรโภคิน', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 05:18:46'),
(85, '69021262', 'นายสุทธิเดช สุนทรโภคิน', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 06:45:07'),
(86, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 06:48:51'),
(87, '69021262', 'นายสุทธิเดช สุนทรโภคิน', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 06:54:30'),
(88, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 06:55:17'),
(89, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-24 09:42:36'),
(90, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '10.10.19.102', '2026-04-25 01:48:55'),
(91, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '10.10.19.102', '2026-04-25 02:09:17'),
(92, '69021262', 'นายสุทธิเดช สุนทรโภคิน', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '10.10.19.102', '2026-04-25 04:54:57'),
(93, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '10.10.19.102', '2026-04-25 04:59:18'),
(94, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '10.10.19.102', '2026-04-25 06:52:10'),
(95, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-25 06:58:59'),
(96, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-27 01:26:14'),
(97, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-27 01:33:20'),
(98, 'admin', '', 'LOGIN', 'employees', 'เข้าสู่ระบบสำเร็จ', '::1', '2026-04-28 01:27:07'),
(99, 'admin', '', 'INSERT', 'sales_returns', 'รับคืนสินค้า/ลดหนี้ บิล INV-9 ลูกค้า: บจก. Test jigjig ยอดคืน 100,000.00 ฿ | เหตุผล: ถุงขาด', '::1', '2026-04-28 04:25:24'),
(100, 'admin', '', 'INSERT', 'purchase_orders', 'สร้างใบสั่งซื้อใหม่ PO-16 (ซัพพลายเออร์: บจก. เกษตรไทยร่วมใจ) ยอดประเมิน 2,000.00 ฿', '::1', '2026-04-28 06:07:29'),
(101, 'admin', '', 'UPDATE', 'inventory_lots', 'รับวัตถุดิบลงลานจากซัพพลายเออร์ PO-16 (บิล: asdasda) และส่งกักกันรอ QA', '::1', '2026-04-28 06:08:03'),
(102, 'admin', '', 'UPDATE', 'qa_inbound_logs', 'QA ตรวจวัตถุดิบ 3K (Lot: REC-20260428-0016-702) สถานะ: ไม่ผ่าน (Rejected) | หมายเหตุ: ชิ้น', '::1', '2026-04-28 06:09:21'),
(103, 'admin', '', 'UPDATE', 'qa_outbound_logs', 'QA ตรวจสินค้าตีกลับ (RMA) อาหารหมู (Lot: RMA-20260428-S9-1403) สถานะ: ไม่ผ่าน (Rejected) | หมายเหตุ: ไม่สามารถ', '::1', '2026-04-28 06:10:20'),
(104, 'admin', '', 'INSERT', 'inventory_lots', 'บันทึกผลิต อาหารหมู สำเร็จ 5 หน่วย (Lot: LOT-20260428-0008) ต้นทุนรวม 0.00 ฿', '::1', '2026-04-28 06:23:52'),
(105, 'admin', '', 'UPDATE', 'qa_outbound_logs', 'QA ตรวจสินค้าสำเร็จรูป (FG) อาหารหมู (Lot: LOT-20260428-0008) สถานะ: ผ่าน (Approved) | หมายเหตุ: ผ่าน', '::1', '2026-04-28 06:28:44'),
(106, 'admin', '', 'DELETE', 'inventory_lots', 'ตัดชำรุดสินค้า FG อาหารหมู (Lot: LOT-20260428-0008) จำนวน 2 หน่วย | สาเหตุ: ถุงขาด', '::1', '2026-04-28 06:29:33'),
(107, 'admin', '', 'INSERT', 'product_formulas', 'สร้าง/อัปเดตสูตรการผลิต: สูตร 1', '::1', '2026-04-28 09:07:21');

-- --------------------------------------------------------

--
-- Table structure for table `time_attendance`
--

CREATE TABLE `time_attendance` (
  `id` int(11) NOT NULL,
  `userid` varchar(50) NOT NULL,
  `work_date` date NOT NULL,
  `clock_in` time DEFAULT NULL,
  `clock_out` time DEFAULT NULL,
  `late_minutes` int(11) DEFAULT 0 COMMENT 'จำนวนนาทีที่มาสาย',
  `remark` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `work_shifts`
--

CREATE TABLE `work_shifts` (
  `id` int(11) NOT NULL,
  `shift_name` varchar(100) NOT NULL,
  `start_time` time NOT NULL,
  `end_time` time NOT NULL,
  `grace_period` int(11) DEFAULT 0 COMMENT 'อนุญาตให้เข้าสายได้กี่นาที',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `work_shifts`
--

INSERT INTO `work_shifts` (`id`, `shift_name`, `start_time`, `end_time`, `grace_period`, `created_at`) VALUES
(1, 'กะเช้าปกติ (Office)', '08:00:00', '17:00:00', 15, '2026-04-21 03:31:53');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `announcements`
--
ALTER TABLE `announcements`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `company_holidays`
--
ALTER TABLE `company_holidays`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `holiday_date` (`holiday_date`);

--
-- Indexes for table `credit_requests`
--
ALTER TABLE `credit_requests`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `employees`
--
ALTER TABLE `employees`
  ADD PRIMARY KEY (`emp_id`);

--
-- Indexes for table `formulas`
--
ALTER TABLE `formulas`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `formula_items`
--
ALTER TABLE `formula_items`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `inventory_lots`
--
ALTER TABLE `inventory_lots`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `leave_quotas`
--
ALTER TABLE `leave_quotas`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_user_year` (`userid`,`year`);

--
-- Indexes for table `leave_records`
--
ALTER TABLE `leave_records`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `maintenance_parts_issue`
--
ALTER TABLE `maintenance_parts_issue`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `maintenance_requests`
--
ALTER TABLE `maintenance_requests`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ot_records`
--
ALTER TABLE `ot_records`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `part_issues`
--
ALTER TABLE `part_issues`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `payroll_records`
--
ALTER TABLE `payroll_records`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `po_items`
--
ALTER TABLE `po_items`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `production_orders`
--
ALTER TABLE `production_orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`,`p_code`);

--
-- Indexes for table `product_costs`
--
ALTER TABLE `product_costs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product_formulas`
--
ALTER TABLE `product_formulas`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `purchase_orders`
--
ALTER TABLE `purchase_orders`
  ADD PRIMARY KEY (`po_id`);

--
-- Indexes for table `purchase_requests`
--
ALTER TABLE `purchase_requests`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `qa_inbound_logs`
--
ALTER TABLE `qa_inbound_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `qa_inspections`
--
ALTER TABLE `qa_inspections`
  ADD PRIMARY KEY (`qa_id`);

--
-- Indexes for table `qa_outbound_logs`
--
ALTER TABLE `qa_outbound_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sales_items`
--
ALTER TABLE `sales_items`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sales_orders`
--
ALTER TABLE `sales_orders`
  ADD PRIMARY KEY (`sale_id`);

--
-- Indexes for table `sales_returns`
--
ALTER TABLE `sales_returns`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `scrap_records`
--
ALTER TABLE `scrap_records`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `stock_log`
--
ALTER TABLE `stock_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `suppliers`
--
ALTER TABLE `suppliers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `supplier_quotes`
--
ALTER TABLE `supplier_quotes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `system_logs`
--
ALTER TABLE `system_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `time_attendance`
--
ALTER TABLE `time_attendance`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_scan` (`userid`,`work_date`);

--
-- Indexes for table `work_shifts`
--
ALTER TABLE `work_shifts`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `announcements`
--
ALTER TABLE `announcements`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `company_holidays`
--
ALTER TABLE `company_holidays`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `credit_requests`
--
ALTER TABLE `credit_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `customers`
--
ALTER TABLE `customers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `employees`
--
ALTER TABLE `employees`
  MODIFY `emp_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=304;

--
-- AUTO_INCREMENT for table `formulas`
--
ALTER TABLE `formulas`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `formula_items`
--
ALTER TABLE `formula_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `inventory_lots`
--
ALTER TABLE `inventory_lots`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `leave_quotas`
--
ALTER TABLE `leave_quotas`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=296;

--
-- AUTO_INCREMENT for table `leave_records`
--
ALTER TABLE `leave_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `maintenance_parts_issue`
--
ALTER TABLE `maintenance_parts_issue`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `maintenance_requests`
--
ALTER TABLE `maintenance_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `ot_records`
--
ALTER TABLE `ot_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT for table `part_issues`
--
ALTER TABLE `part_issues`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `payroll_records`
--
ALTER TABLE `payroll_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `po_items`
--
ALTER TABLE `po_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `production_orders`
--
ALTER TABLE `production_orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1404;

--
-- AUTO_INCREMENT for table `product_costs`
--
ALTER TABLE `product_costs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `product_formulas`
--
ALTER TABLE `product_formulas`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `purchase_orders`
--
ALTER TABLE `purchase_orders`
  MODIFY `po_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `purchase_requests`
--
ALTER TABLE `purchase_requests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `qa_inbound_logs`
--
ALTER TABLE `qa_inbound_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `qa_inspections`
--
ALTER TABLE `qa_inspections`
  MODIFY `qa_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `qa_outbound_logs`
--
ALTER TABLE `qa_outbound_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `sales_items`
--
ALTER TABLE `sales_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `sales_orders`
--
ALTER TABLE `sales_orders`
  MODIFY `sale_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `sales_returns`
--
ALTER TABLE `sales_returns`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `scrap_records`
--
ALTER TABLE `scrap_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `stock_log`
--
ALTER TABLE `stock_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- AUTO_INCREMENT for table `suppliers`
--
ALTER TABLE `suppliers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `supplier_quotes`
--
ALTER TABLE `supplier_quotes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `system_logs`
--
ALTER TABLE `system_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=108;

--
-- AUTO_INCREMENT for table `time_attendance`
--
ALTER TABLE `time_attendance`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `work_shifts`
--
ALTER TABLE `work_shifts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
